return {
	['警探'] = {
		Parts1 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "基础伤害提升", "基础射速提升" },
		},
		Parts2 = {
			name = "暴击",
			need = { 150, 150 },
			desc = { "爆头伤害提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "后坐控制提升" },
		},
	},
	['逆焰'] = {
		Parts1 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "基础伤害提升", "基础射速提升" },
		},
		Parts2 = {
			name = "暴击",
			need = { 150, 150 },
			desc = { "爆头伤害提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "后坐控制提升" },
		},
	},
	['北极星'] = {
		Parts1 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "基础伤害提升", "基础射速提升" },
		},
		Parts2 = {
			name = "暴击",
			need = { 150, 150 },
			desc = { "爆头伤害提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "后坐控制提升" },
		},
	},
	['隼'] = {
		Parts1 = {
			name = "核心",
			need = { 150, 150 },
			desc = { "基础伤害提升", "基础射速提升" },
		},
		Parts2 = {
			name = "暴击",
			need = { 150, 150 },
			desc = { "爆头伤害提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "后坐控制提升" },
		},
	},
	['齿锋'] = {
		Parts1 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "基础伤害提升", "基础射速提升" },
		},
		Parts2 = {
			name = "暴击",
			need = { 150, 150 },
			desc = { "爆头伤害提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "后坐控制提升" },
		},
	},
	['影袭'] = {
		Parts1 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "基础伤害提升", "基础射速提升" },
		},
		Parts2 = {
			name = "暴击",
			need = { 150, 150 },
			desc = { "爆头伤害提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "后坐控制提升" },
		},
	},
	['审判官'] = {
		Parts1 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "基础伤害提升", "基础射速提升" },
		},
		Parts2 = {
			name = "暴击",
			need = { 150, 150 },
			desc = { "爆头伤害提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "后坐控制提升" },
		},
	},
	['彩绘'] = {
		Parts1 = {
			name = "核心",
			need = { 150, 150 },
			desc = { "基础伤害提升", "双发扳机" },
		},
		Parts2 = {
			name = "暴击",
			need = { 150, 150 },
			desc = { "爆头伤害提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "移动速度提升", "后坐控制提升" },
		},
	},
	['卫冕'] = {
		Parts1 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "基础伤害提升", "基础射速提升" },
		},
		Parts2 = {
			name = "暴击",
			need = { 150, 150 },
			desc = { "爆头伤害提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "机能",
			need = { 150, 150 },
			desc = { "移动速度提升", "开镜与切枪速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "后坐控制提升" },
		},
	},
	['空境'] = {
		Parts1 = {
			name = "核心",
			need = { 150, 150 },
			desc = { "拉栓速度提升", "蓄力速度提升" },
		},
		Parts2 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "移动速度提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "机能",
			need = { 150, 150 },
			desc = { "开镜速度提升", "切换快速高倍瞄具" },
		},
	},
	['自由意志'] = {
		Parts1 = {
			name = "核心",
			need = { 150, 150 },
			desc = { "全自动射击模式", "基础射速提升" },
		},
		Parts2 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "移动速度提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "开镜后弹丸收束" },
		},
	},
	['破晓'] = {
		Parts1 = {
			name = "核心",
			need = { 150, 150 },
			desc = { "开镜速度提升", "基础射速提升" },
		},
		Parts2 = {
			name = "暴击",
			need = { 150, 150 },
			desc = { "爆头伤害提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "多重射击模式" },
		},
	},
	['幻霜'] = {
		Parts1 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "基础伤害提升", "基础射速提升" },
		},
		Parts2 = {
			name = "暴击",
			need = { 150, 150 },
			desc = { "爆头伤害提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "操控",
			need = { 150, 150 },
			desc = { "移动速度提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "后坐控制提升" },
		},
	},
	['谢幕曲'] = {
		Parts1 = {
			name = "核心",
			need = { 150, 150 },
			desc = { "拉栓速度提升", "蓄力速度提升" },
		},
		Parts2 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "移动速度提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "机能",
			need = { 150, 150 },
			desc = { "开镜速度提升", "切换快速高倍瞄具" },
		},
	},
	['独舞'] = {
		Parts1 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "基础伤害提升", "基础射速提升" },
		},
		Parts2 = {
			name = "暴击",
			need = { 150, 150 },
			desc = { "爆头伤害提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "后坐控制提升" },
		},
	},
	['鸣火'] = {
		Parts1 = {
			name = "核心",
			need = { 150, 150 },
			desc = { "双发扳机", "基础射速提升" },
		},
		Parts2 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "移动速度提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "开镜后弹丸收束" },
		},
	},
	['欺诈师'] = {
		Parts1 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "基础伤害提升", "基础射速提升" },
		},
		Parts2 = {
			name = "暴击",
			need = { 150, 150 },
			desc = { "爆头伤害提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "后坐控制提升" },
		},
	},
	['绽放'] = {
		Parts1 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "基础伤害提升", "基础射速提升" },
		},
		Parts2 = {
			name = "暴击",
			need = { 150, 150 },
			desc = { "爆头伤害提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "后坐控制提升" },
		},
	},
	['绝对执行'] = {
		Parts1 = {
			name = "核心",
			need = { 150, 150 },
			desc = { "基础伤害提升", "基础射速提升" },
		},
		Parts2 = {
			name = "暴击",
			need = { 150, 150 },
			desc = { "爆头伤害提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "后坐控制提升" },
		},
	},
	['校准仪'] = {
		Parts1 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "基础伤害提升", "基础射速提升" },
		},
		Parts2 = {
			name = "暴击",
			need = { 150, 150 },
			desc = { "爆头伤害提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "开镜与切枪速度提升" },
		},
	},
	['夜镰'] = {
		Parts1 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "基础伤害提升", "基础射速提升" },
		},
		Parts2 = {
			name = "暴击",
			need = { 150, 150 },
			desc = { "爆头伤害提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "后坐控制提升" },
		},
	},
	['枫鸣'] = {
		Parts1 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "基础伤害提升", "基础射速提升" },
		},
		Parts2 = {
			name = "暴击",
			need = { 150, 150 },
			desc = { "爆头伤害提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "后坐控制提升" },
		},
	},
	['潮音'] = {
		Parts1 = {
			name = "核心",
			need = { 150, 150 },
			desc = { "开镜与切枪速度提升", "基础射速提升" },
		},
		Parts2 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "移动速度提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "独头弹模式" },
		},
	},
	['雨晦'] = {
		Parts1 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "基础伤害提升", "五连发射击模式" },
		},
		Parts2 = {
			name = "暴击",
			need = { 150, 150 },
			desc = { "爆头伤害提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "后坐控制提升" },
		},
	},
	['静风'] = {
		Parts1 = {
			name = "核心",
			need = { 150, 150 },
			desc = { "精准箭矢", "分裂箭矢" },
		},
		Parts2 = {
			name = "暴击",
			need = { 150, 150 },
			desc = { "爆头伤害提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "操控",
			need = { 150, 150 },
			desc = { "移动速度提升", "开镜与切枪速度提升" },
		},
	},
}
