return {
    ["米雪儿·李"] = {
        ["主动技能"] = {
            {
                ["Name"] = "喵喵卫士",
                ["Intro"] = "米雪儿投掷可附着在建筑表面的喵喵卫士，喵喵卫士将自动攻击一定范围内的敌方角色，并使其减速。米雪儿与喵喵卫士距离过远时，喵喵卫士会停止工作。"
            }
        },
        ["被动技能"] = {
            {
                ["Name"] = "猫踪喵迹",
                ["Intro"] = "米雪儿会短暂透视使用武器直接命中自己的敌人。"
            }
        },
        ["终极技能"] = {
            {
                ["Name"] = "火力大喵",
                ["Intro"] = "米雪儿部署一架强大火力的火力炮艇，火力炮艇将自动攻击一定范围内的敌方角色。"
            }
        },
        ["战术技能"] = {
            {
                ["Name"] = "破法喵喵",
                ["Intro"] = "米雪儿抛出能附着在建筑表面的破法喵喵，破法喵喵可被米雪儿主动激活，并在短暂延迟后对周围敌人造成沉默效果。"
            }
        },
        ["技能觉醒"] = {
            {
                ["Name"] = "猫眼锁定",
                ["Intro"] = "敌方单位被喵喵卫士攻击时会被持续透视。"
            },
            {
                ["Name"] = "猫咪守护",
                ["Intro"] = "当米雪儿的召唤物在米雪儿周围45米内阵亡时，米雪儿会获得45点临时护甲。"
            },
            {
                ["Name"] = "猫咪羁绊",
                ["Intro"] = "当米雪儿处在召唤物15米范围内时，米雪儿会增加射速和人机工效。"
            }
        }
    },
    ["奥黛丽·格罗夫"] = {
        ["主动技能"] = {
            {
                ["Name"] = "重火倾泄",
                ["Intro"] = "进入架设状态，大幅提升射速，无后坐力，连续射击不需更换弹匣。若奥黛丽的连续射击时间过长，便会进入枪口过热状态无法射击。"
            }
        },
        ["被动技能"] = {
            {
                ["Name"] = "皇家盾牌",
                ["Intro"] = "奥黛丽进入架枪模式或进入开镜模式时，召唤护盾守护自身正面，且架枪模式下会获得额外护盾最大值。"
            }
        },
        ["终极技能"] = {
            {
                ["Name"] = "狂轰滥炸",
                ["Intro"] = "奥黛丽架设一把榴弹发射器，可发射六枚榴弹炮。榴弹炮爆炸后会分裂成弹跳炸弹，弹跳炸弹爆炸时将于地面生成火海，灼烧敌人和自身，弦化状态的敌人会受到额外伤害。"
            }
        },
        ["战术技能"] = {
            {
                ["Name"] = "警报雷达",
                ["Intro"] = "奥黛丽丢出一个警报雷达，雷达落地后展开并对周围持续进行扫描，扫描到敌人时提示敌人的数量并对敌人施加短暂透视效果。"
            }
        },
        ["技能觉醒"] = {
            {
                ["Name"] = "无限火力",
                ["Intro"] = "奥黛丽的主武器不再需要换弹，但常规状态的射击会和重火力状态一样使枪管受热。"
            },
            {
                ["Name"] = "自动机枪",
                ["Intro"] = "架设机枪时，长按主动技能键，会从机枪上撤离，机枪会自动攻击敌人。再按下主动技能键，可收回机枪。"
            },
            {
                ["Name"] = "可动轨道",
                ["Intro"] = "奥黛丽在发动主动或终极技能时，左右两侧会延展出光缆轨道，使自身可以在架设机枪的同时进行左右移动。"
            }
        }
    },
    ["明"] = {
        ["主动技能"] = {
            {
                ["Name"] = "破甲电球",
                ["Intro"] = "明发射一个电球，其达到最大距离、碰到敌方超弦体时会自动引爆，也可通过手动再次按下技能键后主动引爆。电球会破坏范围内所有敌方单位（包含召唤物）的护甲并造成减速。明进入电场将提升移动速度。"
            }
        },
        ["被动技能"] = {
            {
                ["Name"] = "吸能赋甲",
                ["Intro"] = "明的枪械会对敌方护甲造成额外伤害。明使用枪械和主动技能对敌方护甲造成伤害时，自己的护甲将基于该伤害量进行回复。绝招持续时间内，被动会回复临时护甲并增加回复量。"
            }
        },
        ["终极技能"] = {
            {
                ["Name"] = "强雷铸甲",
                ["Intro"] = "明获得临时护甲并使自己的射击附带可叠加的减速效果。明使用枪械和主动技能对敌人的护甲造成伤害时，可延长该技能持续时间并回复临时护甲。"
            }
        },
        ["战术技能"] = {
            {
                ["Name"] = "爆闪电球",
                ["Intro"] = "明可以发射一个闪光电球，再次按下技能键后或是到达最大飞行时间后引爆，并对周围所有敌人造成致盲效果，引爆前有一段延迟，延迟期间内闪光电球可以被摧毁。"
            }
        },
        ["技能觉醒"] = {
            {
                ["Name"] = "轮回战意",
                ["Intro"] = "当明完全失去护甲时，会提升自身的移速，持续一段时间。再次触发该效果将刷新移速增幅的持续时间。"
            },
            {
                ["Name"] = "破甲吸收",
                ["Intro"] = "明的电磁弹首段爆炸对敌方角色造成有效伤害时，会给明增加一定的临时护甲。"
            },
            {
                ["Name"] = "雷电充能",
                ["Intro"] = "明处于电磁弹生成的电磁场中时会恢复护甲，该效果不会被伤害中断。"
            }
        }
    },
    ["玛德蕾娜·利里"] = {
        ["主动技能"] = {
            {
                ["Name"] = "颜料束缚",
                ["Intro"] = "玛德蕾娜发射一滩颜料，经过这滩颜料的敌人将被减速、弦化禁止并暴露脚印。"
            }
        },
        ["被动技能"] = {
            {
                ["Name"] = "颜料脚印",
                ["Intro"] = "玛德蕾娜使用主武器命中敌方角色时，可使敌方角色减速并暴露脚印。"
            }
        },
        ["终极技能"] = {
            {
                ["Name"] = "颜料泡泡",
                ["Intro"] = "玛德蕾娜发射巨大泡泡，泡泡内的敌人将被禁止弦化且暴露脚印。泡泡爆炸后将对爆炸范围内的敌人施加额外的减速和易伤效果。"
            }
        },
        ["战术技能"] = {
            {
                ["Name"] = "颜料泡涌",
                ["Intro"] = "玛德蕾娜向前方发射颜料泡，颜料泡会对碰到的敌人施加减速、弦化禁止和暴露脚印效果。"
            }
        },
        ["技能觉醒"] = {
            {
                ["Name"] = "颜料潜行",
                ["Intro"] = "玛德蕾娜贴墙移动至颜料区域内时，会潜入颜料，潜入后会缓慢回复生命值。"
            },
            {
                ["Name"] = "颜料封锁",
                ["Intro"] = "主动技能射出的颜料在飞行时，会向下生成一道颜料线，留下颜料区域。"
            },
            {
                ["Name"] = "阻碍泡泡",
                ["Intro"] = "颜料区域上方会生成一个泡泡，泡泡会遮挡视野，敌方触碰后会立即爆炸并施加颜料Debuff。"
            }
        }
    },
    ["拉薇"] = {
        ["主动技能"] = {
            {
                ["Name"] = "寻影猎刃",
                ["Intro"] = "拉薇投掷脉冲刀，制造一个磁力场，将一定范围内的敌方单位暴露给拉薇及其队友，脉冲刀每次扫描探测不到敌人时会立刻消失，最多扫描三次。"
            }
        },
        ["被动技能"] = {
            {
                ["Name"] = "曝影显踪",
                ["Intro"] = "拉薇主武器命中敌方单位时，会将其短暂透视给自己。"
            }
        },
        ["终极技能"] = {
            {
                ["Name"] = "遁影藏踪",
                ["Intro"] = "拉薇于自身正前方生成一片矩形磁场。拉薇进入磁场时将进入隐身状态，隐身状态下的拉薇无法射击。敌方角色进入或离开磁场时，会受到短暂的透视效果。"
            }
        },
        ["战术技能"] = {
            {
                ["Name"] = "闪影猎刃",
                ["Intro"] = "拉薇可以扔出一把闪光脉冲刀，脉冲刀插在障碍物上后引爆，并对周围所有敌人造成致盲效果，引爆前有一段延迟，延迟期间内飞刀可以被摧毁。"
            }
        },
        ["技能觉醒"] = {
            {
                ["Name"] = "静谧之眼",
                ["Intro"] = "拉薇造成任何伤害后，会将所有受到拉薇伤害的敌方单位都透视给自己及全体队友。"
            },
            {
                ["Name"] = "捕影牢笼",
                ["Intro"] = "脉冲刀会对扫描到的目标附加一段电磁锁链，当敌人逃离脉冲刀的侦察范围时会被减速。"
            },
            {
                ["Name"] = "警报陷阱",
                ["Intro"] = "脉冲刀在扫描不到敌人后不再会消失，如果有敌人处于其扫描范围内将会再次启动扫描，达到最大时间后销毁。"
            }
        }
    },
    ["信"] = {
        ["主动技能"] = {
            {
                ["Name"] = "守望之眼",
                ["Intro"] = "信可布置至多两个守望之眼，信自身在守望之眼的范围内将获得射速和人机工效提升并回复护甲；两个守望之眼互相连接时，人机工效提升和回复护甲的效果将被强化。"
            }
        },
        ["被动技能"] = {
            {
                ["Name"] = "致盲脉冲",
                ["Intro"] = "开镜状态下的信会积蓄能量，能量蓄满后，信的下次射击在命中敌人时将使敌人的武器肩射散布增大、在开镜状态下丢失准星并丧失精准度。"
            }
        },
        ["终极技能"] = {
            {
                ["Name"] = "脉冲过载",
                ["Intro"] = "信原地部署一个向四周不断发射脉冲波的脉冲装置，被脉冲波命中的敌人将被透视给全体队友且进入一段时间的沉默状态。"
            }
        },
        ["战术技能"] = {
            {
                ["Name"] = "脉冲地雷",
                ["Intro"] = "信向目标方向投出一个地雷，地雷部署完毕后会进入敌方靠近后才会显形的隐身状态，当地雷检测到敌人后会引爆并对范围内的敌人和自身造成持续伤害。"
            }
        },
        ["技能觉醒"] = {
            {
                ["Name"] = "卫戍之眼",
                ["Intro"] = "在线圈内，信可免疫一次致命伤害，保留1点生命值并回复一定量的护甲值。"
            },
            {
                ["Name"] = "曝影之眼",
                ["Intro"] = "进入信线圈范围的敌方角色/召唤物会被信及其队友透视。这个透视效果会在其离开线圈后持续一段时间。"
            },
            {
                ["Name"] = "脉冲跃迁",
                ["Intro"] = "信可从一个线圈传送至另一个线圈。"
            }
        }
    },
    ["绯莎"] = {
        ["主动技能"] = {
            {
                ["Name"] = "残息追踪",
                ["Intro"] = "对周围敌人感知，满血敌人被短暂透视，生命值不满则被持续透视，上述效果仅自己可视。感应到敌人将增加绯莎的移动速度。"
            }
        },
        ["被动技能"] = {
            {
                ["Name"] = "以战养战",
                ["Intro"] = "绯莎参与击破时，死亡的敌人将原地掉落能量晶体。绯莎可以靠近并吸收能量晶体，回复自身生命值。绯莎第一次吸取能量晶体时可增加自身生命值上限。"
            }
        },
        ["终极技能"] = {
            {
                ["Name"] = "浴血狂戮",
                ["Intro"] = "绯莎大幅度提升自身的射速和人机工效，并使得主动技能可令视野内敌人高亮。吸收能量晶体将延长该效果持续时间。"
            }
        },
        ["战术技能"] = {
            {
                ["Name"] = "猩红猛冲",
                ["Intro"] = "绯莎消耗当前一定百分比生命值，获得移速提升效果，持续一段时间。"
            }
        },
        ["技能觉醒"] = {
            {
                ["Name"] = "强能吸收",
                ["Intro"] = "扩大绯莎晶体吸收的距离至全图范围。"
            },
            {
                ["Name"] = "魔鲨再临",
                ["Intro"] = "绯莎倒地时，会在短暂时间后自动站起。"
            },
            {
                ["Name"] = "追猎恐惧",
                ["Intro"] = "绯莎释放主动技能的瞬间，主动技能范围内的敌方角色将被减速，持续一段时间。"
            }
        }
    },
    ["星绘"] = {
        ["主动技能"] = {
            {
                ["Name"] = "守护星芒",
                ["Intro"] = "星绘选择一个友方角色，投掷流星弦能，赋予其临时护甲。之后流星弦能将返回星绘身边，赋予星绘临时护甲。"
            }
        },
        ["被动技能"] = {
            {
                ["Name"] = "星弦甲生",
                ["Intro"] = "星绘周围有友方角色时，可缓慢恢复该角色与自身的护甲值。"
            }
        },
        ["终极技能"] = {
            {
                ["Name"] = "星空之门",
                ["Intro"] = "星绘选择一个友方角色，为该队友和自身提供临时护甲值，并开始蓄能。蓄能完毕后，星绘将传送到该角色身边，蓄能期间按下大招键可取消传送（不取消护甲增益）。"
            }
        },
        ["战术技能"] = {
            {
                ["Name"] = "塑甲星芒",
                ["Intro"] = "星绘投掷出星芒，星芒触碰到障碍物时爆炸生效，制造一片护甲恢复区域，进入区域内的友方角色获得护甲恢复效果，该恢复效果不会被伤害中断，并在护甲已满时溢出成为临时护甲。"
            }
        },
        ["技能觉醒"] = {
            {
                ["Name"] = "塑甲流星",
                ["Intro"] = "主动技能将附加护甲回复效果，持续一段时间。"
            },
            {
                ["Name"] = "闪耀星光",
                ["Intro"] = "主动技能附带额外效果：当护甲被破坏时，星光会从头顶飞出并致盲敌人。"
            },
            {
                ["Name"] = "星能强注",
                ["Intro"] = "主动技能命中时将立即回复一定的护甲值。"
            }
        }
    },
    ["心夏"] = {
        ["主动技能"] = {
            {
                ["Name"] = "治疗无人机",
                ["Intro"] = "心夏选择自己或一个友方角色为目标生成—个治疗无人机，无人机可以为被释放目标回复护甲，并给无人机周围所有友方目标回复生命值。"
            }
        },
        ["被动技能"] = {
            {
                ["Name"] = "急速救援",
                ["Intro"] = "心夏会在未受击时缓慢回复自身生命值，同时在救援友方角色时，心夏会放出援护无人机自动扶起队友。"
            }
        },
        ["终极技能"] = {
            {
                ["Name"] = "卡丘重塑",
                ["Intro"] = "心夏选择一个阵亡的友方角色，将其复活在自己附近。"
            }
        },
        ["战术技能"] = {
            {
                ["Name"] = "医疗站点",
                ["Intro"] = "心夏可以定点部署一个治疗无人机，无人机会制造一大片治疗场，处在区域内的队友会持续恢复生命值，该恢复效果不会被伤害中断。"
            }
        },
        ["技能觉醒"] = {
            {
                ["Name"] = "妙手回春",
                ["Intro"] = "治疗无人机开始治疗友方单位时，会瞬间恢复大量生命值，之后持续回复生命值。"
            },
            {
                ["Name"] = "群甲复苏",
                ["Intro"] = "无人机的护甲回复能力不再限于被释放目标，它现在可以给周围所有友方都回复护甲。"
            },
            {
                ["Name"] = "守护卫戍",
                ["Intro"] = "治疗无人机可以为治疗目标阻挡子弹类伤害，当敌人攻击治疗目标时会优先消耗无人机的生命值。"
            }
        }
    },
    ["梅瑞狄斯"] = {
        ["主动技能"] = {
            {
                ["Name"] = "金沙热浪",
                ["Intro"] = "梅瑞狄斯打出一颗弦能球体，于落点处创造一片黄沙领域，降低敌方角色移速和人机工效一段时间并暂时削减其生命值。"
            }
        },
        ["被动技能"] = {
            {
                ["Name"] = "时零沙环",
                ["Intro"] = "滞空状态下，当梅瑞狄斯进入技能瞄准、武器瞄准或者战术瞄准的状态时，自身的下落速度会被降低。"
            }
        },
        ["终极技能"] = {
            {
                ["Name"] = "流沙大葬",
                ["Intro"] = "梅瑞狄斯投掷出一个能制造巨大沙暴领域的金字塔。沙暴领域可以遮蔽视野，并暂时削减敌方角色生命值。"
            }
        },
        ["战术技能"] = {
            {
                ["Name"] = "盲眼迷沙",
                ["Intro"] = "梅瑞狄斯向目标方向发射弦能球体，于落点处创造一片完全遮蔽视野的环状黄沙领域。"
            }
        },
        ["技能觉醒"] = {
            {
                ["Name"] = "卷地风沙",
                ["Intro"] = "黄沙领域内的友方角色处于飘飞状态时将会被向上吹起。"
            },
            {
                ["Name"] = "连环沙暴",
                ["Intro"] = "主动技能可进行一次额外的反弹并生成至多2个黄沙领域。"
            },
            {
                ["Name"] = "飞沙走石",
                ["Intro"] = "黄沙领域内的敌人视野范围会受到极大限制。"
            }
        }
    },
    ["令"] = {
        ["主动技能"] = {
            {
                ["Name"] = "破晓帷幕",
                ["Intro"] = "令使用自己的伞制造出一堵可以纵向释放或者横向释放的弦能光幕，光幕会遮蔽视野。"
            }
        },
        ["被动技能"] = {
            {
                ["Name"] = "黎明洞悉",
                ["Intro"] = "在保持开镜状态时，令每一段时间会扫描一遍前方敌人及其召唤物，使其透视，仅令可见。"
            }
        },
        ["终极技能"] = {
            {
                ["Name"] = "庇护圣屏",
                ["Intro"] = "立即刷新主动技能，在持续时间内增强光幕，使其能够格挡所有来自敌方角色的子弹。"
            }
        },
        ["战术技能"] = {
            {
                ["Name"] = "圣屏突进",
                ["Intro"] = "令释放一个可以向前推进的光幕，该光幕在准备释放阶段能够设置最终落点。"
            }
        },
        ["技能觉醒"] = {
            {
                ["Name"] = "警戒光幕",
                ["Intro"] = "敌方角色穿越令的光幕会被短暂暴露。"
            },
            {
                ["Name"] = "审判光幕",
                ["Intro"] = "敌方角色穿越光幕，会被无效化35点护甲上限持续5秒。友方穿越光幕时，会获得20点临时护甲，在6秒内反复经过只会获得一次。"
            },
            {
                ["Name"] = "近光漫散",
                ["Intro"] = "友方角色靠近光幕时，光幕会变成半透明状态，敌方则始终无法看透光幕。"
            }
        }
    },
    ["白墨"] = {
        ["主动技能"] = {
            {
                ["Name"] = "炫空斗舞",
                ["Intro"] = "白墨进入弦化状态，向前翻转跳跃贴近敌人，并为主武器自动补充子弹。白墨使用主武器命中敌方角色时，每发命中的弹丸都会返还部分炫空斗舞的冷却时间。"
            }
        },
        ["被动技能"] = {
            {
                ["Name"] = "嘻哈嘣彩",
                ["Intro"] = "白墨的主武器单次射击命中敌人造成至少50点伤害后，使其弦化禁止。"
            }
        },
        ["终极技能"] = {
            {
                ["Name"] = "重返街头！",
                ["Intro"] = "白墨原地放置一个重生信标，死亡或倒地时可以立即在信标处重生。白墨可以选择主动返回信标，并回复全部生命值。"
            }
        },
        ["战术技能"] = {
            {
                ["Name"] = "爆炸涂鸦",
                ["Intro"] = "白墨快速向前投掷出颜料罐，颜料罐爆炸时对周围敌人造成禁止弦化效果。"
            }
        },
        ["技能觉醒"] = {
            {
                ["Name"] = "涂鸦嘣彩",
                ["Intro"] = "被动触发时，对敌人的视野遮罩效果将更加强烈，能遮住敌人的大部分屏幕。"
            },
            {
                ["Name"] = "彩墨冲锋！",
                ["Intro"] = "白墨使用主动技能结束时，会在落点处溅起颜料，对周围敌人造成短暂视野遮蔽效果."
            },
            {
                ["Name"] = "戏敌无影！",
                ["Intro"] = "白墨使用主动技能将进入隐身状态，并在起跳位置留下持续一段时间的静止假身，主动技能结束时隐身结束。"
            }
        }
    },
    ["香奈美"] = {
        ["主动技能"] = {
            {
                ["Name"] = "旋律回响",
                ["Intro"] = "香奈美可以用枪射出声呐片，声呐片会释放出声波实时探查一定范围内无建筑障碍物遮挡的敌人，被发现的敌人会暴露给香奈美及其队友。"
            }
        },
        ["被动技能"] = {
            {
                ["Name"] = "交响爆音",
                ["Intro"] = "香奈美的主武器发射子弹之后，会以子弹落点范围产生一个圆形音波区，处在音波区内的敌人信息会被暴露给香奈美自己。"
            }
        },
        ["终极技能"] = {
            {
                ["Name"] = "演出开始",
                ["Intro"] = "香奈美在战场内展开舞台，舞台展开后开始播放音乐，所有在舞台一定范围内的敌人都会被歌声吸引、减速、丢失准星的同时还会被晕眩，降低射速。"
            }
        },
        ["战术技能"] = {
            {
                ["Name"] = "律动旋风",
                ["Intro"] = "香奈美可以扔出一个迷你音响，制造一大片声风场区域，该风场会将所有进入风场内的角色吹起。在被吹起期间，敌方角色受到晕眩效果，友方角色获得移速提升效果，上述效果在离开风场区域后还会持续一段时间。"
            }
        },
        ["技能觉醒"] = {
            {
                ["Name"] = "爆音打击",
                ["Intro"] = "香奈美主武器子弹现在会造成范围爆炸伤害，并且队友也可以看到被她探测到的敌人。"
            },
            {
                ["Name"] = "震撼律动",
                ["Intro"] = "被声呐片扫描到的敌人会被声呐片定位，在一定时间之后没有脱离范围则会被晕眩并降低射速。"
            },
            {
                ["Name"] = "旋律鼓舞",
                ["Intro"] = "处于声呐片影响范围内的队友将增加移速，人机工效，射速。"
            }
        }
    },
    ["220"] = {
        ["主动技能"] = {
        },
        ["被动技能"] = {
        },
        ["终极技能"] = {
        },
        ["战术技能"] = {
        },
        ["技能觉醒"] = {
        }
    },
    ["221"] = {
        ["主动技能"] = {
        },
        ["被动技能"] = {
        },
        ["终极技能"] = {
        },
        ["战术技能"] = {
        },
        ["技能觉醒"] = {
        }
    },
    ["伊薇特"] = {
        ["主动技能"] = {
            {
                ["Name"] = "熊熊出击",
                ["Intro"] = "伊薇特召出战术熊，熊可以冲撞，撞到障碍物或是再次按下左键会在地面上留下冰面。冰面附带打滑和易伤效果。"
            }
        },
        ["被动技能"] = {
            {
                ["Name"] = "皑皑藏雪",
                ["Intro"] = "伊薇特站立不动一段时间后，会进入迷彩状态，远处的敌人看不见伊薇特，当愈发靠近时才会慢慢显示其轮廓。"
            }
        },
        ["终极技能"] = {
            {
                ["Name"] = "爽爽霜风",
                ["Intro"] = "伊薇特召唤出一只巨大的冰霜熊，分三段展开极寒领域，敌人在此将受到打滑和易伤，降低射速及人机工效的效果。"
            }
        },
        ["战术技能"] = {
            {
                ["Name"] = "坚坚冰柱",
                ["Intro"] = "伊薇特可以投掷出一个冰球，冰球落在地面后会在落点生成一块巨大的冰柱，冰柱拥有高额生命值且会阻挡敌我双方的子弹，站在冰柱附近的敌人会受到打滑和易伤的效果，冰柱无法在有角色或召唤物的地方生成。"
            }
        },
        ["技能觉醒"] = {
            {
                ["Name"] = "熊熊冰爆",
                ["Intro"] = "当伊薇特战术熊消失时会自爆，处于爆炸中心的敌人会短暂受到一段强力减速效果，并留下冰面。"
            },
            {
                ["Name"] = "熊熊打雪仗",
                ["Intro"] = "战术熊不再能冲刺，而是改为投掷雪球，雪球砸中敌人、地面时会爆炸产生冰面，被炸中的目标也会受到伤害。"
            },
            {
                ["Name"] = "熊熊突袭",
                ["Intro"] = "熊现在会自动搜寻可视敌人，如果目标处在熊的可冲撞范围内，则会朝目标自动发起冲撞，并在撞到障碍物时产生冰面。"
            }
        }
    },
    ["芙拉薇娅"] = {
        ["主动技能"] = {
            {
                ["Name"] = "致幻魅影",
                ["Intro"] = "芙拉薇娅召唤幻蝶短时间跟随自己，期间受到攻击损失生命值时进入短时间的无敌状态并原地生成一个致幻球。致幻球限制敌方视野且可被击碎。"
            }
        },
        ["被动技能"] = {
            {
                ["Name"] = "周生复始",
                ["Intro"] = "芙拉薇娅累计受到少量伤害时会减少主动技能的冷却时间；累计受到大量伤害时会获得临时绝招点数，通过此方式获得的绝招点数当前回合有效。"
            }
        },
        ["终极技能"] = {
            {
                ["Name"] = "幻梦化蝶",
                ["Intro"] = "芙拉薇娅以自身为中心释放致幻领域，领域内的敌方单位造成致命伤害时，芙拉薇娅会化身为蝴蝶，短时间后重塑身体，继续战斗。领域外敌方无视重塑规则但仅在被攻击时可视芙拉薇娅。"
            }
        },
        ["战术技能"] = {
            {
                ["Name"] = "遁入幻境",
                ["Intro"] = "芙拉薇娅引动弦能，以自身为中心生成致幻烟雾，敌方角色进入烟雾范围内时会被短暂限制视野。芙拉薇娅可以在化蝶状态使用该技能，这样做将立即解除化蝶状态。"
            }
        },
        ["技能觉醒"] = {
            {
                ["Name"] = "幻梦再生",
                ["Intro"] = "放出致幻球后，芙拉薇娅将在一段时间内持续回复生命值。"
            },
            {
                ["Name"] = "幻蝶乍现",
                ["Intro"] = "主动技能的效果改为召唤幻蝶后立即进入短时间的无敌隐身状态，并留下致幻球。"
            },
            {
                ["Name"] = "化甲幻蝶",
                ["Intro"] = "致幻球持续时间耗尽或被击破后，敌方对致幻球已造成的伤害将以一定比例转化为芙拉薇娅的临时护甲。"
            }
        }
    },
    ["艾卡"] = {
        ["主动技能"] = {
            {
                ["Name"] = "炼狱牢笼",
                ["Intro"] = "在面前生成一个球形火焰牢狱，敌人穿过牢壁时受到火焰伤害，弦化状态的敌人受到的伤害更高。火焰牢狱内没有敌人时会提前结束。艾卡在火焰牢狱内时，使用主武器可对同处内部的敌人造成额外火焰伤害。消耗100热量所获增益：敌人穿过牢壁时受到的伤害更高。"
            }
        },
        ["被动技能"] = {
            {
                ["Name"] = "日珥蓄火",
                ["Intro"] = "每次射击命中敌人会积攒热量，热量值最多为100。满热时对弦化敌人造伤能力增强。满热下，其他技能可以消耗热量获得强化。"
            }
        },
        ["终极技能"] = {
            {
                ["Name"] = "烈焰风暴",
                ["Intro"] = "本回合内最多丢出3道烈焰风暴，烈焰风暴会吹飞敌人并造成火焰伤害。每发消耗100热量所获增益：风暴更大，伤害更高，且敌人高亮。"
            }
        },
        ["战术技能"] = {
            {
                ["Name"] = "爆焰热弹",
                ["Intro"] = "艾卡可以快速丢出一枚爆焰火球，火球落地时造成伤害，对弦化状态的敌人造成额外伤害。消耗100热量所获增益：提升伤害并附带减速效果。"
            }
        },
        ["技能觉醒"] = {
            {
                ["Name"] = "燃弦之焰",
                ["Intro"] = "敌人在主动技能范围内弦化时，会受到火焰烧伤。"
            },
            {
                ["Name"] = "热焰袭卷",
                ["Intro"] = "自己开启主动技能后，炼狱牢笼半径会每秒向内收缩，直到达到最小半径。"
            },
            {
                ["Name"] = "复原之焰",
                ["Intro"] = "每次消耗热量时，自己可以基于热量值一定比例恢复生命。当热量自然衰减时，也会恢复生命值。"
            }
        }
    },
    ["加拉蒂亚·利里"] = {
        ["主动技能"] = {
            {
                ["Name"] = "飞牌瞬闪",
                ["Intro"] = "加拉蒂亚释放出一张卡牌以弧线飞出，卡牌碰到地面、墙面时会生成分身，按下交互键可以传送到分身位置。"
            }
        },
        ["被动技能"] = {
            {
                ["Name"] = "欺诈牌影",
                ["Intro"] = "当加拉蒂亚脱离墙面时，会在贴墙位置留下一个分身，每次下墙都会重新生成分身，当分身受伤时该被动进入冷却。加拉蒂亚的每一个分身在生成时都可以短暂探测周围无建筑障碍物遮挡的敌人给加拉蒂亚及全体友方，攻击分身的敌人也会被暂时暴露。"
            }
        },
        ["终极技能"] = {
            {
                ["Name"] = "牌影戏法",
                ["Intro"] = "加拉蒂亚朝前方随意投出大量卡牌，每一个卡牌都可以生成分身并让加拉蒂亚传送。"
            }
        },
        ["战术技能"] = {
            {
                ["Name"] = "致盲牌影",
                ["Intro"] = "加拉蒂亚可以释放一个特殊的卡片分身，加拉蒂亚无法传送到该分身的位置，该分身被敌人摧毁时，会对周围所有敌人造成闪光效果。"
            }
        },
        ["技能觉醒"] = {
            {
                ["Name"] = "切牌换影",
                ["Intro"] = "现在被动留下的分身也可以被传送。"
            },
            {
                ["Name"] = "瞬闪隐迹",
                ["Intro"] = "当加拉蒂亚传送到目的地时，自身会隐身并进入空手状态3秒，隐身期间获得更快的移速。"
            },
            {
                ["Name"] = "王车易位",
                ["Intro"] = "加拉蒂亚传送成功后，会和假身互换位置，在传送前所处的位置留下一个3D假身。"
            }
        }
    },
    ["珐格兰丝"] = {
        ["主动技能"] = {
            {
                ["Name"] = "活力芬芳",
                ["Intro"] = "珐格兰丝可以释放两种有限数量的香水。释放后会以自己为中心创造香氛区域，区域内己方会获得射速或移速提升，香氛效果会随着时间推移逐渐减弱，最终消失。"
            }
        },
        ["被动技能"] = {
            {
                ["Name"] = "复苏芳香",
                ["Intro"] = "珐格兰丝会散发淡淡的恢复香氛，附近的队友和自己都会缓慢恢复生命值。"
            }
        },
        ["终极技能"] = {
            {
                ["Name"] = "激昂芬芳",
                ["Intro"] = "珐格兰丝会以自己为中心制造强烈香氛区域，区域内友军会获得高额射速、移速提升和生命值恢复，该效果不会衰减且生命值恢复不会被伤害中断，释放期间珐格兰丝无法使用武器，但会获得大幅减伤。"
            }
        },
        ["战术技能"] = {
            {
                ["Name"] = "香语众氛",
                ["Intro"] = "珐格兰丝投掷出治疗香水，治疗香水触碰到障碍物时爆炸生效，制造一片生命恢复区域，进入区域内的友方角色暂时提升生命值上限，并获得生命恢复效果，该恢复效果不会被伤害中断。"
            }
        },
        ["技能觉醒"] = {
            {
                ["Name"] = "复苏微香",
                ["Intro"] = "在释放主动技能的瞬间，会使当时处在范围内的队友获得缓慢减弱的回复效果。"
            },
            {
                ["Name"] = "复合香调",
                ["Intro"] = "香水释放后会同时增加移速和射速，且该效果不会减弱，但效果持续时间会减少且只会给释放瞬间处在范围内的所有友军赋予效果。"
            },
            {
                ["Name"] = "衔芳持香",
                ["Intro"] = "主动技能释放的香水持续效果现在不会消失了，会在减弱到一个较低水平之后维持该水平，切换香水种类后会更换持续的效果。"
            }
        }
    },
    ["蕾欧娜"] = {
        ["主动技能"] = {
            {
                ["Name"] = "弦能掩墙",
                ["Intro"] = "蕾欧娜可以在指定地面生成两种角度的方块掩体，生成消耗技能点数及弦能条。方块最多同时存在16个。"
            }
        },
        ["被动技能"] = {
            {
                ["Name"] = "劳逸结合",
                ["Intro"] = "蕾欧娜在弦化状态会持续恢复弦能，当弦能高于50%时，提高自身移动速度；低于50%时，逐渐恢复自身护甲。"
            }
        },
        ["终极技能"] = {
            {
                ["Name"] = "纯净坚城",
                ["Intro"] = "蕾欧娜充满弦能条，场上已存在方块和技能持续期间生成的方块永久变透明，透明方块将不再阻挡通路与友方子弹。"
            }
        },
        ["战术技能"] = {
            {
                ["Name"] = "防弹护窗",
                ["Intro"] = "蕾欧娜在已放置的方块表面横或纵向生成仅阻挡敌方子弹的防弹玻璃，生成消耗技能点数及弦能条。防弹玻璃最多同时存在3个。"
            }
        },
        ["技能觉醒"] = {
            {
                ["Name"] = "悬壁吊支",
                ["Intro"] = "蕾欧娜现在可以将墙壁和天花板作为支撑来释放方块。"
            },
            {
                ["Name"] = "连结固垒",
                ["Intro"] = "当多个方块相连时，视为一个整体，共享生命值。"
            },
            {
                ["Name"] = "撼落重砣",
                ["Intro"] = "蕾欧娜可以切换方块释放方式，消耗技能点数及弦能条，在指定区域召唤方块下落并短暂击飞域内的敌人。"
            }
        }
    },
    ["忧雾"] = {
        ["主动技能"] = {
            {
                ["Name"] = "蚀甲毒雾",
                ["Intro"] = "忧雾布置一个蜗牛装置，激活后可产生球形毒雾，临时腐蚀附近敌方角色的护甲上限。蜗牛装置最多同时存在3个。"
            }
        },
        ["被动技能"] = {
            {
                ["Name"] = "毒雾爆发",
                ["Intro"] = "忧雾使用主武器对敌方角色的生命值造成一定量伤害后，会引爆敌人体内的腐蚀性毒素，临时腐蚀附近敌方角色的护甲上限。"
            }
        },
        ["终极技能"] = {
            {
                ["Name"] = "凌毒侵蚀",
                ["Intro"] = "忧雾召唤大范围的毒雾向前方缓慢推进，临时腐蚀范围内敌方角色的护甲上限。"
            }
        },
        ["战术技能"] = {
            {
                ["Name"] = "腐蚀溶液",
                ["Intro"] = "忧雾向目标区域投掷毒液装置，毒液装置落地时会爆开并制造一片腐蚀区域，对区域内的敌人造成伤害与减速效果。"
            }
        },
        ["技能觉醒"] = {
            {
                ["Name"] = "毒雾污染",
                ["Intro"] = "当敌方角色体内的腐蚀性毒素被引爆后，还会在原地形成残留一段时间的腐蚀性毒雾。"
            },
            {
                ["Name"] = "腐毒蔓延",
                ["Intro"] = "主动技能开启后，形成的毒雾半径会在一定时间内逐渐扩大。"
            },
            {
                ["Name"] = "重雾毒烟",
                ["Intro"] = "主动技能由半透的毒雾变为不透明，能够遮蔽视野。"
            }
        }
    },
    ["玛拉"] = {
        ["主动技能"] = {
            {
                ["Name"] = "直击灵魂",
                ["Intro"] = "向前施放鬼手，命中最近一名非倒地的敌方角色，使其灵魂出窍。仅玛拉可通过武器攻击此灵魂球，对灵魂球造成伤害时，基于此一定比例给予敌人忽视护甲的血量伤害。敌人侧身或者飘飞时附着的灵魂球会缩小。"
            }
        },
        ["被动技能"] = {
            {
                ["Name"] = "摄魂侵魄",
                ["Intro"] = "玛拉使用武器对非满血敌方角色造成伤害时，会造成额外的忽视护甲的血量伤害。终极技能期间：使用武器对非满血敌方角色造成伤害时，会基于此伤害的一定比例恢复血量，此效果也会适用于主动技能的灵魂球传导伤害。"
            }
        },
        ["终极技能"] = {
            {
                ["Name"] = "死神来了",
                ["Intro"] = "选择离自己最近的一名敌方角色施加死亡印记：该敌人会被沉默，及仅玛拉可视的暴露状态。在此期间当玛拉参与击倒或击杀此角色，此印记会传导给一定范围内离玛拉最近的非倒地敌人，并重新计时。此效果会持续到玛拉死亡或者时间结束。"
            }
        },
        ["战术技能"] = {
            {
                ["Name"] = "亡灵漫步",
                ["Intro"] = "开启后，玛拉弦化时会进入特殊隐身状态，当敌人逐渐靠近时玛拉才会显形；且弦化移速增加；在终极技能触发时，显形的最远距离会进一步缩小。"
            }
        },
        ["技能觉醒"] = {
            {
                ["Name"] = "摄魂储魄",
                ["Intro"] = "玛拉参与击杀或因灵魂球附着的敌方角色倒地或者死亡时，均可获得一层魂魄；魂魄层数会保存一整局游戏，直到换边或结束；每层魂魄会提升一定百分比的主武器射速和人机工效；玛拉死亡损失部分魂魄层数。"
            },
            {
                ["Name"] = "扼魂锁魄",
                ["Intro"] = "主动技能生成的灵魂球将会留在原地；敌人若处于灵魂球一定范围内会被眩晕；敌人可以逃脱，逃脱后灵魂球摧毁，但其会被减速持续一段时间。"
            },
            {
                ["Name"] = "传魂溢灵",
                ["Intro"] = "当灵魂球因目标死亡或倒地而摧毁时，对范围内离玛拉最近的一个没有灵魂出窍的非倒地敌人进行传导，使其也出现灵魂出窍状态。"
            }
        }
    },
    ["301"] = {
        ["主动技能"] = {
            {
                ["Name"] = "暴走",
                ["Intro"] = "开启后的一段时间内，移动速度加快，免疫减速效果。"
            }
        },
        ["被动技能"] = {
        },
        ["终极技能"] = {
        },
        ["战术技能"] = {
        },
        ["技能觉醒"] = {
        }
    },
    ["302"] = {
        ["主动技能"] = {
            {
                ["Name"] = "炼狱晶爆",
                ["Intro"] = "向准心方向快速释放一个远程飞行物，碰撞到人或障碍物后形成范围爆炸。点按技能按键开始蓄力，爆炸范围和伤害随蓄力时间增加。"
            }
        },
        ["被动技能"] = {
        },
        ["终极技能"] = {
            {
                ["Name"] = "减伤护盾",
                ["Intro"] = "开启后的一段时间内，可以抵挡伤害，免疫减速效果，但不免疫击退效果。"
            }
        },
        ["战术技能"] = {
        },
        ["技能觉醒"] = {
        }
    },
    ["304"] = {
        ["主动技能"] = {
        },
        ["被动技能"] = {
        },
        ["终极技能"] = {
        },
        ["战术技能"] = {
        },
        ["技能觉醒"] = {
        }
    },
    ["305"] = {
        ["主动技能"] = {
            {
                ["Name"] = "炼狱晶爆",
                ["Intro"] = "向准心方向快速释放一个远程飞行物，碰撞到人或障碍物后形成范围爆炸。点按技能按键开始蓄力，爆炸范围和伤害随蓄力时间增加，按下左键丢出。"
            }
        },
        ["被动技能"] = {
        },
        ["终极技能"] = {
        },
        ["战术技能"] = {
        },
        ["技能觉醒"] = {
        }
    }
}