return {
    ["米雪儿·李"] = {
        ["Parts1"] = {
            ["Name"] = "核心",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "基础射速提升",
                "基础射速提升",
                "基础射速提升",
                "基础射速提升"
            }
        },
        ["Parts2"] = {
            ["Name"] = "暴击",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                110,
                110,
                110,
                110
            },
            ["Desc"] = {
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升"
            }
        },
        ["Parts4"] = {
            ["Name"] = "续航",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升"
            }
        },
        ["Parts5"] = {
            ["Name"] = "机能",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "散射控制提升",
                "散射控制提升",
                "散射控制提升",
                "散射控制提升",
                "后坐控制提升",
                "后坐控制提升",
                "后坐控制提升",
                "后坐控制提升"
            }
        },
        ["Q"] = {
            ["Name"] = "喵喵卫士",
            ["UpgradeNumMax"] = 7,
            ["Max"] = {
                4,
                4,
                2,
                1
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                115,
                115,
                115,
                115,
                100,
                100,
                200
            },
            ["Desc"] = {
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "技能伤害提升",
                "技能伤害提升",
                "技能伤害提升",
                "技能伤害提升",
                "射程增加",
                "射程增加",
                "上限增加至3个"
            }
        },
        ["Passive"] = {
            ["Name"] = "猫踪喵迹",
            ["UpgradeNumMax"] = 3,
            ["Max"] = {
                3
            },
            ["Need"] = {
                100,
                100,
                100
            },
            ["Desc"] = {
                "敌方暴露时间延长",
                "敌方暴露时间延长",
                "敌方暴露时间延长"
            }
        },
        ["X"] = {
            ["Name"] = "火力大喵",
            ["UpgradeNumMax"] = 5,
            ["Max"] = {
                3,
                2,
                2
            },
            ["Need"] = {
                100,
                120,
                140,
                110,
                110,
                110,
                110
            },
            ["Desc"] = {
                "点数需求减少1点",
                "点数需求减少2点",
                "点数需求减少3点",
                "火力大喵生命值提升",
                "火力大喵生命值提升",
                "火力大喵伤害提升",
                "火力大喵伤害提升"
            }
        },
        ["E"] = {
            ["Name"] = "破法喵喵",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "沉默持续时间延长",
                "沉默持续时间延长",
                "沉默持续时间延长",
                "沉默持续时间延长"
            }
        },
        ["Shield"] = {
            ["Name"] = "护甲",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升"
            }
        },
        ["Survive"] = {
            ["Name"] = "生存",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加"
            }
        },
        ["Health"] = {
            ["Name"] = "生命值",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升"
            }
        },
        ["Injured"] = {
            ["Name"] = "倒地状态",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                80,
                80,
                80,
                80,
                80,
                80,
                80,
                80
            },
            ["Desc"] = {
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升"
            }
        },
        ["Arousal"] = {
            ["Active1Need"] = {
                ["蓝"] = 1,
                ["黄"] = 2,
                ["绿"] = 1
            },
            ["Active2Need"] = {
                ["蓝"] = 2,
                ["黄"] = 7,
                ["绿"] = 5
            },
            ["Active3Need"] = {
                ["蓝"] = 7,
                ["黄"] = 5,
                ["绿"] = 2
            }
        },
        ["Weapon"] = {
            ["TacticalItem"] = {
                ["破片手雷"] = 80,
                ["烟雾弹"] = 55,
                ["风场雷"] = 45,
                ["减速雷"] = 65,
                ["治疗雷"] = 45,
                ["警报器"] = 30,
                ["拦截者"] = 55
            }
        }
    },
    ["明"] = {
        ["Parts1"] = {
            ["Name"] = "核心",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "基础射速提升",
                "基础射速提升",
                "基础射速提升",
                "基础射速提升"
            }
        },
        ["Parts2"] = {
            ["Name"] = "暴击",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                110,
                110,
                110,
                110
            },
            ["Desc"] = {
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升"
            }
        },
        ["Parts4"] = {
            ["Name"] = "续航",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升"
            }
        },
        ["Parts5"] = {
            ["Name"] = "机能",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "散射控制提升",
                "散射控制提升",
                "散射控制提升",
                "散射控制提升",
                "后坐控制提升",
                "后坐控制提升",
                "后坐控制提升",
                "后坐控制提升"
            }
        },
        ["Q"] = {
            ["Name"] = "破甲电球",
            ["UpgradeNumMax"] = 7,
            ["Max"] = {
                4,
                4,
                3
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                110,
                110,
                110,
                110,
                80,
                80,
                80
            },
            ["Desc"] = {
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "技能伤害提升",
                "技能伤害提升",
                "技能伤害提升",
                "技能伤害提升",
                "持续时间延长",
                "持续时间延长",
                "持续时间延长"
            }
        },
        ["Passive"] = {
            ["Name"] = "吸能赋甲",
            ["UpgradeNumMax"] = 3,
            ["Max"] = {
                3
            },
            ["Need"] = {
                100,
                100,
                100
            },
            ["Desc"] = {
                "护甲吸取量提升",
                "护甲吸取量提升",
                "护甲吸取量提升"
            }
        },
        ["X"] = {
            ["Name"] = "强雷铸甲",
            ["UpgradeNumMax"] = 5,
            ["Max"] = {
                3,
                1,
                2,
                1
            },
            ["Need"] = {
                100,
                120,
                140,
                100,
                110,
                110,
                110
            },
            ["Desc"] = {
                "点数需求减少1点",
                "点数需求减少2点",
                "点数需求减少3点",
                "临时护甲量提升",
                "立即恢复自身护甲",
                "立即恢复自身护甲",
                "减速子弹与吸甲效果提升"
            }
        },
        ["E"] = {
            ["Name"] = "爆闪电球",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "闪光电球生命值提升",
                "闪光电球生命值提升",
                "闪光电球生命值提升",
                "闪光电球生命值提升"
            }
        },
        ["Shield"] = {
            ["Name"] = "护甲",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升"
            }
        },
        ["Survive"] = {
            ["Name"] = "生存",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加"
            }
        },
        ["Health"] = {
            ["Name"] = "生命值",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升"
            }
        },
        ["Injured"] = {
            ["Name"] = "倒地状态",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                80,
                80,
                80,
                80,
                80,
                80,
                80,
                80
            },
            ["Desc"] = {
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升"
            }
        },
        ["Arousal"] = {
            ["Active1Need"] = {
                ["蓝"] = 2,
                ["黄"] = 0,
                ["绿"] = 2
            },
            ["Active2Need"] = {
                ["蓝"] = 7,
                ["黄"] = 5,
                ["绿"] = 2
            },
            ["Active3Need"] = {
                ["蓝"] = 7,
                ["黄"] = 2,
                ["绿"] = 5
            }
        },
        ["Weapon"] = {
            ["TacticalItem"] = {
                ["破片手雷"] = 80,
                ["烟雾弹"] = 80,
                ["风场雷"] = 65,
                ["减速雷"] = 65,
                ["治疗雷"] = 45,
                ["警报器"] = 45,
                ["拦截者"] = 80
            }
        }
    },
    ["星绘"] = {
        ["Parts1"] = {
            ["Name"] = "核心",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "基础射速提升",
                "基础射速提升",
                "基础射速提升",
                "基础射速提升"
            }
        },
        ["Parts2"] = {
            ["Name"] = "暴击",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                110,
                110,
                110,
                110
            },
            ["Desc"] = {
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升"
            }
        },
        ["Parts4"] = {
            ["Name"] = "续航",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升"
            }
        },
        ["Parts5"] = {
            ["Name"] = "机能",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "散射控制提升",
                "散射控制提升",
                "散射控制提升",
                "散射控制提升",
                "后坐控制提升",
                "后坐控制提升",
                "后坐控制提升",
                "后坐控制提升"
            }
        },
        ["Q"] = {
            ["Name"] = "守护星芒",
            ["UpgradeNumMax"] = 7,
            ["Max"] = {
                4,
                4,
                1
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                110,
                110,
                110,
                110,
                200
            },
            ["Desc"] = {
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "临时护甲量提升",
                "临时护甲量提升",
                "临时护甲量提升",
                "临时护甲量提升",
                "上限增加至3个"
            }
        },
        ["Passive"] = {
            ["Name"] = "星弦甲生",
            ["UpgradeNumMax"] = 4,
            ["Max"] = {
                3,
                3
            },
            ["Need"] = {
                115,
                115,
                115,
                110,
                110,
                110
            },
            ["Desc"] = {
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "效果范围扩大",
                "效果范围扩大",
                "效果范围扩大"
            }
        },
        ["X"] = {
            ["Name"] = "星空之门",
            ["UpgradeNumMax"] = 5,
            ["Max"] = {
                3,
                1,
                3
            },
            ["Need"] = {
                100,
                120,
                140,
                120,
                120,
                120,
                120
            },
            ["Desc"] = {
                "点数需求减少1点",
                "点数需求减少2点",
                "点数需求减少3点",
                "临时护甲量提升",
                "立即恢复队友与自身护甲",
                "立即恢复队友与自身护甲",
                "立即恢复队友与自身护甲"
            }
        },
        ["E"] = {
            ["Name"] = "塑甲星芒",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                3,
                3
            },
            ["Need"] = {
                90,
                90,
                90,
                90,
                90,
                90,
                90,
                90,
                90,
                90
            },
            ["Desc"] = {
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "持续时间延长",
                "持续时间延长",
                "持续时间延长"
            }
        },
        ["Shield"] = {
            ["Name"] = "护甲",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升"
            }
        },
        ["Survive"] = {
            ["Name"] = "生存",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加"
            }
        },
        ["Health"] = {
            ["Name"] = "生命值",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升"
            }
        },
        ["Injured"] = {
            ["Name"] = "倒地状态",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                80,
                80,
                80,
                80,
                80,
                80,
                80,
                80
            },
            ["Desc"] = {
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升"
            }
        },
        ["Arousal"] = {
            ["Active1Need"] = {
                ["蓝"] = 0,
                ["黄"] = 2,
                ["绿"] = 2
            },
            ["Active2Need"] = {
                ["蓝"] = 5,
                ["黄"] = 7,
                ["绿"] = 2
            },
            ["Active3Need"] = {
                ["蓝"] = 2,
                ["黄"] = 7,
                ["绿"] = 5
            }
        },
        ["Weapon"] = {
            ["TacticalItem"] = {
                ["破片手雷"] = 80,
                ["烟雾弹"] = 80,
                ["风场雷"] = 65,
                ["减速雷"] = 45,
                ["治疗雷"] = 30,
                ["警报器"] = 45,
                ["拦截者"] = 80
            }
        }
    },
    ["梅瑞狄斯"] = {
        ["Parts1"] = {
            ["Name"] = "核心",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "基础射速提升",
                "基础射速提升",
                "基础射速提升",
                "基础射速提升"
            }
        },
        ["Parts2"] = {
            ["Name"] = "暴击",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                110,
                110,
                110,
                110
            },
            ["Desc"] = {
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升"
            }
        },
        ["Parts4"] = {
            ["Name"] = "续航",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升"
            }
        },
        ["Parts5"] = {
            ["Name"] = "机能",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "散射控制提升",
                "散射控制提升",
                "散射控制提升",
                "散射控制提升",
                "后坐控制提升",
                "后坐控制提升",
                "后坐控制提升",
                "后坐控制提升"
            }
        },
        ["Q"] = {
            ["Name"] = "金沙热浪",
            ["UpgradeNumMax"] = 7,
            ["Max"] = {
                4,
                4,
                3,
                1
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                120,
                120,
                120,
                120,
                100,
                100,
                100,
                150
            },
            ["Desc"] = {
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "生命削减速率提升",
                "生命削减速率提升",
                "生命削减速率提升",
                "生命削减速率提升",
                "持续时间延长",
                "持续时间延长",
                "持续时间延长",
                "移速和人机工效降低"
            }
        },
        ["Passive"] = {
            ["Name"] = "时零沙环",
            ["UpgradeNumMax"] = 4,
            ["Max"] = {
                3,
                3
            },
            ["Need"] = {
                90,
                90,
                90,
                90,
                90,
                90
            },
            ["Desc"] = {
                "悬浮时重力减少",
                "悬浮时重力减少",
                "悬浮时重力减少",
                "悬浮状态枪械控制力提升",
                "悬浮状态枪械控制力提升",
                "悬浮状态枪械控制力提升"
            }
        },
        ["X"] = {
            ["Name"] = "流沙大葬",
            ["UpgradeNumMax"] = 5,
            ["Max"] = {
                3,
                2,
                2
            },
            ["Need"] = {
                100,
                120,
                140,
                110,
                110,
                110,
                110
            },
            ["Desc"] = {
                "点数需求减少1点",
                "点数需求减少2点",
                "点数需求减少3点",
                "持续时间延长",
                "持续时间延长",
                "生命削减速率提升",
                "生命削减速率提升"
            }
        },
        ["E"] = {
            ["Name"] = "盲眼迷沙",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "持续时间延长",
                "持续时间延长",
                "持续时间延长",
                "持续时间延长"
            }
        },
        ["Shield"] = {
            ["Name"] = "护甲",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升"
            }
        },
        ["Survive"] = {
            ["Name"] = "生存",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加"
            }
        },
        ["Health"] = {
            ["Name"] = "生命值",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升"
            }
        },
        ["Injured"] = {
            ["Name"] = "倒地状态",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                80,
                80,
                80,
                80,
                80,
                80,
                80,
                80
            },
            ["Desc"] = {
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升"
            }
        },
        ["Arousal"] = {
            ["Active1Need"] = {
                ["蓝"] = 1,
                ["黄"] = 2,
                ["绿"] = 1
            },
            ["Active2Need"] = {
                ["蓝"] = 2,
                ["黄"] = 7,
                ["绿"] = 5
            },
            ["Active3Need"] = {
                ["蓝"] = 7,
                ["黄"] = 5,
                ["绿"] = 2
            }
        },
        ["Weapon"] = {
            ["TacticalItem"] = {
                ["破片手雷"] = 80,
                ["烟雾弹"] = 55,
                ["风场雷"] = 45,
                ["减速雷"] = 65,
                ["治疗雷"] = 45,
                ["警报器"] = 30,
                ["拦截者"] = 55
            }
        }
    },
    ["绯莎"] = {
        ["Parts1"] = {
            ["Name"] = "核心",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "基础射速提升",
                "基础射速提升",
                "基础射速提升",
                "基础射速提升"
            }
        },
        ["Parts2"] = {
            ["Name"] = "暴击",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                110,
                110,
                110,
                110
            },
            ["Desc"] = {
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升"
            }
        },
        ["Parts4"] = {
            ["Name"] = "续航",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升"
            }
        },
        ["Parts5"] = {
            ["Name"] = "机能",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "散射控制提升",
                "散射控制提升",
                "散射控制提升",
                "散射控制提升",
                "后坐控制提升",
                "后坐控制提升",
                "后坐控制提升",
                "后坐控制提升"
            }
        },
        ["Q"] = {
            ["Name"] = "残息追踪",
            ["UpgradeNumMax"] = 7,
            ["Max"] = {
                4,
                3,
                1,
                1
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                90,
                90,
                90,
                115,
                100
            },
            ["Desc"] = {
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "持续时间延长",
                "持续时间延长",
                "持续时间延长",
                "敌方暴露时间延长",
                "加速效果提升"
            }
        },
        ["Passive"] = {
            ["Name"] = "以战养战",
            ["UpgradeNumMax"] = 4,
            ["Max"] = {
                3,
                3
            },
            ["Need"] = {
                90,
                90,
                90,
                100,
                100,
                100
            },
            ["Desc"] = {
                "恢复速率提升",
                "恢复速率提升",
                "恢复速率提升",
                "恢复总量提升",
                "恢复总量提升",
                "恢复总量提升"
            }
        },
        ["X"] = {
            ["Name"] = "浴血狂戮",
            ["UpgradeNumMax"] = 5,
            ["Max"] = {
                3,
                2,
                1,
                1
            },
            ["Need"] = {
                100,
                120,
                140,
                110,
                110,
                100,
                100
            },
            ["Desc"] = {
                "点数需求减少1点",
                "点数需求减少2点",
                "点数需求减少3点",
                "射速和人机工效提升",
                "射速和人机工效提升",
                "基础持续时间延长",
                "吸取晶体延长的时间增加"
            }
        },
        ["E"] = {
            ["Name"] = "猩红猛冲",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                90,
                90,
                90,
                90,
                85,
                85,
                85,
                85
            },
            ["Desc"] = {
                "持续时间延长",
                "持续时间延长",
                "持续时间延长",
                "持续时间延长",
                "减少生命值消耗",
                "减少生命值消耗",
                "减少生命值消耗",
                "减少生命值消耗"
            }
        },
        ["Shield"] = {
            ["Name"] = "护甲",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升"
            }
        },
        ["Survive"] = {
            ["Name"] = "生存",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加"
            }
        },
        ["Health"] = {
            ["Name"] = "生命值",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升"
            }
        },
        ["Injured"] = {
            ["Name"] = "倒地状态",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                80,
                80,
                80,
                80,
                80,
                80,
                80,
                80
            },
            ["Desc"] = {
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升"
            }
        },
        ["Arousal"] = {
            ["Active1Need"] = {
                ["蓝"] = 2,
                ["黄"] = 0,
                ["绿"] = 2
            },
            ["Active2Need"] = {
                ["蓝"] = 7,
                ["黄"] = 2,
                ["绿"] = 5
            },
            ["Active3Need"] = {
                ["蓝"] = 7,
                ["黄"] = 5,
                ["绿"] = 2
            }
        },
        ["Weapon"] = {
            ["TacticalItem"] = {
                ["破片手雷"] = 80,
                ["烟雾弹"] = 80,
                ["风场雷"] = 65,
                ["减速雷"] = 65,
                ["治疗雷"] = 45,
                ["警报器"] = 45,
                ["拦截者"] = 80
            }
        }
    },
    ["拉薇"] = {
        ["Parts1"] = {
            ["Name"] = "核心",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "基础射速提升",
                "基础射速提升",
                "基础射速提升",
                "基础射速提升"
            }
        },
        ["Parts2"] = {
            ["Name"] = "暴击",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                110,
                110,
                110,
                110
            },
            ["Desc"] = {
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升"
            }
        },
        ["Parts4"] = {
            ["Name"] = "续航",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升"
            }
        },
        ["Parts5"] = {
            ["Name"] = "机能",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "散射控制提升",
                "散射控制提升",
                "散射控制提升",
                "散射控制提升",
                "后坐控制提升",
                "后坐控制提升",
                "后坐控制提升",
                "后坐控制提升"
            }
        },
        ["Q"] = {
            ["Name"] = "寻影猎刃",
            ["UpgradeNumMax"] = 7,
            ["Max"] = {
                4,
                4,
                1
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                90,
                90,
                90,
                90,
                150
            },
            ["Desc"] = {
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "敌方暴露时间延长",
                "敌方暴露时间延长",
                "敌方暴露时间延长",
                "敌方暴露时间延长",
                "扫描次数增加"
            }
        },
        ["Passive"] = {
            ["Name"] = "曝影显踪",
            ["UpgradeNumMax"] = 3,
            ["Max"] = {
                3
            },
            ["Need"] = {
                100,
                100,
                100
            },
            ["Desc"] = {
                "敌方暴露时间延长",
                "敌方暴露时间延长",
                "敌方暴露时间延长"
            }
        },
        ["X"] = {
            ["Name"] = "遁影藏踪",
            ["UpgradeNumMax"] = 5,
            ["Max"] = {
                3,
                1,
                1,
                2
            },
            ["Need"] = {
                100,
                120,
                140,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "点数需求减少1点",
                "点数需求减少2点",
                "点数需求减少3点",
                "持续时间延长",
                "加速效果提升",
                "隐身时恢复护甲",
                "隐身时恢复护甲"
            }
        },
        ["E"] = {
            ["Name"] = "闪影猎刃",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "闪光生效延迟缩短",
                "闪光生效延迟缩短",
                "闪光生效延迟缩短",
                "闪光生效延迟缩短"
            }
        },
        ["Shield"] = {
            ["Name"] = "护甲",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升"
            }
        },
        ["Survive"] = {
            ["Name"] = "生存",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加"
            }
        },
        ["Health"] = {
            ["Name"] = "生命值",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升"
            }
        },
        ["Injured"] = {
            ["Name"] = "倒地状态",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                80,
                80,
                80,
                80,
                80,
                80,
                80,
                80
            },
            ["Desc"] = {
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升"
            }
        },
        ["Arousal"] = {
            ["Active1Need"] = {
                ["蓝"] = 2,
                ["黄"] = 2,
                ["绿"] = 0
            },
            ["Active2Need"] = {
                ["蓝"] = 7,
                ["黄"] = 5,
                ["绿"] = 2
            },
            ["Active3Need"] = {
                ["蓝"] = 5,
                ["黄"] = 7,
                ["绿"] = 2
            }
        },
        ["Weapon"] = {
            ["TacticalItem"] = {
                ["破片手雷"] = 55,
                ["烟雾弹"] = 80,
                ["风场雷"] = 65,
                ["减速雷"] = 65,
                ["治疗雷"] = 45,
                ["警报器"] = 45,
                ["拦截者"] = 80
            }
        }
    },
    ["信"] = {
        ["Parts1"] = {
            ["Name"] = "核心",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "全自动射击模式",
                "基础射速提升",
                "基础射速提升",
                "基础射速提升"
            }
        },
        ["Parts2"] = {
            ["Name"] = "暴击",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                110,
                110,
                110,
                110
            },
            ["Desc"] = {
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升"
            }
        },
        ["Parts4"] = {
            ["Name"] = "续航",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升"
            }
        },
        ["Parts5"] = {
            ["Name"] = "机能",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "散射控制提升",
                "散射控制提升",
                "散射控制提升",
                "散射控制提升",
                "后坐控制提升",
                "后坐控制提升",
                "后坐控制提升",
                "后坐控制提升"
            }
        },
        ["Q"] = {
            ["Name"] = "守望之眼",
            ["UpgradeNumMax"] = 7,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                110,
                110,
                110,
                110
            },
            ["Desc"] = {
                "射速和人机工效提升",
                "射速和人机工效提升",
                "射速和人机工效提升",
                "射速和人机工效提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升"
            }
        },
        ["Passive"] = {
            ["Name"] = "致盲脉冲",
            ["UpgradeNumMax"] = 4,
            ["Max"] = {
                3,
                3
            },
            ["Need"] = {
                80,
                80,
                80,
                90,
                90,
                90
            },
            ["Desc"] = {
                "充能速率提升",
                "充能速率提升",
                "充能速率提升",
                "弱化时间延长",
                "弱化时间延长",
                "弱化时间延长"
            }
        },
        ["X"] = {
            ["Name"] = "脉冲过载",
            ["UpgradeNumMax"] = 5,
            ["Max"] = {
                3,
                1,
                1,
                2
            },
            ["Need"] = {
                100,
                120,
                140,
                110,
                110,
                130,
                130
            },
            ["Desc"] = {
                "点数需求减少1点",
                "点数需求减少2点",
                "点数需求减少3点",
                "敌方暴露时间延长",
                "沉默时间延迟",
                "扫描次数增加",
                "扫描次数增加"
            }
        },
        ["E"] = {
            ["Name"] = "脉冲地雷",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                125,
                125,
                125,
                125
            },
            ["Desc"] = {
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "技能伤害提升",
                "技能伤害提升",
                "技能伤害提升",
                "技能伤害提升"
            }
        },
        ["Shield"] = {
            ["Name"] = "护甲",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升"
            }
        },
        ["Survive"] = {
            ["Name"] = "生存",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加"
            }
        },
        ["Health"] = {
            ["Name"] = "生命值",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升"
            }
        },
        ["Injured"] = {
            ["Name"] = "倒地状态",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                80,
                80,
                80,
                80,
                80,
                80,
                80,
                80
            },
            ["Desc"] = {
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升"
            }
        },
        ["Arousal"] = {
            ["Active1Need"] = {
                ["蓝"] = 1,
                ["黄"] = 2,
                ["绿"] = 1
            },
            ["Active2Need"] = {
                ["蓝"] = 2,
                ["黄"] = 7,
                ["绿"] = 5
            },
            ["Active3Need"] = {
                ["蓝"] = 7,
                ["黄"] = 5,
                ["绿"] = 2
            }
        },
        ["Weapon"] = {
            ["TacticalItem"] = {
                ["破片手雷"] = 80,
                ["烟雾弹"] = 55,
                ["风场雷"] = 45,
                ["减速雷"] = 65,
                ["治疗雷"] = 45,
                ["警报器"] = 30,
                ["拦截者"] = 55
            }
        }
    },
    ["玛德蕾娜·利里"] = {
        ["Parts1"] = {
            ["Name"] = "核心",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "基础射速提升",
                "基础射速提升",
                "基础射速提升",
                "基础射速提升"
            }
        },
        ["Parts2"] = {
            ["Name"] = "暴击",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                110,
                110,
                110,
                110
            },
            ["Desc"] = {
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升"
            }
        },
        ["Parts4"] = {
            ["Name"] = "续航",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升"
            }
        },
        ["Parts5"] = {
            ["Name"] = "机能",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                90,
                90,
                90,
                90,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "操控速度提升",
                "操控速度提升",
                "操控速度提升",
                "操控速度提升",
                "后坐控制提升",
                "后坐控制提升",
                "后坐控制提升",
                "后坐控制提升"
            }
        },
        ["Q"] = {
            ["Name"] = "颜料束缚",
            ["UpgradeNumMax"] = 7,
            ["Max"] = {
                4,
                3,
                1,
                1
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                100,
                100,
                100,
                150,
                180
            },
            ["Desc"] = {
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "持续时间延长",
                "持续时间延长",
                "持续时间延长",
                "减速效果提升",
                "上限增加至3个"
            }
        },
        ["Passive"] = {
            ["Name"] = "颜料脚印",
            ["UpgradeNumMax"] = 4,
            ["Max"] = {
                3,
                3
            },
            ["Need"] = {
                80,
                80,
                80,
                80,
                80,
                80
            },
            ["Desc"] = {
                "减速时间延长",
                "减速时间延长",
                "减速时间延长",
                "减速效果提升",
                "减速效果提升",
                "减速效果提升"
            }
        },
        ["X"] = {
            ["Name"] = "颜料泡泡",
            ["UpgradeNumMax"] = 5,
            ["Max"] = {
                3,
                2,
                2
            },
            ["Need"] = {
                100,
                120,
                140,
                110,
                110,
                110,
                110
            },
            ["Desc"] = {
                "点数需求减少1点",
                "点数需求减少2点",
                "点数需求减少3点",
                "泡泡持续时间延长",
                "泡泡持续时间延长",
                "爆炸后减益效果延长",
                "爆炸后减益效果延长"
            }
        },
        ["E"] = {
            ["Name"] = "颜料泡涌",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                3,
                1
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                130
            },
            ["Desc"] = {
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "持续时间延长",
                "持续时间延长",
                "持续时间延长",
                "减速效果提升"
            }
        },
        ["Shield"] = {
            ["Name"] = "护甲",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升"
            }
        },
        ["Survive"] = {
            ["Name"] = "生存",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加"
            }
        },
        ["Health"] = {
            ["Name"] = "生命值",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升"
            }
        },
        ["Injured"] = {
            ["Name"] = "倒地状态",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                80,
                80,
                80,
                80,
                80,
                80,
                80,
                80
            },
            ["Desc"] = {
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升"
            }
        },
        ["Arousal"] = {
            ["Active1Need"] = {
                ["蓝"] = 1,
                ["黄"] = 2,
                ["绿"] = 1
            },
            ["Active2Need"] = {
                ["蓝"] = 2,
                ["黄"] = 7,
                ["绿"] = 5
            },
            ["Active3Need"] = {
                ["蓝"] = 7,
                ["黄"] = 5,
                ["绿"] = 2
            }
        },
        ["Weapon"] = {
            ["TacticalItem"] = {
                ["破片手雷"] = 80,
                ["烟雾弹"] = 55,
                ["风场雷"] = 45,
                ["减速雷"] = 65,
                ["治疗雷"] = 45,
                ["警报器"] = 30,
                ["拦截者"] = 55
            }
        }
    },
    ["奥黛丽·格罗夫"] = {
        ["Parts1"] = {
            ["Name"] = "核心",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "基础射速提升",
                "基础射速提升",
                "基础射速提升",
                "基础射速提升"
            }
        },
        ["Parts2"] = {
            ["Name"] = "暴击",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                110,
                110,
                110,
                110
            },
            ["Desc"] = {
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升"
            }
        },
        ["Parts4"] = {
            ["Name"] = "续航",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                90,
                90,
                90,
                90,
                90,
                90,
                90,
                90
            },
            ["Desc"] = {
                "备弹数量提升",
                "备弹数量提升",
                "备弹数量提升",
                "备弹数量提升",
                "操控速度提升",
                "操控速度提升",
                "操控速度提升",
                "操控速度提升"
            }
        },
        ["Parts5"] = {
            ["Name"] = "机能",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "散射控制提升",
                "散射控制提升",
                "散射控制提升",
                "散射控制提升",
                "后坐控制提升",
                "后坐控制提升",
                "后坐控制提升",
                "后坐控制提升"
            }
        },
        ["Q"] = {
            ["Name"] = "重火倾泄",
            ["UpgradeNumMax"] = 7,
            ["Max"] = {
                4,
                3,
                2
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                90,
                90,
                90,
                100,
                100
            },
            ["Desc"] = {
                "护盾最大值提升",
                "护盾最大值提升",
                "护盾最大值提升",
                "护盾最大值提升",
                "护盾恢复速度提升",
                "护盾恢复速度提升",
                "护盾恢复速度提升",
                "机枪过热速度变慢",
                "机枪过热速度变慢"
            }
        },
        ["Passive"] = {
            ["Name"] = "皇家盾牌",
            ["UpgradeNumMax"] = 4,
            ["Max"] = {
                3,
                3
            },
            ["Need"] = {
                100,
                100,
                100,
                90,
                90,
                90
            },
            ["Desc"] = {
                "护盾最大值提升",
                "护盾最大值提升",
                "护盾最大值提升",
                "护盾恢复间隔缩短",
                "护盾恢复间隔缩短",
                "护盾恢复间隔缩短"
            }
        },
        ["X"] = {
            ["Name"] = "狂轰滥炸",
            ["UpgradeNumMax"] = 5,
            ["Max"] = {
                3,
                4
            },
            ["Need"] = {
                100,
                120,
                140,
                110,
                110,
                110,
                110
            },
            ["Desc"] = {
                "点数需求减少1点",
                "点数需求减少2点",
                "点数需求减少3点",
                "灼烧伤害提升",
                "灼烧伤害提升",
                "灼烧伤害提升",
                "灼烧伤害提升"
            }
        },
        ["E"] = {
            ["Name"] = "警报雷达",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                3,
                2
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "雷达存在时间延长",
                "雷达存在时间延长",
                "雷达存在时间延长",
                "敌方暴露时间延长",
                "敌方暴露时间延长"
            }
        },
        ["Shield"] = {
            ["Name"] = "护甲",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升"
            }
        },
        ["Survive"] = {
            ["Name"] = "生存",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加"
            }
        },
        ["Health"] = {
            ["Name"] = "生命值",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升"
            }
        },
        ["Injured"] = {
            ["Name"] = "倒地状态",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                80,
                80,
                80,
                80,
                80,
                80,
                80,
                80
            },
            ["Desc"] = {
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升"
            }
        },
        ["Arousal"] = {
            ["Active1Need"] = {
                ["蓝"] = 1,
                ["黄"] = 2,
                ["绿"] = 1
            },
            ["Active2Need"] = {
                ["蓝"] = 2,
                ["黄"] = 7,
                ["绿"] = 5
            },
            ["Active3Need"] = {
                ["蓝"] = 4,
                ["黄"] = 4,
                ["绿"] = 2
            }
        },
        ["Weapon"] = {
            ["TacticalItem"] = {
                ["破片手雷"] = 80,
                ["烟雾弹"] = 55,
                ["风场雷"] = 45,
                ["减速雷"] = 65,
                ["治疗雷"] = 45,
                ["警报器"] = 30,
                ["拦截者"] = 55
            }
        }
    },
    ["心夏"] = {
        ["Parts1"] = {
            ["Name"] = "核心",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "开镜速度提升",
                "开镜速度提升",
                "开镜速度提升",
                "开镜速度提升"
            }
        },
        ["Parts2"] = {
            ["Name"] = "暴击",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                110,
                110,
                110,
                110
            },
            ["Desc"] = {
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升"
            }
        },
        ["Parts4"] = {
            ["Name"] = "续航",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升"
            }
        },
        ["Parts5"] = {
            ["Name"] = "机能",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "拉栓速度提升",
                "拉栓速度提升",
                "拉栓速度提升",
                "拉栓速度提升",
                "蓄力速度提升",
                "蓄力速度提升",
                "蓄力速度提升",
                "蓄力速度提升"
            }
        },
        ["Q"] = {
            ["Name"] = "治疗无人机",
            ["UpgradeNumMax"] = 7,
            ["Max"] = {
                4,
                3,
                3
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升"
            }
        },
        ["Passive"] = {
            ["Name"] = "急速救援",
            ["UpgradeNumMax"] = 4,
            ["Max"] = {
                3,
                3
            },
            ["Need"] = {
                90,
                90,
                90,
                95,
                95,
                95
            },
            ["Desc"] = {
                "提升救起生命值",
                "提升救起生命值",
                "提升救起生命值",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升"
            }
        },
        ["X"] = {
            ["Name"] = "卡丘重塑",
            ["UpgradeNumMax"] = 5,
            ["Max"] = {
                3,
                2,
                2
            },
            ["Need"] = {
                100,
                120,
                140,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "点数需求减少1点",
                "点数需求减少2点",
                "点数需求减少3点",
                "队友复活后获得临时护甲",
                "队友复活后获得临时护甲",
                "队友复活后获得绝招点数",
                "队友复活后获得绝招点数"
            }
        },
        ["E"] = {
            ["Name"] = "医疗站点",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                3,
                3
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "持续时间延长",
                "持续时间延长",
                "持续时间延长"
            }
        },
        ["Shield"] = {
            ["Name"] = "护甲",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升"
            }
        },
        ["Survive"] = {
            ["Name"] = "生存",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加"
            }
        },
        ["Health"] = {
            ["Name"] = "生命值",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升"
            }
        },
        ["Injured"] = {
            ["Name"] = "倒地状态",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                80,
                80,
                80,
                80,
                80,
                80,
                80,
                80
            },
            ["Desc"] = {
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升"
            }
        },
        ["Arousal"] = {
            ["Active1Need"] = {
                ["蓝"] = 0,
                ["黄"] = 2,
                ["绿"] = 2
            },
            ["Active2Need"] = {
                ["蓝"] = 2,
                ["黄"] = 7,
                ["绿"] = 5
            },
            ["Active3Need"] = {
                ["蓝"] = 5,
                ["黄"] = 7,
                ["绿"] = 2
            }
        },
        ["Weapon"] = {
            ["TacticalItem"] = {
                ["破片手雷"] = 80,
                ["烟雾弹"] = 80,
                ["风场雷"] = 65,
                ["减速雷"] = 45,
                ["治疗雷"] = 30,
                ["警报器"] = 45,
                ["拦截者"] = 80
            }
        }
    },
    ["白墨"] = {
        ["Parts1"] = {
            ["Name"] = "核心",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "弹丸数提升",
                "弹丸数提升",
                "弹丸数提升",
                "弹丸数提升",
                "基础射速提升",
                "基础射速提升",
                "基础射速提升",
                "基础射速提升"
            }
        },
        ["Parts2"] = {
            ["Name"] = "暴击",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                110,
                110,
                110,
                110
            },
            ["Desc"] = {
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升"
            }
        },
        ["Parts4"] = {
            ["Name"] = "续航",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升"
            }
        },
        ["Parts5"] = {
            ["Name"] = "机能",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                85,
                85,
                85,
                85
            },
            ["Desc"] = {
                "散射控制提升",
                "散射控制提升",
                "散射控制提升",
                "散射控制提升",
                "操控速度提升",
                "操控速度提升",
                "操控速度提升",
                "操控速度提升"
            }
        },
        ["Q"] = {
            ["Name"] = "炫空斗舞",
            ["UpgradeNumMax"] = 7,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "自动上弹数提升",
                "自动上弹数提升",
                "自动上弹数提升",
                "自动上弹数提升"
            }
        },
        ["Passive"] = {
            ["Name"] = "嘻哈嘣彩",
            ["UpgradeNumMax"] = 3,
            ["Max"] = {
                3
            },
            ["Need"] = {
                100,
                100,
                100
            },
            ["Desc"] = {
                "持续时间延长",
                "持续时间延长",
                "持续时间延长"
            }
        },
        ["X"] = {
            ["Name"] = "重返街头！",
            ["UpgradeNumMax"] = 5,
            ["Max"] = {
                3,
                1,
                2,
                1
            },
            ["Need"] = {
                100,
                120,
                140,
                110,
                110,
                110,
                120
            },
            ["Desc"] = {
                "点数需求减少1点",
                "点数需求减少2点",
                "点数需求减少3点",
                "技能持续期间获得加速效果",
                "返回信标时恢复护甲",
                "返回信标时恢复护甲",
                "开启时获得临时护甲"
            }
        },
        ["E"] = {
            ["Name"] = "爆炸涂鸦",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "持续时间延长",
                "持续时间延长",
                "持续时间延长",
                "持续时间延长"
            }
        },
        ["Shield"] = {
            ["Name"] = "护甲",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升"
            }
        },
        ["Survive"] = {
            ["Name"] = "生存",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加"
            }
        },
        ["Health"] = {
            ["Name"] = "生命值",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升"
            }
        },
        ["Injured"] = {
            ["Name"] = "倒地状态",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                80,
                80,
                80,
                80,
                80,
                80,
                80,
                80
            },
            ["Desc"] = {
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升"
            }
        },
        ["Arousal"] = {
            ["Active1Need"] = {
                ["蓝"] = 2,
                ["黄"] = 0,
                ["绿"] = 2
            },
            ["Active2Need"] = {
                ["蓝"] = 7,
                ["黄"] = 2,
                ["绿"] = 5
            },
            ["Active3Need"] = {
                ["蓝"] = 7,
                ["黄"] = 5,
                ["绿"] = 2
            }
        },
        ["Weapon"] = {
            ["TacticalItem"] = {
                ["破片手雷"] = 80,
                ["烟雾弹"] = 80,
                ["风场雷"] = 65,
                ["减速雷"] = 65,
                ["治疗雷"] = 45,
                ["警报器"] = 45,
                ["拦截者"] = 80
            }
        }
    },
    ["令"] = {
        ["Parts1"] = {
            ["Name"] = "核心",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "基础射速提升",
                "基础射速提升",
                "基础射速提升",
                "基础射速提升"
            }
        },
        ["Parts2"] = {
            ["Name"] = "暴击",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                110,
                110,
                110,
                110
            },
            ["Desc"] = {
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升"
            }
        },
        ["Parts4"] = {
            ["Name"] = "续航",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升"
            }
        },
        ["Parts5"] = {
            ["Name"] = "机能",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                90,
                90,
                90,
                90,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "操控速度提升",
                "操控速度提升",
                "操控速度提升",
                "操控速度提升",
                "后坐控制提升",
                "后坐控制提升",
                "后坐控制提升",
                "后坐控制提升"
            }
        },
        ["Q"] = {
            ["Name"] = "破晓帷幕",
            ["UpgradeNumMax"] = 7,
            ["Max"] = {
                4,
                4,
                1
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                110,
                110,
                110,
                110,
                125
            },
            ["Desc"] = {
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "持续时间延长",
                "持续时间延长",
                "持续时间延长",
                "持续时间延长",
                "光幕可以远距离进行释放"
            }
        },
        ["Passive"] = {
            ["Name"] = "黎明洞悉",
            ["UpgradeNumMax"] = 4,
            ["Max"] = {
                3,
                3
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "激活时间缩短",
                "激活时间缩短",
                "激活时间缩短",
                "敌方暴露时间延长",
                "敌方暴露时间延长",
                "敌方暴露时间延长"
            }
        },
        ["X"] = {
            ["Name"] = "庇护圣屏",
            ["UpgradeNumMax"] = 5,
            ["Max"] = {
                3,
                3,
                1
            },
            ["Need"] = {
                100,
                120,
                140,
                110,
                110,
                110,
                150
            },
            ["Desc"] = {
                "点数需求减少1点",
                "点数需求减少2点",
                "点数需求减少3点",
                "庇护圣屏持续时间延长",
                "庇护圣屏持续时间延长",
                "庇护圣屏持续时间延长",
                "立即刷新战术技能"
            }
        },
        ["E"] = {
            ["Name"] = "圣屏突进",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                3,
                1
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                120
            },
            ["Desc"] = {
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "光幕存在时间延长",
                "光幕存在时间延长",
                "光幕存在时间延长",
                "光幕最大推进距离延长"
            }
        },
        ["Shield"] = {
            ["Name"] = "护甲",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升"
            }
        },
        ["Survive"] = {
            ["Name"] = "生存",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加"
            }
        },
        ["Health"] = {
            ["Name"] = "生命值",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升"
            }
        },
        ["Injured"] = {
            ["Name"] = "倒地状态",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                80,
                80,
                80,
                80,
                80,
                80,
                80,
                80
            },
            ["Desc"] = {
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升"
            }
        },
        ["Arousal"] = {
            ["Active1Need"] = {
                ["蓝"] = 1,
                ["黄"] = 2,
                ["绿"] = 1
            },
            ["Active2Need"] = {
                ["蓝"] = 2,
                ["黄"] = 7,
                ["绿"] = 5
            },
            ["Active3Need"] = {
                ["蓝"] = 8,
                ["黄"] = 8,
                ["绿"] = 0
            }
        },
        ["Weapon"] = {
            ["TacticalItem"] = {
                ["破片手雷"] = 80,
                ["烟雾弹"] = 55,
                ["风场雷"] = 45,
                ["减速雷"] = 65,
                ["治疗雷"] = 45,
                ["警报器"] = 30,
                ["拦截者"] = 55
            }
        }
    },
    ["伊薇特"] = {
        ["Parts1"] = {
            ["Name"] = "核心",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "基础射速提升",
                "基础射速提升",
                "基础射速提升",
                "基础射速提升"
            }
        },
        ["Parts2"] = {
            ["Name"] = "暴击",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                110,
                110,
                110,
                110
            },
            ["Desc"] = {
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升"
            }
        },
        ["Parts4"] = {
            ["Name"] = "续航",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升"
            }
        },
        ["Parts5"] = {
            ["Name"] = "机能",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                85,
                85,
                85,
                85
            },
            ["Desc"] = {
                "散射控制提升",
                "散射控制提升",
                "散射控制提升",
                "散射控制提升",
                "操控速度提升",
                "操控速度提升",
                "操控速度提升",
                "操控速度提升"
            }
        },
        ["Q"] = {
            ["Name"] = "熊熊出击",
            ["UpgradeNumMax"] = 7,
            ["Max"] = {
                4,
                3,
                1,
                1
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                100,
                100,
                100,
                125,
                200
            },
            ["Desc"] = {
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "战术熊生命值提升",
                "战术熊生命值提升",
                "战术熊生命值提升",
                "易伤效果提升",
                "增加1次冲刺次数"
            }
        },
        ["Passive"] = {
            ["Name"] = "皑皑藏雪",
            ["UpgradeNumMax"] = 3,
            ["Max"] = {
                3
            },
            ["Need"] = {
                75,
                75,
                75
            },
            ["Desc"] = {
                "进入隐身速度加快",
                "进入隐身速度加快",
                "进入隐身速度加快"
            }
        },
        ["X"] = {
            ["Name"] = "爽爽霜风",
            ["UpgradeNumMax"] = 5,
            ["Max"] = {
                3,
                2,
                2
            },
            ["Need"] = {
                100,
                120,
                140,
                110,
                110,
                110,
                110
            },
            ["Desc"] = {
                "点数需求减少1点",
                "点数需求减少2点",
                "点数需求减少3点",
                "射速和人机工效降低",
                "射速和人机工效降低",
                "易伤效果提升",
                "易伤效果提升"
            }
        },
        ["E"] = {
            ["Name"] = "坚坚冰柱",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "冰柱生命值提升",
                "冰柱生命值提升",
                "冰柱生命值提升",
                "冰柱生命值提升"
            }
        },
        ["Shield"] = {
            ["Name"] = "护甲",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升"
            }
        },
        ["Survive"] = {
            ["Name"] = "生存",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加"
            }
        },
        ["Health"] = {
            ["Name"] = "生命值",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升"
            }
        },
        ["Injured"] = {
            ["Name"] = "倒地状态",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                80,
                80,
                80,
                80,
                80,
                80,
                80,
                80
            },
            ["Desc"] = {
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升"
            }
        },
        ["Arousal"] = {
            ["Active1Need"] = {
                ["蓝"] = 1,
                ["黄"] = 2,
                ["绿"] = 1
            },
            ["Active2Need"] = {
                ["蓝"] = 2,
                ["黄"] = 7,
                ["绿"] = 5
            },
            ["Active3Need"] = {
                ["蓝"] = 7,
                ["黄"] = 5,
                ["绿"] = 2
            }
        },
        ["Weapon"] = {
            ["TacticalItem"] = {
                ["破片手雷"] = 80,
                ["烟雾弹"] = 55,
                ["风场雷"] = 45,
                ["减速雷"] = 65,
                ["治疗雷"] = 45,
                ["警报器"] = 30,
                ["拦截者"] = 55
            }
        }
    },
    ["香奈美"] = {
        ["Parts1"] = {
            ["Name"] = "核心",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "开镜速度提升",
                "开镜速度提升",
                "开镜速度提升",
                "开镜速度提升"
            }
        },
        ["Parts2"] = {
            ["Name"] = "暴击",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                110,
                110,
                110,
                110
            },
            ["Desc"] = {
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升"
            }
        },
        ["Parts4"] = {
            ["Name"] = "续航",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升"
            }
        },
        ["Parts5"] = {
            ["Name"] = "机能",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "拉栓速度提升",
                "拉栓速度提升",
                "拉栓速度提升",
                "拉栓速度提升",
                "蓄力速度提升",
                "蓄力速度提升",
                "蓄力速度提升",
                "蓄力速度提升"
            }
        },
        ["Q"] = {
            ["Name"] = "旋律回响",
            ["UpgradeNumMax"] = 7,
            ["Max"] = {
                4,
                3,
                1,
                1
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                100,
                100,
                100,
                100,
                110
            },
            ["Desc"] = {
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "音符生命值提升",
                "音符生命值提升",
                "音符生命值提升",
                "敌方暴露时间延长",
                "音符持续时间延长"
            }
        },
        ["Passive"] = {
            ["Name"] = "交响爆音",
            ["UpgradeNumMax"] = 3,
            ["Max"] = {
                3
            },
            ["Need"] = {
                100,
                100,
                100
            },
            ["Desc"] = {
                "敌方暴露时间延长",
                "敌方暴露时间延长",
                "敌方暴露时间延长"
            }
        },
        ["X"] = {
            ["Name"] = "演出开始",
            ["UpgradeNumMax"] = 5,
            ["Max"] = {
                3,
                2,
                2
            },
            ["Need"] = {
                100,
                120,
                140,
                110,
                110,
                110,
                110
            },
            ["Desc"] = {
                "点数需求减少1点",
                "点数需求减少2点",
                "点数需求减少3点",
                "减速效果提升",
                "减速效果提升",
                "眩晕时间延长",
                "眩晕时间延长"
            }
        },
        ["E"] = {
            ["Name"] = "律动旋风",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                90,
                90,
                90,
                90
            },
            ["Desc"] = {
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "眩晕和加速时间延长",
                "眩晕和加速时间延长",
                "眩晕和加速时间延长",
                "眩晕和加速时间延长"
            }
        },
        ["Shield"] = {
            ["Name"] = "护甲",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升"
            }
        },
        ["Survive"] = {
            ["Name"] = "生存",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加"
            }
        },
        ["Health"] = {
            ["Name"] = "生命值",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升"
            }
        },
        ["Injured"] = {
            ["Name"] = "倒地状态",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                80,
                80,
                80,
                80,
                80,
                80,
                80,
                80
            },
            ["Desc"] = {
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升"
            }
        },
        ["Arousal"] = {
            ["Active1Need"] = {
                ["蓝"] = 2,
                ["黄"] = 2,
                ["绿"] = 0
            },
            ["Active2Need"] = {
                ["蓝"] = 7,
                ["黄"] = 5,
                ["绿"] = 2
            },
            ["Active3Need"] = {
                ["蓝"] = 5,
                ["黄"] = 7,
                ["绿"] = 2
            }
        },
        ["Weapon"] = {
            ["TacticalItem"] = {
                ["破片手雷"] = 55,
                ["烟雾弹"] = 80,
                ["风场雷"] = 65,
                ["减速雷"] = 65,
                ["治疗雷"] = 45,
                ["警报器"] = 45,
                ["拦截者"] = 80
            }
        }
    },
    ["芙拉薇娅"] = {
        ["Parts1"] = {
            ["Name"] = "核心",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "基础射速提升",
                "基础射速提升",
                "基础射速提升",
                "基础射速提升"
            }
        },
        ["Parts2"] = {
            ["Name"] = "暴击",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                110,
                110,
                110,
                110
            },
            ["Desc"] = {
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升"
            }
        },
        ["Parts4"] = {
            ["Name"] = "续航",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升"
            }
        },
        ["Parts5"] = {
            ["Name"] = "机能",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                85,
                85,
                85,
                85
            },
            ["Desc"] = {
                "散射控制提升",
                "散射控制提升",
                "散射控制提升",
                "散射控制提升",
                "操控速度提升",
                "操控速度提升",
                "操控速度提升",
                "操控速度提升"
            }
        },
        ["Q"] = {
            ["Name"] = "致幻魅影",
            ["UpgradeNumMax"] = 7,
            ["Max"] = {
                4,
                4,
                2
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                110,
                110,
                110,
                110,
                100,
                100
            },
            ["Desc"] = {
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "致幻球生命值提升",
                "致幻球生命值提升",
                "致幻球生命值提升",
                "致幻球生命值提升",
                "幻蝶跟随时间延长",
                "幻蝶跟随时间延长"
            }
        },
        ["Passive"] = {
            ["Name"] = "周生复始",
            ["UpgradeNumMax"] = 3,
            ["Max"] = {
                3
            },
            ["Need"] = {
                100,
                100,
                100
            },
            ["Desc"] = {
                "触发效果所需伤害量减少",
                "触发效果所需伤害量减少",
                "触发效果所需伤害量减少"
            }
        },
        ["X"] = {
            ["Name"] = "幻梦化蝶",
            ["UpgradeNumMax"] = 5,
            ["Max"] = {
                3,
                2,
                2
            },
            ["Need"] = {
                100,
                120,
                140,
                110,
                110,
                110,
                110
            },
            ["Desc"] = {
                "点数需求减少1点",
                "点数需求减少2点",
                "点数需求减少3点",
                "致幻领域持续时间延长",
                "致幻领域持续时间延长",
                "重塑消耗时间减少",
                "重塑消耗时间减少"
            }
        },
        ["E"] = {
            ["Name"] = "遁入幻境",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                90,
                90,
                90,
                90,
                90,
                90,
                90,
                90
            },
            ["Desc"] = {
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "持续时间延长",
                "持续时间延长",
                "持续时间延长",
                "持续时间延长"
            }
        },
        ["Shield"] = {
            ["Name"] = "护甲",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升"
            }
        },
        ["Survive"] = {
            ["Name"] = "生存",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加"
            }
        },
        ["Health"] = {
            ["Name"] = "生命值",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升"
            }
        },
        ["Injured"] = {
            ["Name"] = "倒地状态",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                80,
                80,
                80,
                80,
                80,
                80,
                80,
                80
            },
            ["Desc"] = {
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升"
            }
        },
        ["Arousal"] = {
            ["Active1Need"] = {
                ["蓝"] = 2,
                ["黄"] = 0,
                ["绿"] = 2
            },
            ["Active2Need"] = {
                ["蓝"] = 7,
                ["黄"] = 2,
                ["绿"] = 5
            },
            ["Active3Need"] = {
                ["蓝"] = 7,
                ["黄"] = 5,
                ["绿"] = 2
            }
        },
        ["Weapon"] = {
            ["TacticalItem"] = {
                ["破片手雷"] = 80,
                ["烟雾弹"] = 80,
                ["风场雷"] = 65,
                ["减速雷"] = 65,
                ["治疗雷"] = 45,
                ["警报器"] = 45,
                ["拦截者"] = 80
            }
        }
    },
    ["艾卡"] = {
        ["Parts1"] = {
            ["Name"] = "核心",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "弹丸数提升",
                "弹丸数提升",
                "弹丸数提升",
                "弹丸数提升",
                "基础射速提升",
                "基础射速提升",
                "基础射速提升",
                "基础射速提升"
            }
        },
        ["Parts2"] = {
            ["Name"] = "暴击",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                110,
                110,
                110,
                110
            },
            ["Desc"] = {
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升"
            }
        },
        ["Parts4"] = {
            ["Name"] = "续航",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升"
            }
        },
        ["Parts5"] = {
            ["Name"] = "机能",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                85,
                85,
                85,
                85
            },
            ["Desc"] = {
                "散射控制提升",
                "散射控制提升",
                "散射控制提升",
                "散射控制提升",
                "操控速度提升",
                "操控速度提升",
                "操控速度提升",
                "操控速度提升"
            }
        },
        ["Q"] = {
            ["Name"] = "炼狱牢笼",
            ["UpgradeNumMax"] = 7,
            ["Max"] = {
                4,
                4,
                3
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                125,
                125,
                125,
                125,
                80,
                80,
                80
            },
            ["Desc"] = {
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "技能伤害提升",
                "技能伤害提升",
                "技能伤害提升",
                "技能伤害提升",
                "持续时间延长",
                "持续时间延长",
                "持续时间延长"
            }
        },
        ["Passive"] = {
            ["Name"] = "日珥蓄火",
            ["UpgradeNumMax"] = 4,
            ["Max"] = {
                3,
                3
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "伤害转化热量比例提升",
                "伤害转化热量比例提升",
                "伤害转化热量比例提升",
                "热量散失间隔延长",
                "热量散失间隔延长",
                "热量散失间隔延长"
            }
        },
        ["X"] = {
            ["Name"] = "烈焰风暴",
            ["UpgradeNumMax"] = 5,
            ["Max"] = {
                3,
                4
            },
            ["Need"] = {
                100,
                120,
                140,
                110,
                110,
                110,
                110
            },
            ["Desc"] = {
                "点数需求减少1点",
                "点数需求减少2点",
                "点数需求减少3点",
                "技能伤害提升",
                "技能伤害提升",
                "技能伤害提升",
                "技能伤害提升"
            }
        },
        ["E"] = {
            ["Name"] = "爆焰热弹",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                115,
                115,
                115,
                115
            },
            ["Desc"] = {
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "技能伤害提升",
                "技能伤害提升",
                "技能伤害提升",
                "技能伤害提升"
            }
        },
        ["Shield"] = {
            ["Name"] = "护甲",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升"
            }
        },
        ["Survive"] = {
            ["Name"] = "生存",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加"
            }
        },
        ["Health"] = {
            ["Name"] = "生命值",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升"
            }
        },
        ["Injured"] = {
            ["Name"] = "倒地状态",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                80,
                80,
                80,
                80,
                80,
                80,
                80,
                80
            },
            ["Desc"] = {
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升"
            }
        },
        ["Arousal"] = {
            ["Active1Need"] = {
                ["蓝"] = 2,
                ["黄"] = 0,
                ["绿"] = 2
            },
            ["Active2Need"] = {
                ["蓝"] = 5,
                ["黄"] = 7,
                ["绿"] = 2
            },
            ["Active3Need"] = {
                ["蓝"] = 7,
                ["黄"] = 2,
                ["绿"] = 5
            }
        },
        ["Weapon"] = {
            ["TacticalItem"] = {
                ["破片手雷"] = 80,
                ["烟雾弹"] = 80,
                ["风场雷"] = 65,
                ["减速雷"] = 45,
                ["治疗雷"] = 30,
                ["警报器"] = 45,
                ["拦截者"] = 80
            }
        }
    },
    ["加拉蒂亚·利里"] = {
        ["Parts1"] = {
            ["Name"] = "核心",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "基础射速提升",
                "基础射速提升",
                "基础射速提升",
                "基础射速提升"
            }
        },
        ["Parts2"] = {
            ["Name"] = "暴击",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                110,
                110,
                110,
                110
            },
            ["Desc"] = {
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升"
            }
        },
        ["Parts4"] = {
            ["Name"] = "续航",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升"
            }
        },
        ["Parts5"] = {
            ["Name"] = "机能",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "散射控制提升",
                "散射控制提升",
                "散射控制提升",
                "散射控制提升",
                "后坐控制提升",
                "后坐控制提升",
                "后坐控制提升",
                "后坐控制提升"
            }
        },
        ["Q"] = {
            ["Name"] = "飞牌瞬闪",
            ["UpgradeNumMax"] = 7,
            ["Max"] = {
                4,
                4,
                2
            },
            ["Need"] = {
                105,
                105,
                105,
                105,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "假身存在时间延长",
                "假身存在时间延长",
                "假身存在时间延长",
                "假身存在时间延长",
                "假身生命值提升",
                "假身生命值提升"
            }
        },
        ["Passive"] = {
            ["Name"] = "欺诈牌影",
            ["UpgradeNumMax"] = 4,
            ["Max"] = {
                2,
                2,
                2
            },
            ["Need"] = {
                80,
                80,
                80,
                80,
                80,
                80
            },
            ["Desc"] = {
                "冷却时间减少",
                "冷却时间减少",
                "假身存在时间延长",
                "假身存在时间延长",
                "假身生命值提升",
                "假身生命值提升"
            }
        },
        ["X"] = {
            ["Name"] = "牌影戏法",
            ["UpgradeNumMax"] = 5,
            ["Max"] = {
                3,
                2,
                2
            },
            ["Need"] = {
                100,
                120,
                140,
                110,
                110,
                110,
                110
            },
            ["Desc"] = {
                "点数需求减少1点",
                "点数需求减少2点",
                "点数需求减少3点",
                "假身存在时间延长",
                "假身存在时间延长",
                "假身生命值提升",
                "假身生命值提升"
            }
        },
        ["E"] = {
            ["Name"] = "致盲牌影",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                2,
                2
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "假身存在时间延长",
                "假身存在时间延长",
                "假身生命值减少",
                "假身生命值减少"
            }
        },
        ["Shield"] = {
            ["Name"] = "护甲",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升"
            }
        },
        ["Survive"] = {
            ["Name"] = "生存",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加"
            }
        },
        ["Health"] = {
            ["Name"] = "生命值",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升"
            }
        },
        ["Injured"] = {
            ["Name"] = "倒地状态",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                80,
                80,
                80,
                80,
                80,
                80,
                80,
                80
            },
            ["Desc"] = {
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升"
            }
        },
        ["Arousal"] = {
            ["Active1Need"] = {
                ["蓝"] = 2,
                ["黄"] = 2,
                ["绿"] = 0
            },
            ["Active2Need"] = {
                ["蓝"] = 5,
                ["黄"] = 2,
                ["绿"] = 5
            },
            ["Active3Need"] = {
                ["蓝"] = 5,
                ["黄"] = 5,
                ["绿"] = 2
            }
        },
        ["Weapon"] = {
            ["TacticalItem"] = {
                ["破片手雷"] = 55,
                ["烟雾弹"] = 80,
                ["风场雷"] = 65,
                ["减速雷"] = 65,
                ["治疗雷"] = 45,
                ["警报器"] = 45,
                ["拦截者"] = 80
            }
        }
    },
    ["珐格兰丝"] = {
        ["Parts1"] = {
            ["Name"] = "核心",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "基础射速提升",
                "基础射速提升",
                "基础射速提升",
                "基础射速提升"
            }
        },
        ["Parts2"] = {
            ["Name"] = "暴击",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                110,
                110,
                110,
                110
            },
            ["Desc"] = {
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升"
            }
        },
        ["Parts4"] = {
            ["Name"] = "续航",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升"
            }
        },
        ["Parts5"] = {
            ["Name"] = "机能",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "散射控制提升",
                "散射控制提升",
                "散射控制提升",
                "散射控制提升",
                "后坐控制提升",
                "后坐控制提升",
                "后坐控制提升",
                "后坐控制提升"
            }
        },
        ["Q"] = {
            ["Name"] = "活力芬芳",
            ["UpgradeNumMax"] = 7,
            ["Max"] = {
                4,
                4,
                2,
                1
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                110,
                110,
                110,
                110,
                100,
                100,
                200
            },
            ["Desc"] = {
                "效果范围扩大",
                "效果范围扩大",
                "效果范围扩大",
                "效果范围扩大",
                "增益效果提升",
                "增益效果提升",
                "增益效果提升",
                "增益效果提升",
                "持续时间延长",
                "持续时间延长",
                "上限增加至4个"
            }
        },
        ["Passive"] = {
            ["Name"] = "复苏芳香",
            ["UpgradeNumMax"] = 4,
            ["Max"] = {
                3,
                3
            },
            ["Need"] = {
                100,
                100,
                100,
                105,
                105,
                105
            },
            ["Desc"] = {
                "效果范围扩大",
                "效果范围扩大",
                "效果范围扩大",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升"
            }
        },
        ["X"] = {
            ["Name"] = "激昂芬芳",
            ["UpgradeNumMax"] = 5,
            ["Max"] = {
                3,
                4
            },
            ["Need"] = {
                100,
                120,
                140,
                110,
                110,
                110,
                110
            },
            ["Desc"] = {
                "点数需求减少1点",
                "点数需求减少2点",
                "点数需求减少3点",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升"
            }
        },
        ["E"] = {
            ["Name"] = "香语众氛",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                3,
                3
            },
            ["Need"] = {
                90,
                90,
                90,
                90,
                90,
                90,
                90,
                90,
                90,
                90
            },
            ["Desc"] = {
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "持续时间延长",
                "持续时间延长",
                "持续时间延长"
            }
        },
        ["Shield"] = {
            ["Name"] = "护甲",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升"
            }
        },
        ["Survive"] = {
            ["Name"] = "生存",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加"
            }
        },
        ["Health"] = {
            ["Name"] = "生命值",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升"
            }
        },
        ["Injured"] = {
            ["Name"] = "倒地状态",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                80,
                80,
                80,
                80,
                80,
                80,
                80,
                80
            },
            ["Desc"] = {
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升"
            }
        },
        ["Arousal"] = {
            ["Active1Need"] = {
                ["蓝"] = 0,
                ["黄"] = 2,
                ["绿"] = 2
            },
            ["Active2Need"] = {
                ["蓝"] = 2,
                ["黄"] = 5,
                ["绿"] = 7
            },
            ["Active3Need"] = {
                ["蓝"] = 2,
                ["黄"] = 7,
                ["绿"] = 5
            }
        },
        ["Weapon"] = {
            ["TacticalItem"] = {
                ["破片手雷"] = 80,
                ["烟雾弹"] = 80,
                ["风场雷"] = 65,
                ["减速雷"] = 45,
                ["治疗雷"] = 30,
                ["警报器"] = 45,
                ["拦截者"] = 80
            }
        }
    },
    ["忧雾"] = {
        ["Parts1"] = {
            ["Name"] = "核心",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "基础射速提升",
                "基础射速提升",
                "基础射速提升",
                "基础射速提升"
            }
        },
        ["Parts2"] = {
            ["Name"] = "暴击",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                110,
                110,
                110,
                110
            },
            ["Desc"] = {
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升"
            }
        },
        ["Parts4"] = {
            ["Name"] = "续航",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升"
            }
        },
        ["Parts5"] = {
            ["Name"] = "机能",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "散射控制提升",
                "散射控制提升",
                "散射控制提升",
                "散射控制提升",
                "后坐控制提升",
                "后坐控制提升",
                "后坐控制提升",
                "后坐控制提升"
            }
        },
        ["Q"] = {
            ["Name"] = "蚀甲毒雾",
            ["UpgradeNumMax"] = 7,
            ["Max"] = {
                4,
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                110,
                110,
                110,
                110,
                135,
                135,
                135,
                135
            },
            ["Desc"] = {
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "减少能量消耗",
                "减少能量消耗",
                "减少能量消耗",
                "减少能量消耗",
                "护甲腐蚀速率提升",
                "护甲腐蚀速率提升",
                "护甲腐蚀速率提升",
                "护甲腐蚀速率提升"
            }
        },
        ["Passive"] = {
            ["Name"] = "毒雾爆发",
            ["UpgradeNumMax"] = 4,
            ["Max"] = {
                4,
                2
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                75,
                75
            },
            ["Desc"] = {
                "护甲腐蚀速率提升",
                "护甲腐蚀速率提升",
                "护甲腐蚀速率提升",
                "护甲腐蚀速率提升",
                "减少触发所需伤害",
                "减少触发所需伤害"
            }
        },
        ["X"] = {
            ["Name"] = "凌毒侵蚀",
            ["UpgradeNumMax"] = 5,
            ["Max"] = {
                3,
                4
            },
            ["Need"] = {
                100,
                120,
                140,
                110,
                110,
                110,
                110
            },
            ["Desc"] = {
                "点数需求减少1点",
                "点数需求减少2点",
                "点数需求减少3点",
                "护甲腐蚀速率提升",
                "护甲腐蚀速率提升",
                "护甲腐蚀速率提升",
                "护甲腐蚀速率提升"
            }
        },
        ["E"] = {
            ["Name"] = "腐蚀溶液",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                3,
                1
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                125,
                125,
                125,
                125
            },
            ["Desc"] = {
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "冷却时间减少",
                "技能伤害提升",
                "技能伤害提升",
                "技能伤害提升",
                "减速效果提升"
            }
        },
        ["Shield"] = {
            ["Name"] = "护甲",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升"
            }
        },
        ["Survive"] = {
            ["Name"] = "生存",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加"
            }
        },
        ["Health"] = {
            ["Name"] = "生命值",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升"
            }
        },
        ["Injured"] = {
            ["Name"] = "倒地状态",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                80,
                80,
                80,
                80,
                80,
                80,
                80,
                80
            },
            ["Desc"] = {
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升"
            }
        },
        ["Arousal"] = {
            ["Active1Need"] = {
                ["蓝"] = 1,
                ["黄"] = 2,
                ["绿"] = 1
            },
            ["Active2Need"] = {
                ["蓝"] = 2,
                ["黄"] = 7,
                ["绿"] = 5
            },
            ["Active3Need"] = {
                ["蓝"] = 5,
                ["黄"] = 7,
                ["绿"] = 2
            }
        },
        ["Weapon"] = {
            ["TacticalItem"] = {
                ["破片手雷"] = 80,
                ["烟雾弹"] = 55,
                ["风场雷"] = 45,
                ["减速雷"] = 65,
                ["治疗雷"] = 45,
                ["警报器"] = 30,
                ["拦截者"] = 55
            }
        }
    },
    ["蕾欧娜"] = {
        ["Parts1"] = {
            ["Name"] = "核心",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "基础射速提升",
                "基础射速提升",
                "基础射速提升",
                "基础射速提升"
            }
        },
        ["Parts2"] = {
            ["Name"] = "暴击",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                110,
                110,
                110,
                110
            },
            ["Desc"] = {
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升"
            }
        },
        ["Parts4"] = {
            ["Name"] = "续航",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升"
            }
        },
        ["Parts5"] = {
            ["Name"] = "机能",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                85,
                85,
                85,
                85
            },
            ["Desc"] = {
                "散射控制提升",
                "散射控制提升",
                "散射控制提升",
                "散射控制提升",
                "操控速度提升",
                "操控速度提升",
                "操控速度提升",
                "操控速度提升"
            }
        },
        ["Q"] = {
            ["Name"] = "弦能掩墙",
            ["UpgradeNumMax"] = 7,
            ["Max"] = {
                4,
                2,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                115,
                115,
                110,
                110,
                110,
                110
            },
            ["Desc"] = {
                "方块生命值提升",
                "方块生命值提升",
                "方块生命值提升",
                "方块生命值提升",
                "减少能量消耗",
                "减少能量消耗",
                "上限增加至10个",
                "上限增加至12个",
                "上限增加至14个",
                "上限增加至16个"
            }
        },
        ["Passive"] = {
            ["Name"] = "劳逸结合",
            ["UpgradeNumMax"] = 3,
            ["Max"] = {
                3
            },
            ["Need"] = {
                100,
                100,
                100
            },
            ["Desc"] = {
                "加速和恢复效果提升",
                "加速和恢复效果提升",
                "加速和恢复效果提升"
            }
        },
        ["X"] = {
            ["Name"] = "纯净坚城",
            ["UpgradeNumMax"] = 5,
            ["Max"] = {
                3,
                2,
                2
            },
            ["Need"] = {
                100,
                120,
                140,
                110,
                110,
                110,
                110
            },
            ["Desc"] = {
                "点数需求减少1点",
                "点数需求减少2点",
                "点数需求减少3点",
                "持续时间延长",
                "持续时间延长",
                "立即返还方块层数",
                "立即返还方块层数"
            }
        },
        ["E"] = {
            ["Name"] = "防弹护窗",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                2,
                2
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                100,
                100,
                120,
                120
            },
            ["Desc"] = {
                "防弹玻璃生命值提升",
                "防弹玻璃生命值提升",
                "防弹玻璃生命值提升",
                "防弹玻璃生命值提升",
                "减少能量消耗",
                "减少能量消耗",
                "上限增加至2个",
                "上限增加至3个"
            }
        },
        ["Shield"] = {
            ["Name"] = "护甲",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升"
            }
        },
        ["Survive"] = {
            ["Name"] = "生存",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加"
            }
        },
        ["Health"] = {
            ["Name"] = "生命值",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升"
            }
        },
        ["Injured"] = {
            ["Name"] = "倒地状态",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                80,
                80,
                80,
                80,
                80,
                80,
                80,
                80
            },
            ["Desc"] = {
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升"
            }
        },
        ["Arousal"] = {
            ["Active1Need"] = {
                ["蓝"] = 1,
                ["黄"] = 2,
                ["绿"] = 1
            },
            ["Active2Need"] = {
                ["蓝"] = 2,
                ["黄"] = 7,
                ["绿"] = 5
            },
            ["Active3Need"] = {
                ["蓝"] = 5,
                ["黄"] = 7,
                ["绿"] = 2
            }
        },
        ["Weapon"] = {
            ["TacticalItem"] = {
                ["破片手雷"] = 80,
                ["烟雾弹"] = 55,
                ["风场雷"] = 45,
                ["减速雷"] = 65,
                ["治疗雷"] = 45,
                ["警报器"] = 30,
                ["拦截者"] = 55
            }
        }
    },
    ["122"] = {
        ["Parts1"] = {
            ["Name"] = "核心",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "基础射速提升",
                "基础射速提升",
                "基础射速提升",
                "基础射速提升"
            }
        },
        ["Parts2"] = {
            ["Name"] = "暴击",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                110,
                110,
                110,
                110
            },
            ["Desc"] = {
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升"
            }
        },
        ["Parts4"] = {
            ["Name"] = "续航",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升"
            }
        },
        ["Parts5"] = {
            ["Name"] = "机能",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "散射控制提升",
                "散射控制提升",
                "散射控制提升",
                "散射控制提升",
                "后坐控制提升",
                "后坐控制提升",
                "后坐控制提升",
                "后坐控制提升"
            }
        },
        ["Q"] = {
            ["Name"] = "",
            ["UpgradeNumMax"] = 7,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "持续时间增加1秒",
                "持续时间增加2秒",
                "持续时间增加3秒",
                "技能伤害提升",
                "技能伤害提升",
                "技能伤害提升"
            }
        },
        ["Passive"] = {
            ["Name"] = "",
            ["UpgradeNumMax"] = 3,
            ["Max"] = {
                3
            },
            ["Need"] = {
                100,
                100,
                100
            },
            ["Desc"] = {
                "吸甲量提升30%",
                "吸甲量提升60%"
            }
        },
        ["X"] = {
            ["Name"] = "",
            ["UpgradeNumMax"] = 5,
            ["Max"] = {
                3,
                4
            },
            ["Need"] = {
                100,
                120,
                140,
                110,
                110,
                110,
                110
            },
            ["Desc"] = {
                "点数需求减少1点",
                "点数需求减少2点",
                "点数需求减少3点",
                "减速子弹效果提升",
                "吸甲量提升100%"
            }
        },
        ["E"] = {
            ["Name"] = "",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "解锁战术技能",
                "闪光电球生命值提升",
                "闪光电球生命值提升",
                "闪光电球生命值提升"
            }
        },
        ["Shield"] = {
            ["Name"] = "护甲",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升"
            }
        },
        ["Survive"] = {
            ["Name"] = "生存",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加"
            }
        },
        ["Health"] = {
            ["Name"] = "生命值",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升"
            }
        },
        ["Injured"] = {
            ["Name"] = "倒地状态",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                80,
                80,
                80,
                80,
                80,
                80,
                80,
                80
            },
            ["Desc"] = {
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升"
            }
        },
        ["Arousal"] = {
            ["Active1Need"] = {
                ["蓝"] = 2,
                ["黄"] = 0,
                ["绿"] = 2
            },
            ["Active2Need"] = {
                ["蓝"] = 1,
                ["黄"] = 1,
                ["绿"] = 2
            },
            ["Active3Need"] = {
                ["蓝"] = 1,
                ["黄"] = 2,
                ["绿"] = 1
            }
        },
        ["Weapon"] = {
            ["TacticalItem"] = {
                ["破片手雷"] = 80,
                ["烟雾弹"] = 80,
                ["风场雷"] = 65,
                ["减速雷"] = 65,
                ["治疗雷"] = 45,
                ["警报器"] = 45,
                ["拦截者"] = 80
            }
        }
    },
    ["125"] = {
        ["Parts1"] = {
            ["Name"] = "核心",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "基础伤害提升",
                "基础射速提升",
                "基础射速提升",
                "基础射速提升",
                "基础射速提升"
            }
        },
        ["Parts2"] = {
            ["Name"] = "暴击",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                110,
                110,
                110,
                110
            },
            ["Desc"] = {
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "爆头伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升",
                "弦化伤害提升"
            }
        },
        ["Parts4"] = {
            ["Name"] = "续航",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                110,
                110,
                110,
                110,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "载弹数量提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升",
                "换弹速度提升"
            }
        },
        ["Parts5"] = {
            ["Name"] = "机能",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                90,
                90,
                90,
                90,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "散射控制提升",
                "散射控制提升",
                "散射控制提升",
                "散射控制提升",
                "后坐控制提升",
                "后坐控制提升",
                "后坐控制提升",
                "后坐控制提升"
            }
        },
        ["Q"] = {
            ["Name"] = "",
            ["UpgradeNumMax"] = 7,
            ["Max"] = {
                4,
                4,
                1
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "持续时间增加1秒",
                "持续时间增加2秒",
                "持续时间增加3秒",
                "技能伤害提升",
                "技能伤害提升",
                "技能伤害提升"
            }
        },
        ["Passive"] = {
            ["Name"] = "",
            ["UpgradeNumMax"] = 3,
            ["Max"] = {
                3
            },
            ["Need"] = {
                100,
                100,
                100
            },
            ["Desc"] = {
                "吸甲量提升30%",
                "吸甲量提升60%"
            }
        },
        ["X"] = {
            ["Name"] = "",
            ["UpgradeNumMax"] = 5,
            ["Max"] = {
                3,
                2,
                2
            },
            ["Need"] = {
                100,
                120,
                140,
                110,
                110,
                110,
                110
            },
            ["Desc"] = {
                "点数需求减少1点",
                "点数需求减少2点",
                "点数需求减少3点",
                "减速子弹效果提升",
                "吸甲量提升100%"
            }
        },
        ["E"] = {
            ["Name"] = "",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "解锁战术技能",
                "闪光电球生命值提升",
                "闪光电球生命值提升",
                "闪光电球生命值提升"
            }
        },
        ["Shield"] = {
            ["Name"] = "护甲",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲恢复速度提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升",
                "护甲上限提升"
            }
        },
        ["Survive"] = {
            ["Name"] = "生存",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                100,
                100,
                100,
                100,
                100,
                100,
                100,
                100
            },
            ["Desc"] = {
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态移速增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加",
                "弦化状态减伤增加"
            }
        },
        ["Health"] = {
            ["Name"] = "生命值",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                150,
                150,
                150,
                150,
                150,
                150,
                150,
                150
            },
            ["Desc"] = {
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值恢复速度提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升",
                "生命值上限提升"
            }
        },
        ["Injured"] = {
            ["Name"] = "倒地状态",
            ["UpgradeNumMax"] = 6,
            ["Max"] = {
                4,
                4
            },
            ["Need"] = {
                80,
                80,
                80,
                80,
                80,
                80,
                80,
                80
            },
            ["Desc"] = {
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地留存时间延长",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升",
                "倒地状态生命值提升"
            }
        },
        ["Arousal"] = {
            ["Active1Need"] = {
                ["蓝"] = 2,
                ["黄"] = 0,
                ["绿"] = 2
            },
            ["Active2Need"] = {
                ["蓝"] = 3,
                ["黄"] = 2,
                ["绿"] = 6
            },
            ["Active3Need"] = {
                ["蓝"] = 3,
                ["黄"] = 5,
                ["绿"] = 3
            }
        },
        ["Weapon"] = {
            ["TacticalItem"] = {
                ["破片手雷"] = 80,
                ["烟雾弹"] = 80,
                ["风场雷"] = 65,
                ["减速雷"] = 65,
                ["治疗雷"] = 45,
                ["警报器"] = 45,
                ["拦截者"] = 80
            }
        }
    }
}