return {
	{
		id = 93001,
		name = "弦流识域",
		quality = 0,
		desc = "自此间，链接无限。<br /><br />匹配房间背景和个人名片样式。装配后，其他玩家加入你的房间也会可见。",
	},
	{
		id = 93002,
		name = "弦光跃金",
		quality = 5,
		desc = "您的卓越不凡，值得赫尔墨斯商会在此敬献至高的尊礼。<br />这场跨维的会晤，将在弦能的交汇中闪耀永不磨灭的光辉。<br /><br />匹配房间背景和个人名片样式。装配后，其他玩家加入你的房间也会可见。",
	},
	{
		id = 93003,
		name = "掠金狂潮",
		quality = 5,
		desc = "空气中残留的硝烟、散落的金币与墙上张狂的涂鸦，无不昭示着这里刚刚结束了一场失控的乱斗。",
	},
	{
		id = 93004,
		name = "鱼戏遥星",
		quality = 5,
		desc = "去寻找唯有此夜才会出游的奇迹吧。",
	},
	{
		id = 93005,
		name = "巅峰斗场",
		quality = 5,
		desc = "舞台已经就绪，观众已经列席，无需压抑自己，敬请全力释放战斗的天性，化作此夜最耀眼的明星。",
	},
	{
		id = 93006,
		name = "晨星礼颂",
		quality = 5,
		desc = "看啊，她的视线已经降临，是那自穹顶垂落的辉光。",
	},
}