return {
	['米雪儿·李'] = {
		Parts1 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "基础伤害提升", "基础射速提升" },
		},
		Parts2 = {
			name = "暴击",
			need = { 150, 150 },
			desc = { "爆头伤害提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "后坐控制提升" },
		},
		['护甲'] = {
			name = "护甲",
			need = { 250, 250 },
			desc = { "快回轻型护甲", "重型护甲" },
		},
		['弦化'] = {
			name = "弦化",
			need = { 250, 250 },
			desc = { "弦化状态移速增加15%", "弦化减伤系数提至46%" },
		},
		['主动技能'] = {
			name = "喵喵卫士",
			need = { 250, 250 },
			desc = { "伤害和射程增加50%", "上限增加至3个" },
		},
		['被动技能'] = {
			name = "猫踪喵迹",
			need = { 250 },
			desc = { "敌方暴露时间增加2秒" },
		},
		['技能觉醒'] = {
			ArousalUnlock = "",
			Active1Need = { 1, 0, 1 },
			Active2Need = { 1, 2, 1 },
			Active3Need = { 3, 1, 1 },
		},
	},
	['明'] = {
		Parts1 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "基础伤害提升", "基础射速提升" },
		},
		Parts2 = {
			name = "暴击",
			need = { 150, 150 },
			desc = { "爆头伤害提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "后坐控制提升" },
		},
		['护甲'] = {
			name = "护甲",
			need = { 250, 250 },
			desc = { "快回轻型护甲", "重型护甲" },
		},
		['弦化'] = {
			name = "弦化",
			need = { 250, 250 },
			desc = { "弦化状态移速增加15%", "弦化减伤系数提至46%" },
		},
		['主动技能'] = {
			name = "破甲电球",
			need = { 250, 250 },
			desc = { "冷却时间减少5秒", "持续时间增加2秒" },
		},
		['被动技能'] = {
			name = "吸能赋甲",
			need = { 250 },
			desc = { "吸甲量提升50%" },
		},
		['技能觉醒'] = {
			ArousalUnlock = "",
			Active1Need = { 1, 1, 0 },
			Active2Need = { 1, 1, 2 },
			Active3Need = { 1, 2, 1 },
		},
	},
	['星绘'] = {
		Parts1 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "基础伤害提升", "基础射速提升" },
		},
		Parts2 = {
			name = "暴击",
			need = { 150, 150 },
			desc = { "爆头伤害提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "后坐控制提升" },
		},
		['护甲'] = {
			name = "护甲",
			need = { 250, 250 },
			desc = { "快回轻型护甲", "重型护甲" },
		},
		['弦化'] = {
			name = "弦化",
			need = { 250, 250 },
			desc = { "弦化状态移速增加15%", "弦化减伤系数提至46%" },
		},
		['主动技能'] = {
			name = "守护星芒",
			need = { 250, 250 },
			desc = { "冷却时间减少8秒", "上限增加至3个" },
		},
		['被动技能'] = {
			name = "星弦甲生",
			need = { 250 },
			desc = { "恢复速度提升100%" },
		},
		['技能觉醒'] = {
			ArousalUnlock = "",
			Active1Need = { 0, 1, 1 },
			Active2Need = { 3, 1, 1 },
			Active3Need = { 1, 1, 2 },
		},
	},
	['梅瑞狄斯'] = {
		Parts1 = {
			name = "核心",
			need = { 150, 150 },
			desc = { "基础伤害提升", "基础射速提升" },
		},
		Parts2 = {
			name = "暴击",
			need = { 150, 150 },
			desc = { "爆头伤害提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "后坐控制提升" },
		},
		['护甲'] = {
			name = "护甲",
			need = { 250, 250 },
			desc = { "快回轻型护甲", "重型护甲" },
		},
		['弦化'] = {
			name = "弦化",
			need = { 250, 250 },
			desc = { "弦化状态移速增加15%", "弦化减伤系数提至46%" },
		},
		['主动技能'] = {
			name = "金沙热浪",
			need = { 250, 250 },
			desc = { "持续时间增加4秒", "冷却时间减少7秒" },
		},
		['被动技能'] = {
			name = "时零沙环",
			need = { 250 },
			desc = { "悬浮时重力减少" },
		},
		['技能觉醒'] = {
			ArousalUnlock = "",
			Active1Need = { 1, 1, 0 },
			Active2Need = { 1, 2, 1 },
			Active3Need = { 2, 2, 0 },
		},
	},
	['绯莎'] = {
		Parts1 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "基础伤害提升", "基础射速提升" },
		},
		Parts2 = {
			name = "暴击",
			need = { 150, 150 },
			desc = { "爆头伤害提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "后坐控制提升" },
		},
		['护甲'] = {
			name = "护甲",
			need = { 250, 250 },
			desc = { "快回轻型护甲", "重型护甲" },
		},
		['弦化'] = {
			name = "弦化",
			need = { 250, 250 },
			desc = { "弦化状态移速增加15%", "弦化减伤系数提至46%" },
		},
		['主动技能'] = {
			name = "残息追踪",
			need = { 250, 250 },
			desc = { "冷却时间减少5秒", "持续时间增加3秒" },
		},
		['被动技能'] = {
			name = "以战养战",
			need = { 250 },
			desc = { "恢复总量和恢复速率提升" },
		},
		['技能觉醒'] = {
			ArousalUnlock = "",
			Active1Need = { 0, 1, 1 },
			Active2Need = { 1, 1, 2 },
			Active3Need = { 1, 2, 1 },
		},
	},
	['拉薇'] = {
		Parts1 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "基础伤害提升", "基础射速提升" },
		},
		Parts2 = {
			name = "暴击",
			need = { 150, 150 },
			desc = { "爆头伤害提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "后坐控制提升" },
		},
		['护甲'] = {
			name = "护甲",
			need = { 250, 250 },
			desc = { "快回轻型护甲", "重型护甲" },
		},
		['弦化'] = {
			name = "弦化",
			need = { 250, 250 },
			desc = { "弦化状态移速增加15%", "弦化减伤系数提至46%" },
		},
		['主动技能'] = {
			name = "寻影猎刃",
			need = { 250 },
			desc = { "冷却时间减少5秒" },
		},
		['被动技能'] = {
			name = "猎手专注",
			need = { 250 },
			desc = { "加速效果提高50%" },
		},
		['技能觉醒'] = {
			ArousalUnlock = "",
			Active1Need = { 1, 1, 0 },
			Active2Need = { 1, 2, 1 },
			Active3Need = { 1, 1, 2 },
		},
	},
	['信'] = {
		Parts1 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "基础伤害提升", "基础射速提升" },
		},
		Parts2 = {
			name = "暴击",
			need = { 150, 150 },
			desc = { "爆头伤害提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "后坐控制提升" },
		},
		['护甲'] = {
			name = "护甲",
			need = { 250, 250 },
			desc = { "快回轻型护甲", "重型护甲" },
		},
		['弦化'] = {
			name = "弦化",
			need = { 250, 250 },
			desc = { "弦化状态移速增加15%", "弦化减伤系数提至46%" },
		},
		['主动技能'] = {
			name = "守望之眼",
			need = { 250, 250 },
			desc = { "射速和人机工效提升50%", "每秒护甲恢复量增加5点" },
		},
		['被动技能'] = {
			name = "致盲脉冲",
			need = { 250 },
			desc = { "弱化时间增加2秒" },
		},
		['技能觉醒'] = {
			ArousalUnlock = "",
			Active1Need = { 1, 0, 1 },
			Active2Need = { 1, 2, 1 },
			Active3Need = { 3, 1, 1 },
		},
	},
	['玛德蕾娜·利里'] = {
		Parts1 = {
			name = "核心",
			need = { 150, 150 },
			desc = { "基础伤害提升", "双发扳机" },
		},
		Parts2 = {
			name = "暴击",
			need = { 150, 150 },
			desc = { "爆头伤害提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "移动速度提升", "后坐控制提升" },
		},
		['护甲'] = {
			name = "护甲",
			need = { 250, 250 },
			desc = { "快回轻型护甲", "重型护甲" },
		},
		['弦化'] = {
			name = "弦化",
			need = { 250, 250 },
			desc = { "弦化状态移速增加15%", "弦化减伤系数提至46%" },
		},
		['主动技能'] = {
			name = "颜料束缚",
			need = { 250, 250 },
			desc = { "持续时间增加5秒", "上限增加至3个" },
		},
		['被动技能'] = {
			name = "颜料脚印",
			need = { 250 },
			desc = { "减速时间增加1秒" },
		},
		['技能觉醒'] = {
			ArousalUnlock = "",
			Active1Need = { 1, 1, 0 },
			Active2Need = { 0, 2, 2 },
			Active3Need = { 2, 2, 0 },
		},
	},
	['奥黛丽·格罗夫'] = {
		Parts1 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "基础伤害提升", "基础射速提升" },
		},
		Parts2 = {
			name = "暴击",
			need = { 150, 150 },
			desc = { "爆头伤害提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "机能",
			need = { 150, 150 },
			desc = { "移动速度提升", "开镜与切枪速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "后坐控制提升" },
		},
		['护甲'] = {
			name = "护甲",
			need = { 250, 250 },
			desc = { "快回轻型护甲", "重型护甲" },
		},
		['弦化'] = {
			name = "弦化",
			need = { 250, 250 },
			desc = { "弦化状态移速增加15%", "弦化减伤系数提至46%" },
		},
		['主动技能'] = {
			name = "重火倾泄",
			need = { 250, 250 },
			desc = { "机枪过热速度变慢", "护盾最大值提升" },
		},
		['被动技能'] = {
			name = "皇家盾牌",
			need = { 250, 250 },
			desc = { "护盾最大值提升", "护盾恢复增加100%" },
		},
		['技能觉醒'] = {
			ArousalUnlock = "",
			Active1Need = { 1, 1, 1 },
			Active2Need = { 3, 1, 1 },
			Active3Need = { 1, 2, 1 },
		},
	},
	['心夏'] = {
		Parts1 = {
			name = "核心",
			need = { 150, 150 },
			desc = { "拉栓速度提升", "蓄力速度提升" },
		},
		Parts2 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "移动速度提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "机能",
			need = { 150, 150 },
			desc = { "开镜速度提升", "切换快速高倍瞄具" },
		},
		['护甲'] = {
			name = "护甲",
			need = { 250, 250 },
			desc = { "快回轻型护甲", "重型护甲" },
		},
		['弦化'] = {
			name = "弦化",
			need = { 250, 250 },
			desc = { "弦化状态移速增加15%", "弦化减伤系数提至46%" },
		},
		['主动技能'] = {
			name = "治疗无人机",
			need = { 250, 250 },
			desc = { "每秒护甲恢复量增加2点", "每秒生命恢复量增加5点" },
		},
		['被动技能'] = {
			name = "急速救援",
			need = { 250, 250 },
			desc = { "提升救起生命值50点", "每秒生命恢复量增加2点" },
		},
		['技能觉醒'] = {
			ArousalUnlock = "",
			Active1Need = { 1, 1, 0 },
			Active2Need = { 1, 1, 2 },
			Active3Need = { 3, 1, 1 },
		},
	},
	['白墨'] = {
		Parts1 = {
			name = "核心",
			need = { 150, 150 },
			desc = { "全自动射击模式", "基础射速提升" },
		},
		Parts2 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "移动速度提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "开镜后弹丸收束" },
		},
		['护甲'] = {
			name = "护甲",
			need = { 250, 250 },
			desc = { "快回轻型护甲", "重型护甲" },
		},
		['弦化'] = {
			name = "弦化",
			need = { 250, 250 },
			desc = { "弦化状态移速增加15%", "弦化减伤系数提至46%" },
		},
		['主动技能'] = {
			name = "炫空斗舞",
			need = { 250, 250 },
			desc = { "冷却时间减少4秒", "自动上弹数翻倍" },
		},
		['被动技能'] = {
			name = "迅捷身法",
			need = { 250 },
			desc = { "持续时间增加1秒" },
		},
		['技能觉醒'] = {
			ArousalUnlock = "",
			Active1Need = { 1, 0, 1 },
			Active2Need = { 1, 2, 1 },
			Active3Need = { 1, 1, 2 },
		},
	},
	['令'] = {
		Parts1 = {
			name = "核心",
			need = { 150, 150 },
			desc = { "开镜速度提升", "基础射速提升" },
		},
		Parts2 = {
			name = "暴击",
			need = { 150, 150 },
			desc = { "爆头伤害提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "多重射击模式" },
		},
		['护甲'] = {
			name = "护甲",
			need = { 250, 250 },
			desc = { "快回轻型护甲", "重型护甲" },
		},
		['弦化'] = {
			name = "弦化",
			need = { 250, 250 },
			desc = { "弦化状态移速增加15%", "弦化减伤系数提至46%" },
		},
		['主动技能'] = {
			name = "破晓帷幕",
			need = { 250, 250 },
			desc = { "持续时间增加5秒", "冷却时间减少10秒" },
		},
		['被动技能'] = {
			name = "黎明洞悉",
			need = { 250 },
			desc = { "冷却时间减少1秒" },
		},
		['技能觉醒'] = {
			ArousalUnlock = "",
			Active1Need = { 1, 0, 1 },
			Active2Need = { 0, 2, 1 },
			Active3Need = { 3, 2, 0 },
		},
	},
	['伊薇特'] = {
		Parts1 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "基础伤害提升", "基础射速提升" },
		},
		Parts2 = {
			name = "暴击",
			need = { 150, 150 },
			desc = { "爆头伤害提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "操控",
			need = { 150, 150 },
			desc = { "移动速度提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "后坐控制提升" },
		},
		['护甲'] = {
			name = "护甲",
			need = { 250, 250 },
			desc = { "快回轻型护甲", "重型护甲" },
		},
		['弦化'] = {
			name = "弦化",
			need = { 250, 250 },
			desc = { "弦化状态移速增加15%", "弦化减伤系数提至46%" },
		},
		['主动技能'] = {
			name = "熊熊出击",
			need = { 250, 250 },
			desc = { "冷却时间减少10秒", "增加1次冲刺次数" },
		},
		['被动技能'] = {
			name = "皑皑藏雪",
			need = { 250 },
			desc = { "进入隐身加快66%" },
		},
		['技能觉醒'] = {
			ArousalUnlock = "",
			Active1Need = { 1, 0, 1 },
			Active2Need = { 0, 2, 2 },
			Active3Need = { 2, 2, 0 },
		},
	},
	['香奈美'] = {
		Parts1 = {
			name = "核心",
			need = { 150, 150 },
			desc = { "拉栓速度提升", "蓄力速度提升" },
		},
		Parts2 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "移动速度提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "机能",
			need = { 150, 150 },
			desc = { "开镜速度提升", "切换快速高倍瞄具" },
		},
		['护甲'] = {
			name = "护甲",
			need = { 250, 250 },
			desc = { "快回轻型护甲", "重型护甲" },
		},
		['弦化'] = {
			name = "弦化",
			need = { 250, 250 },
			desc = { "弦化状态移速增加15%", "弦化减伤系数提至46%" },
		},
		['主动技能'] = {
			name = "旋律回响",
			need = { 250, 250 },
			desc = { "冷却时间减少5秒", "音符血量增加50%" },
		},
		['被动技能'] = {
			name = "交响爆音",
			need = { 250 },
			desc = { "持续时间增加1秒" },
		},
		['技能觉醒'] = {
			ArousalUnlock = "",
			Active1Need = { 1, 1, 0 },
			Active2Need = { 1, 2, 1 },
			Active3Need = { 1, 1, 2 },
		},
	},
	['芙拉薇娅'] = {
		Parts1 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "基础伤害提升", "基础射速提升" },
		},
		Parts2 = {
			name = "暴击",
			need = { 150, 150 },
			desc = { "爆头伤害提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "后坐控制提升" },
		},
		['护甲'] = {
			name = "护甲",
			need = { 250, 250 },
			desc = { "快回轻型护甲", "重型护甲" },
		},
		['弦化'] = {
			name = "弦化",
			need = { 250, 250 },
			desc = { "弦化状态移速增加15%", "弦化减伤系数提至46%" },
		},
		['主动技能'] = {
			name = "致幻魅影",
			need = { 250, 250 },
			desc = { "冷却时间减少5秒", "致幻球生命值增加50%" },
		},
		['被动技能'] = {
			name = "周生复始",
			need = { 250 },
			desc = { "触发效果所需伤害量减少20%" },
		},
		['技能觉醒'] = {
			ArousalUnlock = "",
			Active1Need = { 1, 1, 0 },
			Active2Need = { 1, 1, 2 },
			Active3Need = { 1, 2, 1 },
		},
	},
	['艾卡'] = {
		Parts1 = {
			name = "核心",
			need = { 150, 150 },
			desc = { "双发扳机", "基础射速提升" },
		},
		Parts2 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "移动速度提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "开镜后弹丸收束" },
		},
		['护甲'] = {
			name = "护甲",
			need = { 250, 250 },
			desc = { "快回轻型护甲", "重型护甲" },
		},
		['弦化'] = {
			name = "弦化",
			need = { 250, 250 },
			desc = { "弦化状态移速增加15%", "弦化减伤系数提至46%" },
		},
		['主动技能'] = {
			name = "炼狱牢笼",
			need = { 250, 250 },
			desc = { "冷却时间减少5秒", "持续时间增加3秒" },
		},
		['被动技能'] = {
			name = "日珥蓄火",
			need = { 250 },
			desc = { "伤害转化热量比例提升50%" },
		},
		['技能觉醒'] = {
			ArousalUnlock = "",
			Active1Need = { 1, 0, 1 },
			Active2Need = { 1, 1, 2 },
			Active3Need = { 1, 2, 1 },
		},
	},
	['加拉蒂亚·利里'] = {
		Parts1 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "基础伤害提升", "基础射速提升" },
		},
		Parts2 = {
			name = "暴击",
			need = { 150, 150 },
			desc = { "爆头伤害提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "后坐控制提升" },
		},
		['护甲'] = {
			name = "护甲",
			need = { 250, 250 },
			desc = { "快回轻型护甲", "重型护甲" },
		},
		['弦化'] = {
			name = "弦化",
			need = { 250, 250 },
			desc = { "弦化状态移速增加15%", "弦化减伤系数提至46%" },
		},
		['主动技能'] = {
			name = "飞牌瞬闪",
			need = { 250, 250 },
			desc = { "冷却时间减少5秒", "假身存在时间增加3秒" },
		},
		['被动技能'] = {
			name = "欺诈牌影",
			need = { 250, 250 },
			desc = { "冷却时间减少5秒", "假身存在时间增加3秒" },
		},
		['技能觉醒'] = {
			ArousalUnlock = "",
			Active1Need = { 1, 0, 1 },
			Active2Need = { 1, 2, 1 },
			Active3Need = { 1, 1, 2 },
		},
	},
	['珐格兰丝'] = {
		Parts1 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "基础伤害提升", "基础射速提升" },
		},
		Parts2 = {
			name = "暴击",
			need = { 150, 150 },
			desc = { "爆头伤害提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "后坐控制提升" },
		},
		['护甲'] = {
			name = "护甲",
			need = { 250, 250 },
			desc = { "快回轻型护甲", "重型护甲" },
		},
		['弦化'] = {
			name = "弦化",
			need = { 250, 250 },
			desc = { "弦化状态移速增加15%", "弦化减伤系数提至46%" },
		},
		['主动技能'] = {
			name = "活力芬芳",
			need = { 250, 250 },
			desc = { "效果范围扩大50%", "持续时间增加4秒" },
		},
		['被动技能'] = {
			name = "复苏芳香",
			need = { 250, 250 },
			desc = { "效果范围扩大50%", "每秒生命恢复量增加2点" },
		},
		['技能觉醒'] = {
			ArousalUnlock = "",
			Active1Need = { 0, 1, 1 },
			Active2Need = { 1, 1, 2 },
			Active3Need = { 3, 1, 1 },
		},
	},
	['忧雾'] = {
		Parts1 = {
			name = "核心",
			need = { 150, 150 },
			desc = { "基础伤害提升", "基础射速提升" },
		},
		Parts2 = {
			name = "暴击",
			need = { 150, 150 },
			desc = { "爆头伤害提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "后坐控制提升" },
		},
		['护甲'] = {
			name = "护甲",
			need = { 250, 250 },
			desc = { "快回轻型护甲", "重型护甲" },
		},
		['弦化'] = {
			name = "弦化",
			need = { 250, 250 },
			desc = { "弦化状态移速增加15%", "弦化减伤系数提至46%" },
		},
		['主动技能'] = {
			name = "蚀甲毒雾",
			need = { 250, 250 },
			desc = { "冷却时间减少15秒", "减少能量消耗20%" },
		},
		['被动技能'] = {
			name = "毒雾爆发",
			need = { 250 },
			desc = { "减少触发所需伤害" },
		},
		['技能觉醒'] = {
			ArousalUnlock = "",
			Active1Need = { 0, 1, 1 },
			Active2Need = { 1, 1, 2 },
			Active3Need = { 3, 1, 1 },
		},
	},
	['蕾欧娜'] = {
		Parts1 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "加速射击模式", "基础射速提升" },
		},
		Parts2 = {
			name = "暴击",
			need = { 150, 150 },
			desc = { "爆头伤害提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "开镜与切枪速度提升" },
		},
		['护甲'] = {
			name = "护甲",
			need = { 250, 250 },
			desc = { "快回轻型护甲", "重型护甲" },
		},
		['弦化'] = {
			name = "弦化",
			need = { 250, 250 },
			desc = { "弦化状态移速增加15%", "弦化减伤系数提至46%" },
		},
		['主动技能'] = {
			name = "弦能掩墙",
			need = { 250, 250 },
			desc = { "方块生命值提升150点", "冷却时间减少10秒" },
		},
		['被动技能'] = {
			name = "劳逸结合",
			need = { 250, 250 },
			desc = { "加速与恢复效果提升50%", "能量恢复速度提升50%" },
		},
		['技能觉醒'] = {
			ArousalUnlock = "",
			Active1Need = { 1, 0, 1 },
			Active2Need = { 1, 2, 1 },
			Active3Need = { 3, 1, 1 },
		},
	},
	['玛拉'] = {
		Parts1 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "基础伤害提升", "基础射速提升" },
		},
		Parts2 = {
			name = "暴击",
			need = { 150, 150 },
			desc = { "爆头伤害提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "后坐控制提升" },
		},
		['护甲'] = {
			name = "护甲",
			need = { 250, 250 },
			desc = { "快回轻型护甲", "重型护甲" },
		},
		['弦化'] = {
			name = "弦化",
			need = { 250, 250 },
			desc = { "弦化状态移速增加15%", "弦化减伤系数提至46%" },
		},
		['主动技能'] = {
			name = "直击灵魂",
			need = { 250, 250 },
			desc = { "冷却时间减少5秒", "持续时间增加2秒" },
		},
		['被动技能'] = {
			name = "摄魂侵魄",
			need = { 250 },
			desc = { "回血比例提升50%" },
		},
		['技能觉醒'] = {
			ArousalUnlock = "",
			Active1Need = { 1, 1, 0 },
			Active2Need = { 1, 1, 2 },
			Active3Need = { 1, 2, 1 },
		},
	},
	['千代'] = {
		Parts1 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "基础伤害提升", "基础射速提升" },
		},
		Parts2 = {
			name = "暴击",
			need = { 150, 150 },
			desc = { "爆头伤害提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "后坐控制提升" },
		},
		['护甲'] = {
			name = "护甲",
			need = { 250, 250 },
			desc = { "快回轻型护甲", "重型护甲" },
		},
		['弦化'] = {
			name = "弦化",
			need = { 250, 250 },
			desc = { "弦化状态移速增加15%", "弦化减伤系数提至46%" },
		},
		['主动技能'] = {
			name = "爆绽瞬华",
			need = { 250, 250 },
			desc = { "冷却时间减少5秒", "伤害提升15点" },
		},
		['被动技能'] = {
			name = "静心凝势",
			need = { 250 },
			desc = { "冷却恢复速率提升50%" },
		},
		['技能觉醒'] = {
			ArousalUnlock = "",
			Active1Need = { 1, 1, 0 },
			Active2Need = { 1, 1, 2 },
			Active3Need = { 1, 2, 1 },
		},
	},
	['汐'] = {
		Parts1 = {
			name = "核心",
			need = { 150, 150 },
			desc = { "开镜与切枪速度提升", "基础射速提升" },
		},
		Parts2 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "移动速度提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "独头弹模式" },
		},
		['护甲'] = {
			name = "护甲",
			need = { 250, 250 },
			desc = { "快回轻型护甲", "重型护甲" },
		},
		['弦化'] = {
			name = "弦化",
			need = { 250, 250 },
			desc = { "弦化状态移速增加15%", "弦化减伤系数提至46%" },
		},
		['主动技能'] = {
			name = "机动护盾",
			need = { 250, 250 },
			desc = { "护盾充能速度加快20%", "护盾转化护甲比例提升50%" },
		},
		['被动技能'] = {
			name = "自驱机匣",
			need = { 250 },
			desc = { "装填时间减少0.8秒" },
		},
		['技能觉醒'] = {
			ArousalUnlock = "",
			Active1Need = { 1, 0, 1 },
			Active2Need = { 1, 1, 2 },
			Active3Need = { 1, 2, 1 },
		},
	},
	['诺诺'] = {
		Parts1 = {
			name = "核心",
			need = { 150, 150 },
			desc = { "基础伤害提升", "五连发射击模式" },
		},
		Parts2 = {
			name = "输出",
			need = { 150, 150 },
			desc = { "爆头伤害提升", "弦化伤害提升" },
		},
		Parts4 = {
			name = "续航",
			need = { 150, 150 },
			desc = { "载弹数量提升", "换弹速度提升" },
		},
		Parts5 = {
			name = "精准",
			need = { 150, 150 },
			desc = { "散射控制提升", "后坐控制提升" },
		},
		['护甲'] = {
			name = "护甲",
			need = { 250, 250 },
			desc = { "快回轻型护甲", "重型护甲" },
		},
		['弦化'] = {
			name = "弦化",
			need = { 250, 250 },
			desc = { "弦化状态移速增加15%", "弦化减伤系数提至46%" },
		},
		['主动技能'] = {
			name = "咒法！驭灵逐影",
			need = { 250, 250 },
			desc = { "冷却时间减少5秒", "伤害提升10点" },
		},
		['被动技能'] = {
			name = "咒法！踏空凌虚",
			need = { 250 },
			desc = { "冷却恢复速率提升50%" },
		},
		['技能觉醒'] = {
			ArousalUnlock = "",
			Active1Need = { 1, 0, 1 },
			Active2Need = { 1, 2, 1 },
			Active3Need = { 1, 1, 2 },
		},
	},
}
