return {
	{
		id = 0,
		name = "默认",
		quality = 0,
		desc = "默认",
	},
	{
		id = 90003,
		name = "淡定猫",
		quality = 3,
		desc = "淡定，你看猫的表情，猫在乎吗？",
	},
	{
		id = 90004,
		name = "抽象狗",
		quality = 3,
		desc = "这并非抽象，而是更加艰深的艺术！",
	},
	{
		id = 90005,
		name = "厨师狐",
		quality = 3,
		desc = "小小战斗场，十五位厨师长。",
	},
	{
		id = 90006,
		name = "甜心兔",
		quality = 3,
		desc = "只要是足够喜欢的帽子，再长的耳朵都不是问题~",
	},
	{
		id = 90007,
		name = "哈士奇",
		quality = 4,
		desc = "要么直视我充满智慧的眼神，要么为我的精彩表现点赞，选一个吧。",
	},
	{
		id = 90008,
		name = "杯面猫",
		quality = 4,
		desc = "猫不会轻易展露脆弱的一面，除非是面对倒在地上的杯面。",
	},
	{
		id = 90009,
		name = "听歌蛙",
		quality = 4,
		desc = "戴上耳机，这个世界与我无呱。",
	},
	{
		id = 90010,
		name = "纸箱猫",
		quality = 4,
		desc = "这只是个普通的纸箱，如果你从中感觉到猫的视线，此为幻觉！",
	},
	{
		id = 91111,
		name = "头套【炸弹】",
		quality = 3,
		desc = "在特殊模式中使用的伪装头套",
	},
	{
		id = 90012,
		name = "螂总冲刺",
		quality = 4,
		desc = "所有人，让我听见你们的尖叫声！",
	},
}
