return {
	['信'] = {
		['无泪王像'] = {
			id = 20108112,
			quality = 4,
			desc = "吟游的归鸟途径一座城市，那里有一位守望所有人的士兵，他公正且英勇，想要守护所有人的愿望。因他的存在，这座城市渐渐变得光明，哪怕代价是他身上斑驳的裂痕与创伤。<br /><br />【“我不需要愿望，但我可以守护别人的愿望。”】",
		},
	},
	['艾卡'] = {
		['蜜蕾烛谣'] = {
			id = 20119211,
			quality = 5,
			desc = "小魔女艾卡在吟游诗里最经典的形象，从摇曳的烛光中走出的少女，用可爱无辜的笑容和轻盈灵动的身影勾勒出愿望的雏形，向火光也向她许下愿望吧，倘若你诚恳地寻求帮助，小魔女一定会给你一个惊喜。<br /><br />【“嘻嘻，这样写的话，一定会有笨蛋想见我吧。”】<br /><br />“在很久很久以前，普雷顿是一个贫穷的村子。<br />贵族老爷们将白塔建在了远方的王都，这里的冬天特别难捱。<br />幸好村郊里住着个名叫艾卡的姑娘，一到最寒冷的时候，她总会出现，向人们兜售一种特别的火柴。<br />只是这个姑娘有个奇怪的规矩。她的生意里，一定要包含一个恼人的小把戏。<br />‘你是要这根金火柴，还是这根银火柴，还是这根打不着的坏火柴？’<br />穷人只能在目瞪口呆和头昏脑涨里，像呆头鹅一样买下那根坏火柴。<br />但恶作剧的小艾卡毫不在意众人的窃窃私语，反而对自己的恶作剧乐此不疲。<br />而将坏火柴带回家的穷人们发现，火柴不坏。<br />火焰带来温暖的房子，火焰带来美味的食物，火焰会赶走黑夜里的怪物。<br />火柴会燃起驱散寒冬的火焰，会升起填满整个房间的，希望的轻烟。<br />卖火柴的小艾卡，会带来幸福。<br />普雷顿的传说惊动了贵族老爷，他们要艾卡交出自己的宝物——金火柴和银火柴。<br />这个冬天，穷人们以为再也没有坏火柴的庇护。<br />可小艾卡来到镇子中间，划响了最后一根火柴。<br />“嘭”，火焰升腾出白塔的形状，温暖的屋子，美味的食物都不再是幻想。<br />‘他们想要金火柴和银火柴，我只好收下他们的愿望啦——除了金火柴和银火柴，他们什么都没有啦！’<br />穷人们欢呼着想要举起小艾卡，却发现那里只留下了一根点燃的火柴。<br />‘好啦，我的故事讲完啦，现在，你想要来根火柴吗？’<br />”",
		},
		['蜜蕾烛谣-雪女王'] = {
			id = 20119212,
			quality = 5,
		},
		['蜜蕾烛谣-小红帽'] = {
			id = 20119213,
			quality = 5,
		},
		['蜜蕾烛谣-灰姑娘'] = {
			id = 20119214,
			quality = 5,
		},
		['蜜蕾烛谣-花仙子'] = {
			id = 20119215,
			quality = 5,
		},
	},
	['忧雾'] = {
		['避世公主'] = {
			id = 20121110,
			quality = 4,
			desc = "远方诗歌里描述了一处幽居的森林，那里有位遭受磨难后逃离的公主，她被称作诅咒的化身，可诗歌的最后，旅人却在公主的帮助下走出了森林。<br /><br />【“虽然说不可以开门，但我想，真心付出的灵魂不会沾染厄运。”】",
		},
	},
}
