return {
	['明'] = {
		['胜意跃动'] = {
			id = 20132113,
			quality = 4,
			desc = "原本只是剪刀手内部组织的夜间放松游戏，但好胜心让游戏往不可控的竞赛一路狂奔。房间里此起彼伏的闷哼宛如战场，而被枕头痛击的败将，往往只来得及看见一个潇洒离去的身影。<br /><br />【“跟我比赛只有一个结果，倒头就睡！”】",
		},
	},
	['绯莎'] = {
		['萌鲨出动'] = {
			id = 20112116,
			quality = 4,
			desc = "除了海洋猎手之外，还有其他的鲨鱼形象吗？带着这样的疑问，绯莎偶遇了完·全·无·害的鲨鱼！这一次，真的变成粉色鲨鱼了呢！<br /><br />【“即便如此，也不要小看了我的行动力。”】",
		},
		['酷鲨巡游'] = {
			id = 20112117,
			quality = 4,
			desc = "当绯莎听说世界上还存在满是鲨鱼居住的小城，这位软萌的蓝色鲨鱼在她心中就成了素未谋面的老乡！穿上专门定制的主题服装，说不定有一天能潜入那里呢。<br /><br />【“我的伪装向来完美无缺。”】",
		},
	},
	['心夏'] = {
		['沫夏澄影'] = {
			id = 20124114,
			quality = 4,
			desc = "心夏在“梦想成为幻兽大师”主题活动执勤时穿着的服装，使用了少女钟爱的海兔作为契约的伙伴，轻快的行装装点着远行的愿望，虽然少女口口声声只是为了融入会场，但跳跃的耳朵似乎不这么想。<br /><br />【“我是海兔勇者，快快快，我的海马骑士和章鱼牧师伙伴在哪里！”】",
		},
	},
	['梅瑞狄斯'] = {
		['菘菁碧璋'] = {
			id = 20133115,
			quality = 4,
			desc = "梅瑞狄斯化身古老部落的祭司，身披太阳与飞鸟的章纹，带来真理与哲思跨越时空的传讯。即便过去的图腾已经消散，她将带领族人寻找新的明天。<br /><br />【“时空流转，唯真理永恒。”】",
		},
	},
	['星绘'] = {
		['谣星牧云'] = {
			id = 20146115,
			quality = 4,
			desc = "星绘在“梦想成为幻兽大师”主题活动当志愿者时穿着的服装，使用了柔软的云朵装饰少女美好的身影，虽然夜幕还未落下，但怀抱星星的少女手中的温柔，一定会给你一整天的舒心和惬意。<br /><br />【“星星不会说话，但它们邀请我为大家降下温柔的魔法。”】",
		},
	},
	['令'] = {
		['轻冷巧匠'] = {
			id = 20109112,
			quality = 4,
			desc = "火热的工坊实在不适合待客，善待友人的匠人稍加思索就想到了破解的方法，要给气氛和心情降温，想必要从自己开始，虽然他不理解为什么大家变得更加拘谨了。<br /><br />【“抱歉，工坊温度不能调低，但希望我的工服能让你感觉凉快一些。”】",
		},
	},
	['伊薇特'] = {
		['萌软心事'] = {
			id = 20131115,
			quality = 4,
			desc = "布置好房间里的一切，时针也才来到晚上八点，离睡衣派对开始还有两个小时。无事可做的伊薇特将脸埋进菲的怀抱里，紧张又期盼地等待着门铃响起。大家会对她举办的派对感到满意吗？<br /><br />【虽然很不擅长这些……但也想和伙伴们更亲近一点……】",
		},
	},
	['芙拉薇娅'] = {
		['惑世冥鳞'] = {
			id = 20115211,
			quality = 5,
			desc = "芙拉薇娅作为蛇灵圣女展现的身姿。古朴银饰点缀在蛇影之间，随着她的步伐摇曳。这并非单纯的装饰，而是惑人心神的一环。若是被她的目光捕捉，意志将会在灵蛇纠缠间顷刻溃散，脑海中只剩她的舞姿与眼眸。<br /><br />【“放下一切，与我一起享受此刻的沉沦吧。”】<br /><br />【叮铃、叮铃。<br />空灵的银铃声从密林深处传来，那是阳光也照不进的所在。<br />没有人会踏进这片瘴气弥漫的雨林，毒雾与沼泽足以让最有勇气的冒险者却步。<br />传说，密林之中曾有古老的部族，他们围绕在蛇灵圣女周围，惑乱人心的毒雾终年不散。<br />如今，古老的部族早已消失，故土的雨林里再无人烟。<br />可她就这样从毒雾中走来了。<br />曼陀罗的花香缠在蛇鳞摩擦之间，银饰叮当作响。<br />芙拉薇娅艳丽的面容在瘴气中若隐若现，如同枯骨上开出的红花。<br />此世无人能够逃得过如此诱惑。<br />但这并非心智不坚——你既察觉到她的存在，幻毒便早已深入骨髓，无法祛除。<br />这是一生只得一次的动摇。<br />放任逃离还是纠缠陷落，在她的意念之中没有区别。<br />“特殊之人，向来值得特殊的招待。”<br />“逃吧，直到我需要你再次回到我的身旁。”<br />于是，有人逃出了那片迷障。<br />叮铃、叮铃。<br />可那铃音分明还在回响，回响在生还者的耳旁。】",
		},
		['惑世冥鳞-迷蝶'] = {
			id = 20115212,
			quality = 5,
		},
		['惑世冥鳞-渊息'] = {
			id = 20115213,
			quality = 5,
		},
		['惑世冥鳞-锦素'] = {
			id = 20115214,
			quality = 5,
		},
		['惑世冥鳞-碧幽'] = {
			id = 20115215,
			quality = 5,
		},
	},
	['珐格兰丝'] = {
		['桑榆琼芳'] = {
			id = 20120112,
			quality = 4,
			desc = "珐格兰丝化身古老部落的医女。她从古方中获取灵感，将植物的芳华流转于指尖，化作治愈的良药，令远行的旅者不必担心伤痛，她能够治愈一切毒痈。<br /><br />【“从自然中汲取生命的力量，这便是治愈之术最本初的模样。”】",
		},
	},
}
