return {
	['米雪儿·李'] = {
		['喵喵搜查官'] = {
			id = 20101001,
			quality = 0,
			desc = "米雪儿将自己最喜欢的猫元素融入了制服之中，俏皮元气，也不失一位欧泊搜查官应有的干练。",
		},
		['喵喵搜查官-欢欣蓝'] = {
			id = 20101006,
			quality = 2,
			desc = "米雪儿的备用搜查官制服。清澈的湖蓝色调，宛如薄荷般清新。",
		},
		['喵喵搜查官-活力青'] = {
			id = 20101007,
			quality = 2,
			desc = "米雪儿的备用搜查官制服。碧绿如春草，生机勃勃。",
		},
		['喵喵搜查官-沉稳褐'] = {
			id = 20101008,
			quality = 2,
			desc = "米雪儿的备用搜查官制服。微染的卡其色，朴素且耐用。",
		},
		['喵喵搜查官-悸动粉'] = {
			id = 20101009,
			quality = 2,
			desc = "米雪儿的备用搜查官制服。明媚的粉，象征少女心中微微的悸动。",
		},
		['喵喵搜查官-梦幻紫'] = {
			id = 20101010,
			quality = 2,
			desc = "米雪儿的备用搜查官制服。神秘的紫色，如梦似幻。",
		},
		['喵喵搜查官-安全黄'] = {
			id = 20101011,
			quality = 2,
			desc = "米雪儿的备用搜查官制服。工业风格，给人可靠与实用之感。",
		},
		['喵喵搜查官-沉静蓝'] = {
			id = 20101012,
			quality = 2,
			desc = "米雪儿的备用搜查官制服。淡淡的灰蓝色，沉着而冷静。",
		},
		['喵喵搜查官-胭脂红'] = {
			id = 20101013,
			quality = 2,
			desc = "米雪儿的备用搜查官制服，偏灰的暗红，可以蒙混成剪刀手的人。",
		},
		['喵喵搜查官-俏皮堇'] = {
			id = 20101014,
			quality = 2,
			desc = "米雪儿的备用搜查官制服。俏皮的紫色让人忍不住心情爽朗。",
		},
		['海湾疾驰'] = {
			id = 20101051,
			quality = 3,
			desc = "为了参与欧拉港口摩托艇大赛，米雪儿兴致冲冲地为自己定制了一套比赛用服。<br />三、二、一……比赛开始！",
		},
		['贺夜踏歌'] = {
			id = 20101052,
			quality = 3,
			desc = "每逢节日庆贺，米雪儿都要穿上这身衣服，朝气蓬勃的配色搭配喜庆的图案，就连空气都变得火热起来了！",
		},
		['暴雨预警'] = {
			id = 20101053,
			quality = 3,
			desc = "每当欧泊的道路因天气原因阻塞时，米雪儿都会义不容辞，主动奔赴一线。身穿防水服，腰佩警示牌的她，已然成为了一道雨中的风景。",
		},
		['竹下斑猫'] = {
			id = 20101054,
			quality = 3,
			desc = "闲暇时，米雪儿偶尔会去野外远足。那时的她，就会换上这套闲适的便装。小心，可别把她当成了竹林里的小野猫哦。",
		},
		['桃心卫士'] = {
			id = 20101055,
			quality = 3,
			desc = "桃红色的装扮，充满童话色彩。穿上这身衣服的米雪儿会和喵喵卫士一起守护孩子们梦中的童话王国。",
		},
		['正义搜查官'] = {
			id = 20101056,
			quality = 3,
			desc = "坚守公平与正义，是每个搜查官都应遵守的行为准则。米雪儿坚信，自己一定能将这条准则贯彻到底。",
		},
		['时下热潮'] = {
			id = 20101057,
			quality = 3,
			desc = "以最近在卡丘世界火热的文化形象为参考设计的制服。为了追赶潮流，甚至将“POP”直接印染在了自己的领带上。<br /><br />【“当下的潮流，是惩恶扬善！”】",
		},
		['盗垒猫'] = {
			id = 20101101,
			quality = 4,
			desc = "一套帅气的棒球运动服，加上俏皮的猫耳与猫尾。穿在米雪儿身上，这套装束显得俊敏利落，令人印象深刻。<br /><br />【“盗！盗！盗！让我找个机会盗垒！”<br />棒球场外加油声震云霄，棒球场内的米雪儿正向二垒飞奔。<br />不仅是游戏高手，米雪儿的运动水准也不可小觑。<br />飘洒的汗水，明亮的笑容，交织出棒球场上一道靓丽的风景线。】",
		},
		['牧场物语'] = {
			id = 20101103,
			quality = 4,
			desc = "米雪儿为田园旅行特别设计的服装，为了方便和动物朋友们接触，特地加上了可爱的围裙。住进充满田园气息的小屋，嗅闻清新凉爽的空气，身边有好友相伴，或许，这就是返璞归真的快乐吧。<br /><br />【“在星绘回来前，得把在外望风的小家伙都找回来。等等，鹦鹉少了一只？！怎么办怎么办！”】",
		},
		['炼狱恶魔'] = {
			id = 20101105,
			quality = 4,
			desc = "与平时令行禁止的米雪儿截然不同，宛如童话中走出的调皮恶魔。<br /><br />【咚咚的敲门声响起。<br />“开门开门~我是来自地底的米雪儿搜查官，今天可要好好检查一番你的零食储备哦！”<br />总觉得，换上这套衣服的米雪儿，比平时更加开心了。<br />但她毕竟是米雪儿嘛，大概，不会有什么问题吧。】",
		},
		['甜点美梦'] = {
			id = 20101106,
			quality = 4,
			desc = "米雪儿在糖果屋帮忙时穿着的工作服。新开张的游乐园人潮汹涌，为了防止意外，米雪儿以打工的名义主动潜入了游乐园的糖果屋。<br />此时，一名剪刀手成员的身影出现在人群之中，这让米雪儿偷偷捏了一把汗。可是，短暂的眼神交错后，两人都心照不宣地忽视了对方——这是因为，她们都看到对方的脸上洋溢着幸福的笑容。<br /><br />【如果这是一场短暂的美梦，真希望这个梦能永远延续下去。】",
		},
		['踏浪远航'] = {
			id = 20101107,
			quality = 4,
			desc = "蓝白色调的海军作战服，充分考虑了米雪儿个人的战斗风格，配备了实时通讯器与可爱的求生背包。<br />迎着海风，米雪儿的表情也变得更加明亮。<br /><br />【“拔锚起航！希望你不会晕船，嘿嘿。”】",
		},
		['麻雀东风'] = {
			id = 20101108,
			quality = 4,
			desc = "对不谙此道之人而言，或许只是一套绘制了麻雀图案与神秘东方文字的街头装扮，但对米雪儿而言这可是一件能带来好运的战衣。<br />米雪儿所涉猎的可不只有电子游戏，古早的桌面娱乐当然也难不住超级玩家米雪儿。<br /><br />【“打牌呢，最重要的就是开心。这把输了，下次再来！”】",
		},
		['踏雪飞猫'] = {
			id = 20101109,
			quality = 4,
			desc = "米雪儿参加荒野冬日挑战赛使用的滑雪服，厚实的棉绒外套搭配做成雪豹花纹的装饰毛边，在突出了可爱的同时，一如既往地能够表现出少女的活力感。<br /><br />【“来呀，跟上我的速度啊？”】",
		},
		['玩家志愿'] = {
			id = 20101110,
			quality = 4,
			desc = "米雪儿的校园日活动服装，轻巧的随身背包装着打开即玩的电玩社自制游戏，穿戴的各种可爱配饰凸显着她游戏玩家的身份。<br /><br />【“游戏和学习不会冲突，因为超级玩家就是会在其中投入百分之百的热情！”】",
		},
		['灵猫竞影'] = {
			id = 20101111,
			quality = 4,
			desc = "米雪儿在搜查官射击竞赛中穿着的定制服装。为了让整体装束兼顾舒适度与时尚感，特别采用了轻盈透气的布料和立体裁剪的工艺，亲自参与设计的少女将其视为近期的得意之作。<br /><br />【“装备是竞技的重要环节，游戏的胜利，源自从细节开始的优势堆叠！”】",
		},
		['金玲报春'] = {
			id = 20101112,
			quality = 4,
			desc = "米雪儿为沐春节烟花庆典而准备的服装，鲜艳的衣裙映衬着佳节良宵的热闹气氛，摇晃的金铃仿佛在预告着新春的到来。<br /><br />【“铃铃铃，还等什么？烟花庆典马上就要开始咯！”】",
		},
		['音浪节拍'] = {
			id = 20101113,
			quality = 4,
			desc = "米雪儿作为志愿者代表，受邀参加泳池派对时穿着的服装。为了能在泳池中无所顾忌地畅玩，她特意做了利落可爱的编发造型，还买了菠萝墨镜进行搭配。<br /><br />【“嘿嘿，平时多做好事还是很有必要的，居然能拿到泳池派对的体验票~这次水枪大战，你们就等着被本游戏高手逐个击破吧！”】",
		},
		['迅捷身影'] = {
			id = 20101114,
			quality = 4,
			desc = "在校运动会跑步比赛中出战的选手是——米雪儿！比赛开始了，米雪儿稳稳保持在队伍的最前列！她放慢了脚步，是要调整节奏吗？等等，怎么还离开跑道了？其他赛场的纠纷不需要选手来处理啊！<br /><br />【“哇啊啊啊对不起，一看到别人发生争执就想去调解，我马上回来继续跑！”】",
		},
		['王牌投手'] = {
			id = 20101115,
			quality = 4,
			desc = "作为对米雪儿棒球技术飞速进步的奖励，球队教练为她定制了一套新的棒球服。红黑配色简约时尚，和旧版制服相比，气质更加稳重。<br /><br />【“既然都把我称为‘王牌投手’了，可得在赛场上拿出点真本事才行呀。放心~猫儿的节奏感和控制力一向很好！”】",
		},
		['战火印记'] = {
			id = 20101116,
			quality = 4,
			desc = "米雪儿在卡奥斯圣殿战役中穿着的战斗服。纯白的罗马式装束上，古老纹饰与紫色缎带相互点缀，尽显神圣庄严。其残破的衣角与遍布的灰烬，正是她身陷重围、与晶源体搏杀的战火印记。<br /><br />【“弦裂的伤痕，或许就是我们浴血奋战的勋章。”】",
		},
		['喵萌元气'] = {
			id = 20101201,
			quality = 6,
			desc = "米雪儿精心搭配的一套休闲装，只为了和你共享美好惬意的猫猫时光。<br /><br />【作为超级玩家的米雪儿拥有诸多休闲帅气的衣服，但作为一个撸猫客，她最喜欢的还是这一套萌喵风格的穿搭，不光是因为理想的舒适度或是贴近猫咪的可爱配色。<br />“猫露出肚皮是安全和友好的证明。”少女笑嘻嘻地说道。<br />卸下了玩家的酷炫，换上一身元气活泼的少女装扮，是否意味着，这个猫一般的女孩在传达着什么呢？】",
		},
		['猎虎裁恶'] = {
			id = 20101206,
			quality = 5,
			desc = "欧泊提供的特种作战服装。由米雪儿父亲的作战服改造而成，威风凛凛的白虎足以震慑一切犯罪分子。<br /><br />【成为一线搜查官的米雪儿继承了上一代的意志，当一个警号重启的时候，那些可悲的罪犯应当颤抖，因为继承白虎意志的人，会将他们全部击溃，一个不留。<br />“里面的人给我听好了，你们已经被我一个人包围了！速速投降！”——米雪儿在行动中如此威吓着。<br />后来，她确实做到了这一点，仅凭一人将十余名犯罪分子尽数逮捕。<br />“我还以为看不到明天的太阳了，那小妮子是要吃人吗？”——犯罪分子筛糠一样颤抖地回忆着。】",
		},
		['猎虎裁恶-威风'] = {
			id = 20101207,
			quality = 5,
		},
		['猎虎裁恶-恶战'] = {
			id = 20101208,
			quality = 5,
		},
		['猎虎裁恶-猎手'] = {
			id = 20101209,
			quality = 5,
		},
		['猎虎裁恶-迅影'] = {
			id = 20101210,
			quality = 5,
		},
		['绮星梦使'] = {
			id = 20101211,
			quality = 5,
			desc = "与“世界之梦”签订契约的魔法少女米雪儿的战斗服，她的裙裾，闪耀着希望之光；她的冠冕，盘旋着梦想之环。魔法从未赐予她勇气，而是因为勇气，她拥有了世界的祝福。<br /><br />【“能让我所在的世界变得幸福，这就是我成为魔法少女的全部意义。”】<br /><br />【成为魔法少女的契机有很多，突然出现的神兽，古老仪式的召唤，机动装置的合体……<br />但化身魔法少女的理由只有一个：守护希望。<br />当知道这个世界被魔龙的阴影笼罩了无数个轮回的那一刻，米雪儿就坚定了自己的愿望。<br />她要成为终结这场浩劫的魔法少女，赌上自己的命运。<br />以及超级玩家的名誉。<br />或许是因为启航点平民无助的叹息，或许是旅途中勇者弥留的绝笔，让这场冒险不再是游戏，而是一段拯救世界的传奇。<br />或许也是从那一刻开始，她通晓了魔法的秘密，也因此成为了沐浴梦幻的魔法少女。<br />是因为有趣吗？是因为沉浸吗？还是因为，她无法容忍面对灾难却没有作为的自己？<br />她当然知道，这只是一场虚拟世界的游戏。<br />但哪怕是游戏，她也想要贯彻自己选择的爱与正义。】",
		},
		['绮星梦使-霞云'] = {
			id = 20101212,
			quality = 5,
		},
		['绮星梦使-花澈'] = {
			id = 20101213,
			quality = 5,
		},
		['绮星梦使-幽砂'] = {
			id = 20101214,
			quality = 5,
		},
		['绮星梦使-橙荧'] = {
			id = 20101215,
			quality = 5,
		},
	},
	['奥黛丽·格罗夫'] = {
		['追耀'] = {
			id = 20105001,
			quality = 0,
			desc = "奥黛丽亲手设计的佣兵作战服。喜好华丽的她，将母亲所授的贵族审美完美融入其中。",
		},
		['追耀-青山'] = {
			id = 20105002,
			quality = 2,
			desc = "奥黛丽佣兵服的换色款。永不改变的，是她如青山般坚定的意志。",
		},
		['追耀-紫荆'] = {
			id = 20105005,
			quality = 2,
			desc = "奥黛丽佣兵服的换色款。高贵的气度，无需华丽的陪衬。",
		},
		['追耀-密语'] = {
			id = 20105006,
			quality = 2,
			desc = "奥黛丽佣兵服的换色款。朴素的装扮下，似有暗流涌动。",
		},
		['追耀-牧野'] = {
			id = 20105007,
			quality = 2,
			desc = "奥黛丽佣兵服的换色款。藏于她梦中的，是那片碧绿的原野。",
		},
		['追耀-深洋'] = {
			id = 20105008,
			quality = 2,
			desc = "奥黛丽佣兵服的换色款。她的目光所及，是广袤的大海。",
		},
		['追耀-血裔'] = {
			id = 20105009,
			quality = 2,
			desc = "奥黛丽佣兵服的换色款。她心中铭记的，是家族血脉的荣光。",
		},
		['追耀-绛紫'] = {
			id = 20105010,
			quality = 2,
			desc = "奥黛丽佣兵服的换色款。华贵而不张扬，彰显着坚韧的意志。",
		},
		['追耀-红烛'] = {
			id = 20105011,
			quality = 2,
			desc = "奥黛丽佣兵服的换色款，颇具威胁感的配色，宛如枪口闪烁的火焰。",
		},
		['热可可'] = {
			id = 20105051,
			quality = 3,
			desc = "奥黛丽亲自对自己的佣兵服进行了整体风格再设计，设计灵感则源自于她当日中午喝下的热可可咖啡。",
		},
		['海滨漫步'] = {
			id = 20105052,
			quality = 3,
			desc = "漫步于海边时，奥黛丽会换上这套可爱的裙装。只有这时，她才会愿意展现出稚嫩的少女一面。",
		},
		['王牌登场'] = {
			id = 20105053,
			quality = 3,
			desc = "以扑克为主题设计的高雅装束。红心、方片、黑桃，还有梅花……王牌去哪了？当然，是奥黛丽自己了。",
		},
		['豪族夜宴'] = {
			id = 20105054,
			quality = 3,
			desc = "典雅的蓝色裙装，华贵的金色纹饰，是奥黛丽出席正式场合的礼服。身为格罗夫的代言人，对奥黛丽来说，社交场不过是换了个战场。",
		},
		['春日特调'] = {
			id = 20105055,
			quality = 3,
			desc = "红茶与樱花的冲撞，混合出一抹独特的春日韵味。穿着这身衣服时，奥黛丽的心情也似乎随着时节而轻快了起来。",
		},
		['暗夜贵族'] = {
			id = 20105056,
			quality = 3,
			desc = "城墙，塔垛，闸门，谈到古典城堡的设计，那正是奥黛丽精通的领域。为了考察这套地产的潜力，奥黛丽也换上了全新的服饰。<br /><br />“给我介绍一下吧，本小姐正好想要购买一座新别馆呢。”",
		},
		['心想是橙'] = {
			id = 20105057,
			quality = 3,
			desc = "香橙与柠檬能够治疗坏血病，这是早期格罗夫家族发迹的途径之一，但要治愈新世界人们的心病，可能还需要一些火药作为添加剂。",
		},
		['尊享服务'] = {
			id = 20105101,
			quality = 4,
			desc = "回味时光咖啡厅领班所穿着的女仆装。根据奥黛丽的趣味进行了部分改制。<br />即便是穿上这身衣服的奥黛丽，依旧掩盖不了身为领袖精英的气质。<br /><br />【“想看就看个够吧！不、不过新品的咖啡，还是得务必品尝一下……哦？”】",
		},
		['风舞碧云'] = {
			id = 20105103,
			quality = 4,
			desc = "少女的身姿如玉柳琼枝，古雅的纱衣随风飘摆。身着古典舞者服饰的奥黛丽，一颦一笑间，都透出难言的异域风情。<br /><br />【琴奏龙门之绿桐，玉壶美酒清若空。<br />催弦拂柱与君饮，看朱成碧颜始红。<br />胡姬貌如花，当垆笑春风。<br />笑春风，舞罗衣，君今不醉欲安归？】",
		},
		['绯红守护'] = {
			id = 20105104,
			quality = 4,
			desc = "奥黛丽的服装设计师所还原的东方女性服装。<br />据说穿着这身衣服的人只要虔心祈祷，就能获得祛除灾厄的神秘力量。<br /><br />【“我不会向谁祈祷。但如果……是在你身边的话，我就有打破任何灾厄的力量……从物理的角度上来讲。”】",
		},
		['现场直击'] = {
			id = 20105105,
			quality = 4,
			desc = "奥黛丽在参加真实荒野勘探过程中所穿着的服装。透气性好，轻便舒适，遮阳帽为实地考察带来了不少便利。<br />便携相机包内的相机，更是储存着名为未来的愿景。<br /><br />【“亲自考察对于接下来和欧泊的合作的新开发区很重要，这些照片会见证新的都会兴起。”】",
		},
		['夜会蝶舞'] = {
			id = 20105108,
			quality = 4,
			desc = "酒杯交错、舞裙翩跹的会场上，宴会的主角却姗姗来迟，她褪去了独角兽的桀骜不驯，一袭深色华美的晚礼服完美裹身。她款款走向自己心仪的舞伴，舞裙随之摆动，宛若舒展羽翼的夜光蝶。<br /><br />【“抱歉盟友，为了挑选足够与你相称的礼服，稍微花了点时间。”】",
		},
		['霞裙月帔'] = {
			id = 20105109,
			quality = 4,
			desc = "奥黛丽出席沐春节家族晚宴中的服装。以霞为衣裙，以月为披肩，既彰显着端庄华美，又不失少女的风韵。<br /><br />【“盟友，请随便坐吧，你可是格罗夫家宴的特邀嘉宾哦。”】",
		},
		['郁香丽人'] = {
			id = 20105110,
			quality = 4,
			desc = "奥黛丽的定制工作装。作为奥黛丽出席重要场合的服装充满了严肃性和时尚感，这一版型后来成为了纽特朗城中都市丽人们竞相模仿的对象。<br /><br />【“下一个决议还在等着我，我赶时间。”】",
		},
		['霓光夕绽'] = {
			id = 20105112,
			quality = 4,
			desc = "星帷伴着缭乱的虹光，浸染了这座城市的第一千零一个夜晚，出逃的少女紧束自己的长发，用明媚的笑意点亮无尽的长廊——那是海的彼岸，天的尽头，是追寻万遍也不愿舍弃，跨越时空的梦想。<br /><br />【“就让我们一同启程吧，高塔不是终点，故事将会继续上演！”】",
		},
		['金牌店员'] = {
			id = 20105113,
			quality = 4,
			desc = "在格罗夫餐厅试营业第一天，为了保证经营顺利，奥黛丽化身招牌店员亲自上阵。但由于生意过于火爆，忙碌过头的她只好将小票账单暂时挂在腰间。<br /><br />【“客人，如不需要小票，请不要一直盯着我的身后。”】",
		},
		['荣誉会长'] = {
			id = 20105114,
			quality = 4,
			desc = "副会长奥黛丽同学在重大活动时才会穿着的高定制服，融合了家徽的设计，同时彰显着学校的风姿与家族的高雅。<br /><br />【“会长？不，我不是，不过这身制服确实是大家眼中学生会的象征。”】",
		},
		['黯月遗狩'] = {
			id = 20105115,
			quality = 4,
			desc = "“溯光者”奥黛丽的战服，古老猎装承载着家族纹章，优雅羽饰彰显着战斗礼仪。身披月光的猎人将踏入无尽的旅途，跟随荆棘的指引，猎杀黑暗。<br /><br />【“请勇往直前，提灯里的月光，会引导我们穿越旧日的黑暗。”】",
		},
		['星夜舞步'] = {
			id = 20105116,
			quality = 4,
			desc = "觥筹交错的宴会上，奥黛丽以一身湛蓝裙装翩然入场。裙摆如夜空中的群星一般璀璨，却不刺眼。衣着如同她本身的品格——优雅而克制。让她成为众人焦点的并非绚烂的华服，而是那非同一般的气度。<br /><br />【“保持低调，我希望这是一个放松的夜晚。”】",
		},
		['岚彩骄阳'] = {
			id = 20105117,
			quality = 4,
			desc = "为嘉年华应援分会场准备的主题应援服，融合了乌尔比诺最新的闪亮设计，让平日端庄肃穆的大小姐表现出自己活泼亮丽的一面，但更重要的是大小姐藏在心里的愿望，希望以后的每一天，都能给这个世界带来明媚的好天气。<br /><br />【“今日微风不燥，晴空正好，希望未来如此，永不变迁。”】",
		},
		['荣光小憩'] = {
			id = 20105201,
			quality = 6,
			desc = "奥黛丽度假时穿着的休闲服饰。偶尔，她会穿起这件雅致的裙装，和你一起享受难得的假日。<br /><br />【一支小提琴曲结束，奥黛丽坐到了你的身边。<br />“怎么，在我面前，还摆出一副闷闷不乐的样子。”<br />“你在担忧什么？是我们眼前面对的考验，还是必将到来的崩溃？”<br />她从茶壶里斟出了两杯红茶，将一杯放在了你的面前。<br />“抛下那些烦恼吧，让我们敬一杯苦难，再敬一杯……这个世界。”<br />茶杯轻触，发出清脆的声响。少女的唇角，绽放出一抹自信的笑容。】",
		},
		['末路荣光'] = {
			id = 20105206,
			quality = 5,
			desc = "以纯白百合花为原型的格罗夫礼服。搭配有代表格罗夫家族威严与荣耀的单肩披风，记录着少女过去初次肩负家族责任时的青涩与沉重。<br /><br />【据说在格罗夫的大厦将倾之时，是刚成人的奥黛丽独自肩负起了最后的荣光，礼服的名字由此而来。<br />在最后一张旧照片中的她武装整齐，却披着一张被烧毁的披风。那天她第一次拿起枪。<br />“铁水浇筑王座，硝石铭刻荣光……过去的我就是这样的风格吗？”<br />“您一直如此。”管家答道。<br />如今身为格罗夫家主的奥黛丽反复翻看着这些旧照片中的自己。<br />照片上的她与自己是同一个人吗？这套礼服的名字会是对家族未来的预言吗？<br />在与照片上的自己互相对视时，对方似乎也在和自己一样，期盼着答案。】",
		},
		['末路荣光-夜色'] = {
			id = 20105207,
			quality = 5,
		},
		['末路荣光-玫瑰'] = {
			id = 20105208,
			quality = 5,
		},
		['末路荣光-深海'] = {
			id = 20105209,
			quality = 5,
		},
		['末路荣光-王冠'] = {
			id = 20105210,
			quality = 5,
		},
	},
	['明'] = {
		['叛逆'] = {
			id = 20132001,
			quality = 0,
			desc = "明的作战服。看似随性的搭配里兼顾了实用和美观，无论是战斗还是日常都能完美应付。",
		},
		['叛逆-烈日'] = {
			id = 20132002,
			quality = 2,
			desc = "明的备用作战服。鲜亮的黄色上衣，衬得她如太阳般耀眼。",
		},
		['叛逆-苍岭'] = {
			id = 20132003,
			quality = 2,
			desc = "明的备用作战服。那片碧绿，就如她奋力追逐的梦境般美丽。",
		},
		['叛逆-碧水'] = {
			id = 20132004,
			quality = 2,
			desc = "明的备用作战服。她的内心，就如故土中明净的湖水般清澈。",
		},
		['叛逆-暮色'] = {
			id = 20132005,
			quality = 2,
			desc = "明的备用作战服。尽管性格豪迈，但她也不介意潜藏于夜色之内。",
		},
		['叛逆-夕阳'] = {
			id = 20132006,
			quality = 2,
			desc = "明的备用作战服。以橙红为主色调，如同落日的余晖。",
		},
		['叛逆-深空'] = {
			id = 20132007,
			quality = 2,
			desc = "明的备用作战服。那片高远的深蓝，正如她高远的志向。",
		},
		['叛逆-紫霞'] = {
			id = 20132008,
			quality = 2,
			desc = "明的备用作战服。浅紫色的上衣，如同天边的云霞。",
		},
		['叛逆-天青'] = {
			id = 20132009,
			quality = 2,
			desc = "明的备用作战服。她追逐的，是那故乡头顶的蓝天。",
		},
		['黎明射击'] = {
			id = 20132051,
			quality = 3,
			desc = "身着纯白，火红与烫金交织的作战服，此时的明如同呼唤圣火，惩罚罪行的使者。射击，而后燃烧，直到真正的黎明到来。",
		},
		['款冬协奏'] = {
			id = 20132052,
			quality = 3,
			desc = "碧绿上衣如叶，橙黄下装如花，明就如同一朵象征自由的款冬。她誓言，饥饿与压迫将不复存在，款冬花将重新盛开在这片大地上。",
		},
		['长空飞鹰'] = {
			id = 20132053,
			quality = 3,
			desc = "黑蓝相间，饰以闪电与鹰徽的作战服。明的双眼，也宛如鹰隼一般锐利。在她身上，这套服装衬出一股危险慑人的气质。",
		},
		['野苹鹿鸣'] = {
			id = 20132054,
			quality = 3,
			desc = "装饰以鹿角纹饰，飒爽的野外服装。在荒野漫步之时，明常身着这套装束出行。一边回忆着生机勃勃的故土，一边燃烧起新的斗志。",
		},
		['极速蓝风'] = {
			id = 20132055,
			quality = 3,
			desc = "明参加赛车比赛时的装束。着装融入了她所喜爱的酷炫的赛车元素，驰骋在竞速场时，她的身影化作一道蓝色的疾风，变为赛场上最迅猛的存在。",
		},
		['夜魇之影'] = {
			id = 20132056,
			quality = 3,
			desc = "靴跟敲打着石砖发出短促的声音，前行者仿佛全然不受这阴森诡谲的氛围影响，脚步稳重且有力。在明的认知中，她既然已经来了，那么她才是座城堡的主宰者。",
		},
		['逐夜之火'] = {
			id = 20132101,
			quality = 4,
			desc = "适合于夜间行动的黑色衣装。原本应该完美地融入黑夜，但在明的要求下加上了一抹暗红，如同静静燃烧的火焰，虽不耀眼，但绝不屈服。她将追逐黑夜，并将驱逐黑夜。<br /><br />【“乖宝宝们早点回家去吧——夜晚，是我的战场。”】",
		},
		['高效协同'] = {
			id = 20132102,
			quality = 4,
			desc = "黑红色调的紧身作战服，融合了科技感与复古感。冷酷刚硬的外观，也藏不住明灵魂深处的火热。<br /><br />【“别搞破坏，我可没时间处理你们制造出的垃圾。”<br />“如果你们想活下来，就听我的！明白吗?”】<br />在明的指挥下，每次攻击行动，都如手术刀般锐利。<br />但她并非为了遥远的理想，而是为了生存，还有心中的愤怒而战。",
		},
		['沙滩牛仔'] = {
			id = 20132103,
			quality = 4,
			desc = "沙滩与海浪，音乐和舞蹈，作为战士的休憩来说正合明的心意。短暂的欢乐时光，为的是之后更加勇猛的战斗。<br /><br />【“这个海滩还不错嘛，终于可以休息一下了。”<br />来到此地，明也久违地露出了一抹爽朗的笑容。<br />“今日，我们纵情欢歌！明日，我们并肩战斗！”<br />也不知，今晚她会灌醉几个伙伴呢？】",
		},
		['西部往事'] = {
			id = 20132104,
			quality = 4,
			desc = "粗犷潇洒的牛仔装束。凝聚了牛仔对自由与冒险的向往，每每想到这里，明便会欢快地吹起口哨。<br /><br />【“来吧，让我们一起干一票大的！”】",
		},
		['九黎长风'] = {
			id = 20132105,
			quality = 4,
			desc = "极具特色的民族服饰，根据明的作战风格进行了现代剪裁的改良。<br />穿着大量的银饰出现在战场上，既显眼又吵闹，十分引人注目。但这也许正是明所需要的。<br /><br />【“这就是战神后裔的衣着吗？古老的反抗者，就让我借用他的力量吧。”】",
		},
		['闪电风暴'] = {
			id = 20132106,
			quality = 4,
			desc = "明受邀前往月桂大厅演出的修身模特服。为了便于进行那场特殊表演，明省略了衣着上繁芜的装饰，几乎每一寸布料都紧密贴合肌肤。<br /><br />【“如果反抗是实现正义的唯一方式，那么，我不介意使用一些特殊手段。”】",
		},
		['飒踏元辰'] = {
			id = 20132107,
			quality = 4,
			desc = "明在沐春节之夜出街游玩时穿着的服装。一袭红衣，英姿飒爽，颇有一番女侠风范。<br /><br />【“别误会了，本女侠不是来行侠仗义，而是来吃香喝辣的！”】",
		},
		['喧响番长'] = {
			id = 20132108,
			quality = 4,
			desc = "轻音部首席吉他手明的校园日对外演出定制款，这套服饰采用绚丽的纹饰搭配着复古的样式，在整体造型上显得个性十足。<br /><br />【“准备好了吗？一起燃响天下无双的旋律吧！”】",
		},
		['黄金工匠'] = {
			id = 20132109,
			quality = 4,
			desc = "伴随着蒸汽时代的到来，人们探索的脚步终于可以涉足更远的地方。深埋地底的矿藏代表着财富和机遇，也吸引了一批批冒险者前来探访。<br /><br />【“放心吧，只要跟紧我，咱们一定是第一批找到金子的人！”】",
		},
		['混酿赤霞珠'] = {
			id = 20132110,
			quality = 4,
			desc = "出现在家族宴会上的神秘来客，英姿飒爽，潇洒不羁，虽然并没有透露自己的姓名，却有不少人对她相当面熟。<br /><br />【“好久不回来了，这里的人和地方都还是老样子嘛。”】",
		},
		['星驱疾霆'] = {
			id = 20132111,
			quality = 4,
			desc = "战士行于夜色，却不屑于躲躲藏藏，她将耀目的紫色涂做战装，宣告着自己将如雷霆如流星，击碎每一处她所经过的战场。<br /><br />【“准备好了吗，接下来的曲目是决斗，就我和你。”】",
		},
		['当头红鹿'] = {
			id = 20132112,
			quality = 4,
			desc = "今夜属于欢乐，今夜属于每一个期待幸福的人民，等待礼物的烟囱绵延出漫天的云路，但背负着礼物与美梦的驯鹿小姐不知疲倦，不觉漫长。<br /><br />【“哈哈，跟打仗一样，论打仗，我可从没输过任何一场！”】",
		},
		['胜意跃动'] = {
			id = 20132113,
			quality = 4,
			desc = "原本只是剪刀手内部组织的夜间放松游戏，但好胜心让游戏往不可控的竞赛一路狂奔。房间里此起彼伏的闷哼宛如战场，而被枕头痛击的败将，往往只来得及看见一个潇洒离去的身影。<br /><br />【“跟我比赛只有一个结果，倒头就睡！”】",
		},
		['苍雷潜龙'] = {
			id = 20132206,
			quality = 5,
			desc = "以游龙与苍雷为主题的英雄战袍。取名自“苍雷潜龙”本人的名号，既有雷之迅疾，亦有侠之豪气。这身战衣同它的主人一同行走八方、纵横四海，留下了无数为人津津乐道的传奇事迹。<br /><br />【黑云压城之下，“苍雷潜龙”的身影依旧穿越在钢铁丛林之间。在这偌大的都市中，她要扑灭的罪恶之火，不止一处。<br />她先是轻轻挥手，“友好警告”了持枪对轰的飙车狂徒，而在她身后，计划败露的黑帮集团正在一路狂追。<br />东南西北各路而来的对手一共多少？麻烦，多得数不清……<br />一瞬间，她忽然有些怀念过去泡泡拳馆、飙飙车的清闲日子。如今这般你追我赶、兵戈相见的日常，她厌倦了么？<br />吃完最后一包薯片后，她纵身一跃，屹立于一处古楼的屋檐之上。一声惊雷起，天际仿佛有千雷万霆呼应回响，各路恶党贼人无不胆颤。<br />而在此时，她不止睥睨着罪犯，也在默默俯瞰这片万家灯火——或许这就是她的回答。】",
		},
		['苍雷潜龙-风云'] = {
			id = 20132207,
			quality = 5,
		},
		['苍雷潜龙-水墨'] = {
			id = 20132208,
			quality = 5,
		},
		['苍雷潜龙-孤夜'] = {
			id = 20132209,
			quality = 5,
		},
		['苍雷潜龙-古韵'] = {
			id = 20132210,
			quality = 5,
		},
		['危险游戏'] = {
			id = 20132211,
			quality = 5,
			desc = "行走于纸醉金迷的场所，明自然要准备一身彰显身份的行头。这是和街头完全不同的战场，却也遍布无形的硝烟。不过既然上桌，就要昂首挺胸，豪迈出手——如同她一贯的信条。<br /><br />【“有你老大我在，玩什么都不可能输。危险？不存在的，我的皮箱可不是摆设。”】<br /><br />【雪茄、香水、酒精，迷乱的灯光、嘈杂的人声，浮夸的欢笑……<br />这是名利场，是由权利与财富共同交织而成的荒诞剧。<br />人们交换着利益与信息，衣香鬓影的假面下，横行着不为人知的欲望与暗流。<br />这里的入场券，足以买下普雷顿的半条街道。<br />这里任意的一场输赢，足以决定一个人的命运。<br />这里的一切都价值连城，同桌之人随口吐露的话语，都能使一个时代沉浮。<br />高含氧量的空间让明的掌心发热，又在触碰到皮箱冰冷把手的时候冷静下来。<br />街头的赤衣豪侠？反对组织的行动队长？不，这都不是她今天的角色。<br />她是这里的新面孔，却毫无新人的试探和局促。她寥寥几次出手，便让所有人侧目。<br />轻浮之人出声讥笑，投机之人不怀好意，深沉之人充满探究，谨慎之人心惊胆战。<br />她视而不见，听而不闻，只将手伸向最高处那枚设立以来从未有人使用过的银铃。<br />当——<br />在满场寂静中，她宣布：<br />“下一场胜负，由我一人买单！”<br />搅局者？不，她是来终结游戏的人。】",
		},
		['危险游戏-赤焰'] = {
			id = 20132212,
			quality = 5,
		},
		['危险游戏-铂金'] = {
			id = 20132213,
			quality = 5,
		},
		['危险游戏-霓虹'] = {
			id = 20132214,
			quality = 5,
		},
		['危险游戏-幻影'] = {
			id = 20132215,
			quality = 5,
		},
	},
	['玛德蕾娜·利里'] = {
		['调色盘'] = {
			id = 20107001,
			quality = 0,
			desc = "简约却不失艺术感的画师服。比起繁复的服装搭配，玛德蕾娜更在意色彩的融洽与否。",
		},
		['调色盘-春草'] = {
			id = 20107002,
			quality = 2,
			desc = "玛德蕾娜画师服的特殊配色款式。明媚的草绿象征着生机与活力。",
		},
		['调色盘-桃夭'] = {
			id = 20107003,
			quality = 2,
			desc = "玛德蕾娜画师服的特殊配色款式。粉嫩的桃红如蝴蝶，如繁花。",
		},
		['调色盘-靛染'] = {
			id = 20107004,
			quality = 2,
			desc = "玛德蕾娜画师服的特殊配色款式。深沉的靛蓝象征着创意与直觉。",
		},
		['调色盘-银红'] = {
			id = 20107007,
			quality = 2,
			desc = "玛德蕾娜画师服的特殊配色款式。交织的银红显得她鹤立鸡群。",
		},
		['调色盘-紫萼'] = {
			id = 20107008,
			quality = 2,
			desc = "玛德蕾娜画师服的特殊配色款式。高贵的紫衬托下，她的身姿如花朵摇曳。",
		},
		['调色盘-心湖'] = {
			id = 20107009,
			quality = 2,
			desc = "玛德蕾娜画师服的特殊配色款式。蓝绿错落，如心湖荡漾。",
		},
		['调色盘-冰心'] = {
			id = 20107010,
			quality = 2,
			desc = "玛德蕾娜画师服的特殊配色款式。仿佛冬日的湖泊，澄澈无比。",
		},
		['调色盘-褐叶'] = {
			id = 20107011,
			quality = 2,
			desc = "玛德蕾娜画师服的特殊配色款式。像秋日的落叶一般低调，沉静。",
		},
		['夏末初现的红'] = {
			id = 20107051,
			quality = 3,
			desc = "她徘徊于那片红色果园里，在画板上留下艺术的痕迹。偶然间，我被那抹俏皮的红色吸引，流连于阡陌小道之中。",
		},
		['星月夜'] = {
			id = 20107052,
			quality = 3,
			desc = "手绘着精致图案的蓝色画师服，是玛德蕾娜所珍爱的作品。衣袂摆动之间，宛如星空流转不定。<br />",
		},
		['绘师宅急便'] = {
			id = 20107053,
			quality = 3,
			desc = "玛德蕾娜身着一副简练实用的装束，如同配送急件的快递员。孤身一人踏上旅程时，她才意识到，这世界远比她想象中广阔。",
		},
		['蓝莓牛奶'] = {
			id = 20107054,
			quality = 3,
			desc = "孩子气的蓝莓牛奶装束，穿在玛德蕾娜身上却再合适不过。毕竟，只有保持童真的心，才能创作出美丽的作品。",
		},
		['樱花奇遇'] = {
			id = 20107055,
			quality = 3,
			desc = "玛德蕾娜自行设计的出行服装。<br />在游乐园的摩天轮上，樱色的少女观看着打上天际的烟火默默沉醉，将这份独特的灵感悄悄珍藏。",
		},
		['心意传递员'] = {
			id = 20107056,
			quality = 3,
			desc = "钻研着如何用创作表达心意的玛德蕾娜，兼职了邮递员的工作。在她看来，信件也是传递着作者心意的重要媒介。她将身后的小背包设计成邮箱的样子，不管有怎样珍贵的心意，敬请投递。",
		},
		['溯溪远行'] = {
			id = 20107101,
			quality = 4,
			desc = "人们都说，不会钓鱼的探险家不是一个好画师。<br />为了前往斯崔恩郊野人迹罕至的生态区进行实地采风，玛德蕾娜特意准备了这套野外活动套装。沿溪溯行，时而写生，时而垂钓，画板和鱼框都装满了收获。<br /><br />【“好耶，上钩了！欸——别跑啊！看招，颜料泡泡！”】",
		},
		['兔兔轮滑'] = {
			id = 20107102,
			quality = 4,
			desc = "玛德蕾娜的这套装束兼具甜美与活力，就如穿梭于街巷间一道闪耀的霓虹。身为艺术家，偶尔也要做些出格的事才行。<br /><br />【“呀嗬~晚上好啊！咻——”】<br />绘师少女脸上是满是兴奋的笑容，从身边一掠而过。<br />飘逸的身姿，滑轮上闪烁的虹光，让人有点头晕目眩。<br />没办法，不论这个任性的少女做了什么，总是能以“取材”作为理由啊。",
		},
		['激扬碧浪'] = {
			id = 20107103,
			quality = 4,
			desc = "海滨的美景，激发出少女绘师的灵感。清爽的水手服，衬得她的身姿也更为俏丽。<br /><br />蔚蓝的洋面，洁白的浪花，还有欢歌的人群。这片美景让玛德蕾娜不由心醉。<br />她取出随身携带的画笔，将心中的感动挥洒在画布上。<br />少顷，她的心中浮现出了一个想法：<br />每个人的心中，都该拥有属于自己的一片“海洋”。",
		},
		['满月之梦'] = {
			id = 20107104,
			quality = 4,
			desc = "以太空为主题，素白紧身衣配上时尚的黑色机械兔耳。这套装束让玛德蕾娜比平时少了几分朴素，多了几分大胆。<br /><br />“你看你看，这衣服反射的光亮，像不像月夜的银光？”<br />“我听说月亮上有只兔子在生活，那你说，卡丘世界的月亮上，也会有只电子兔吗？”<br />少女在夜幕之下，快乐地做着太空的梦。",
		},
		['暴走紫韵'] = {
			id = 20107105,
			quality = 4,
			desc = "玛德蕾娜参加快闪演出时准备的演出服。在金树乐章活动后似乎她也觉醒了对音乐的热爱，只不过，似乎不是古典派……<br /><br />【“旋律只会停驻片刻，随后消失不见，你不觉得很浪漫吗？”】",
		},
		['弦乐之声'] = {
			id = 20107106,
			quality = 4,
			desc = "玛德蕾娜受邀参加金树乐章音乐会时所穿着的服装。由玛德蕾娜自己亲自设计，小圆帽有时候也能帮助不太自信的她遮住害羞的脸。<br /><br />【“这样的场景…可不能丢脸呢！”】",
		},
		['欢歌曼舞'] = {
			id = 20107108,
			quality = 4,
			desc = "玛德蕾娜经多番考据而设计的古典舞裙。配色鲜亮瞩目，翩然起舞时手鼓也跟着清脆作响，那个时代的浪漫风情在她青涩热情的舞步下可见一斑。<br /><br />【“最初只是想找找灵感，但现在我已经彻底迷上这种舞蹈了！”】",
		},
		['机巧诚愿'] = {
			id = 20107109,
			quality = 4,
			desc = "迷路的人偶游离在瑰丽的花园，在每一处奇妙的景象中驻足不前，在一段从未经历的美妙旅程中，她找到了心中深藏的祈愿——一个用缤纷色彩绘成，能够守护每一份珍贵的童话世界。<br /><br />【“我希望能够早日寻得自己的真心，我希望每一个善良的人都能徜徉于阳光的暖意。”】",
		},
		['童心萌动'] = {
			id = 20107110,
			quality = 4,
			desc = "玛德蕾娜参加游乐园活动时准备的服装。充满童趣的可爱设计，混入游乐园的卡通角色之中也毫无违和感。<br /><br />【“我这样只是为了更好地体会小孩子的心情……毕竟偶尔我也会接到儿童绘本的委托呢。”】",
		},
		['庆典绘者'] = {
			id = 20107111,
			quality = 4,
			desc = "为了使这份堪称艺术的文化再次流行，玛德蕾娜佩戴了影像中的出现过的诸多物件作为装饰，据说该形象也来源于另一位漫画家的手笔。<br /><br />【我创作的漫画，也能够动画化就好了。】",
		},
		['果橙萌豚'] = {
			id = 20107112,
			quality = 4,
			desc = "为了寻找创作灵感，玛德蕾娜邀请艾卡陪自己前往新开张的奇趣游乐园。她以“水豚”为元素设计了新的服装，希望能度过一个悠闲的假日。<br /><br />【“水豚这种动物，虽然慢吞吞，但是很踏实，就像在艺术之路上不断前行的我一样呢~”】",
		},
		['团团新岁'] = {
			id = 20107113,
			quality = 4,
			desc = "为了融入沐春节的节日氛围，玛德蕾娜专门准备了这身服装，还为她心爱的兔兔包手工缝制了配套的保护套。<br /><br />【“已经听到放烟花的声音了！今晚，就到集市上去写生吧，一定会记录下热闹有趣的画面”】",
		},
		['软巧薄荷'] = {
			id = 20107114,
			quality = 4,
			desc = "直到抵达会场，小有名气的绘师少女才发现这竟然是一场甜品艺术节，迷迷糊糊地换上新装，迷迷糊糊地变身蜜糖，迷迷糊糊地享受着，这份甜蜜而奇妙的心情。<br /><br />【“小蛋糕很可爱！欸欸！错啦错啦错啦，我不是说自己是小蛋糕啦！”】",
		},
		['柔暖色调'] = {
			id = 20107201,
			quality = 6,
			desc = "玛德蕾娜自主设计的居家服饰。取材自山野的青绿与果实的橙黄，与你在家中一起构思有趣的艺术设计，是她最宝贵的温暖时光。<br /><br />【“今天要帮星庇所设计儿童绘本，明天答应了要给领居家的阿姨做室内客厅……”<br />又真是无比充实的一天，她总是以帮助别人为乐。只是这一次，你注意到了她脸上些许的疲惫。<br />“等等，顾问，别动——！”<br /> “对，就是这个姿势，就是这个眼神！”<br />少女发出惊叹，就像寻到了世上仅有的至宝。<br />“既然是休息日……顾问，可以请你做我的模特吗？”<br />少女走近了她最信任的人的身侧，散发着独属于她的温暖气息，眼睛里满是你的身影。】",
		},
		['失落的伊卡洛斯'] = {
			id = 20107206,
			quality = 5,
			desc = "“所谓的侦探技巧呢，最重要的就是——”<br />“就是什么？”<br />“就是……呃，观察、总结、分析、实践！”<br />“就这？ 我还以为有什么秘诀。拍着胸脯说要第一个找出怪盗，可别变成说大话喽？”<br />“怪盗预告说啥时候行动来着？”<br />“……此时，此刻。”<br />“啊！那和大小姐你在这一起瞪眼也没用啦！大侦探这就出发去找线索了，回头见！”<br /><br />注意看，一位端着咖啡杯的姑娘一会儿瞅瞅蒸汽机的模型，一会儿摸摸古代鲸鱼的化石，四处乱转，调皮而活泼——在这座复古风格的博物馆中，即将上演一出侦探与怪盗狭路相逢的好戏。<br />“哎，真不该一口气就答应下来，我哪有什么对付怪盗的经验嘛……”大侦探啜饮咖啡停不下来，其实有些惴惴不安。<br />令人如此苦恼的，正是眼前玻璃柜中的展品“伊卡洛斯装置”——以复古的蒸汽技术打造，催动精巧而复杂的机关，能神奇地让人飞起来的传奇道具——对超弦体玛德蕾娜来说并不适用，但对于喜欢收集没用东西的玛德蕾娜来说简直刚刚好。<br />某个知名“怪盗”已经发出了预告信，宣称“伊卡洛斯装置”必在众目睽睽之下被其夺走。因为正赶上购物节，预告信积压了半个多月，直到预告前一天才寄到博物馆。忧心不已的博物馆主人立刻请求乌尔比诺介入。<br />为了下个月的咖啡花销，以及背包中“全自动创意复古维多利亚蒸朋哥特纯手动机械拿铁摩卡浓缩奥瑞白压缩调制机”的维护费有着落，玛德蕾娜果断选择加入这场攻防大战。<br />然而……<br /><br />“可到底要怎么保护这东西啊……”，大侦探苦恼地盯着展柜中的箱包，“这么好的东西，大大方方地摆在这儿，不正等着被人顺手牵羊？”<br />大侦探圆圆的眼镜片上，忽然闪过一道金色的灵光。<br />“等下，也就是说，只要它不是摆在这个摇摇欲坠的玻璃柜子里，而是由安全可靠的本侦探找机会保护起来的话……”<br />——半小时后。有人报告在顶层发现炸弹！警卫们集体出动，被成功支走。接着，一团烟雾笼罩一楼大厅，展柜玻璃瞬间破碎，怪盗如约而至——立刻踩上一团咖啡牛奶，差点滑了一跤。<br />就在怪盗踉跄的一瞬间，一个小小的身影悄悄冲进烟雾，冲进了被打碎的展柜——<br />等警卫们回到大厅，看到被破坏的空无一物的展柜，纷纷惊呼：伊卡洛斯装置被怪盗偷走了！<br />而就在馆内群龙无首，乱乱哄哄的同时，牢牢保护着“伊卡洛斯装置”的大侦探检查好了手中的武器，深吸了一口气——<br />“准备好参加大侦探的咖啡招待会吧，怪盗！”",
		},
		['失落的伊卡洛斯-优雅'] = {
			id = 20107207,
			quality = 5,
		},
		['失落的伊卡洛斯-沉静'] = {
			id = 20107208,
			quality = 5,
		},
		['失落的伊卡洛斯-热烈'] = {
			id = 20107209,
			quality = 5,
		},
		['失落的伊卡洛斯-神秘'] = {
			id = 20107210,
			quality = 5,
		},
	},
	['拉薇'] = {
		['破刃'] = {
			id = 20128001,
			quality = 0,
			desc = "适配剪刀手光学伪装技术的特种作战服。高效实用，专为拉薇打造。",
		},
		['破刃-枯沙'] = {
			id = 20128002,
			quality = 2,
			desc = "拉薇的备用作战服。耀目的金辉如细小的沙砾随风流动。",
		},
		['破刃-冰川'] = {
			id = 20128003,
			quality = 2,
			desc = "拉薇的备用作战服。冷酷的冰蓝令人心中升起一丝寒意。",
		},
		['破刃-幽森'] = {
			id = 20128004,
			quality = 2,
			desc = "拉薇的备用作战服。森绿的衣摆显得格外潇洒利落。",
		},
		['破刃-紫雨'] = {
			id = 20128005,
			quality = 2,
			desc = "拉薇的备用作战服。靓丽的紫色衬托出她矫健的倩影。",
		},
		['破刃-疾风'] = {
			id = 20128006,
			quality = 2,
			desc = "拉薇的备用作战服。飘扬的嫩绿如风中碧草。",
		},
		['破刃-静夜'] = {
			id = 20128007,
			quality = 2,
			desc = "拉薇的备用作战服。幽蓝色调静谧如寒夜。",
		},
		['破刃-掣电'] = {
			id = 20128008,
			quality = 2,
			desc = "拉薇的备用作战服。锐利如雨夜中的鸣雷。",
		},
		['枫林唱晚'] = {
			id = 20128051,
			quality = 3,
			desc = "枫叶飘落，红与白的交织仿佛象征着拉薇的内心。曾经诗般美丽的纯洁心灵，如今已被战火所燃烧。",
		},
		['水墨群山'] = {
			id = 20128052,
			quality = 3,
			desc = "流丽的衣衫宛如古雅的群山绘卷，古典风格的服饰，映衬着拉薇优美却冷酷的身姿。",
		},
		['末日残响'] = {
			id = 20128053,
			quality = 3,
			desc = "黑与红的色调，似乎象征着故乡曾遭遇的灾厄。为了不让悲剧重演，拉薇必定会竭尽全力，奋战到底。",
		},
		['故土追忆'] = {
			id = 20128054,
			quality = 3,
			desc = "衣摆上的留声机，仿佛在一刻不停地播放着过往的乐曲。时不时地，这件衣衫也会让拉薇追忆起过去的时光。",
		},
		['盈缺有时'] = {
			id = 20128055,
			quality = 3,
			desc = "月有盈缺，人有离合。变化才是世间的常理，恒常不变的世界不过是水中幻月。",
		},
		['深渊回响'] = {
			id = 20128056,
			quality = 3,
			desc = "当你凝视深渊时，深渊也在凝视你——即使如此，她也义无反顾。",
		},
		['的士速递'] = {
			id = 20128057,
			quality = 3,
			desc = "为了掩饰身份，行动时拉薇所穿的外勤装服饰之一，利用她一向的速度优势，将情报准时无误的送达。",
		},
		['破妄音律'] = {
			id = 20128058,
			quality = 3,
			desc = "意识中有深蓝的节奏在流动，是这个世界本身虚妄的律动，还是来自灵魂深处真实的共鸣？",
		},
		['潇潇疏影'] = {
			id = 20128101,
			quality = 4,
			desc = "以“竹”为主题，予人以安宁意境的雅致服饰。饱含了拉薇对故土的思念之情。<br /><br />若有闲暇，她总会来到竹林里，那间属于自己的小屋。<br />窗外树影婆娑，竹叶间的交杂光斑打在昏黄的木地板上。<br />即使你陪伴在她身边，她也总是一言不发。<br />只是静静地，将一盏沏好的清茶推到你的手旁。",
		},
		['反叛之声'] = {
			id = 20128102,
			quality = 4,
			desc = "拉薇在剪刀手一次胜利庆祝时穿着的服装。<br />皮革与金属的碰撞，充满了朋克色彩。<br />她的呐喊，将向世界发起反叛。<br /><br />【“既然世界本就没有未来，那又何谈罪恶。”】",
		},
		['真理搜寻者'] = {
			id = 20128103,
			quality = 4,
			desc = "早期欧泊风格的搜查官制服，衬出穿着者飒爽干练的气质。这套制服中，蕴藏着拉薇所珍视的过往回忆。<br /><br />“想问我，是不是很憎恨欧泊？或许吧……”<br />摆弄着制服的衣角，拉薇自言自语着，沉入思绪的海洋中。<br />“……我真正憎恨的，是蒙蔽我们双眼的‘虚妄’。”<br />“不论是欧泊的我，还是现在的我。这一点，从未改变。”",
		},
		['片翼刀锋'] = {
			id = 20128104,
			quality = 4,
			desc = "张扬肆意的特殊款式战斗服下，掩盖着拉薇冷静理智的内心。藏形匿踪，一击制胜。<br /><br />夜幕下的城市里，暗影正疾驰。<br />无人得见她的身影，也无人察知她的话音。<br />“真是松懈过头……这样，就得手了。”<br />剪刀手第三执行者拉薇，再度向与她的信仰为敌者，送上刀锋。",
		},
		['灰狼奇遇'] = {
			id = 20128105,
			quality = 4,
			desc = "拉薇在受邀参加苹安节活动时的变装，原本只是打算监视欧泊的拉薇却被迫参演了童话节目，尽管拉薇一直是那样冷静沉稳，但栩栩如生的耳朵和尾巴似乎经常暴露她的想法……<br /><br />【“等一下，你哪只眼睛看到我高兴了？”】",
		},
		['独奏孤声'] = {
			id = 20128106,
			quality = 4,
			desc = "拉薇参加金树乐章音乐会时穿着的服装。充满叛逆的设计使她在这古典的氛围中显得十分特立独行，吸引目光。<br /><br />【“音乐会让人的内心平静，我并不反对你的邀请。”】",
		},
		['星河幻影'] = {
			id = 20128107,
			quality = 4,
			desc = "拉薇受邀前往月桂大厅演出的修身模特服。优雅神秘的礼服设计搭配上拉薇冷酷的神情，让整场演出显得愈发扑朔迷离。<br /><br />【“目标位置确定，行动开始。”】",
		},
		['荒野行动'] = {
			id = 20128108,
			quality = 4,
			desc = "拉薇带队进行特种作战时所穿的服装。迷彩花纹让拉薇在不使用遁影藏踪时也能很好地掩盖身形，与环境融为一体。<br /><br />【“Clear，全区域清理完成，这是我们的胜利。”】",
		},
		['黑红交错'] = {
			id = 20128109,
			quality = 4,
			desc = "拉薇在咖啡厅潜伏时所穿的女仆装。在红黑交织之中尽显优雅与深沉，而她藏于身后的匕首双刃更是增添了几分危险而致命的美丽。<br /><br />【“匕首？是用来保护你的，所以，客人，你不用那么紧张……”】",
		},
		['摇曳轻纱'] = {
			id = 20128110,
			quality = 4,
			desc = "悠扬的乐曲在空气中流淌，层层叠叠的轻纱摆动，如梦似幻，又仿佛泡影。在夜色中难以靠近的，是馥郁的兰花，还是吟唱的歌女？<br /><br />【“刚刚表演时，你一直注视着我。你……也喜欢这首乐曲吗？”】",
		},
		['翠翎兰息'] = {
			id = 20128111,
			quality = 4,
			desc = "一位偶尔现身于冒险者公会的游侠。外表清隽秀丽，性格沉默冷淡，除了能从精灵耳看出种族外，一切都是谜——直到某日，她用匕首轻松解决了一群盗贼后，公会里的众人才询问起了她的名字。<br /><br />【“名字没有意义，记住这匕首就够了。”】",
		},
		['幻刃刀锋'] = {
			id = 20128112,
			quality = 4,
			desc = "将自身化作利刃，破开迷雾，斩断虚妄，这就是拉薇所坚持的信仰。平日里，拉薇的踪迹难以寻觅，但她总在通讯网络中留下只言片语，仿佛将自身化作赛博幽灵，循着电讯号来执行自己的正义。<br /><br />【“我是一柄刀锋，虚假帷幕将由我亲手划破。你们即将见到的，是残酷的真相。”】",
		},
		['望月舒莲'] = {
			id = 20128113,
			quality = 4,
			desc = "花朝典仪流传到普雷顿的时候，剪刀手也为大家准备了一场庆典，平素喜静的女孩想了很久，决定自己设计出席的服装，虽然已经用了并不亮眼的色彩，但沉静的美，依然让人挪不开视线。<br /><br />【“盈盈秀月，脉脉蒹葭，沥沥春风，疏疏莲丛。”】",
		},
		['星波澈影'] = {
			id = 20128114,
			quality = 4,
			desc = "拉薇在嘉年华海岸音乐节会场穿着的泳装，偏于传统的设计并不能遮掩穿着者本身的魅力，沉静的水光挽起了月亮，落在少女眼中，成为这个夜晚里最动人的星光。<br /><br />【“银白的星河，湛蓝的星海，与你见到的那些，都是很好，很好。”】",
		},
		['空谷幽兰'] = {
			id = 20128201,
			quality = 6,
			desc = "拉薇闲暇时穿着的居家服饰。只有真正亲近的伙伴，才能看到她的这一面。<br /><br />【“你问这是什么？兰花。”<br />清雅的花草香气，从拉薇与你面前的茶盏中飘出。<br />洁白的花瓣，在茶水内舒展开来。<br />你注意到，在她的衣衫上，也绣有同样的花朵。<br />“这种花，只在春天开放。而在这个世界的春天，实在太过短暂。”<br />饮了口茶，眼前的少女露出了难以察觉的淡淡微笑。<br />对她来说，这段抛下一切事务与责任，短暂的休憩时光，就是属于她的春天。】",
		},
		['千秋岁引'] = {
			id = 20128206,
			quality = 5,
			desc = "威武俊逸的武将戎装，彰显着将者冲锋陷阵的骁勇无畏。一袭红衣明艳而瞩目，如同一株寒夜中的红梅，亦流露着难以为人所知的缕缕女儿柔情。<br /><br />【疆场上，寒风料峭，折戟沉沙。又是一场鏖战，归乡之日遥遥无期。<br />结束一日的行军后，一袭红衣的将领卸下戎装，白衣似雪，墨发如绦。鲜有人知，统帅三军、一马当先的武将竟是女儿身。<br />孤寂寒夜风雪潇潇，营帐外，沉寂已久的梅花竟在深雪中露出点点殷红。武将望着红梅，思念起远方的故人。<br />在二人最后一次品茗对练后，那人折下一剪雪梅赠予了她。之后，她隐去名姓与身份，告别故土，从军远征。<br />风雪冰寒，兵戈无情，或许唯有深雪中的红梅才能读懂这段亦师亦友的真挚情义。】",
		},
		['千秋岁引-腊前梅'] = {
			id = 20128207,
			quality = 5,
		},
		['千秋岁引-风入松'] = {
			id = 20128208,
			quality = 5,
		},
		['千秋岁引-紫萸香'] = {
			id = 20128209,
			quality = 5,
		},
		['千秋岁引-山外云'] = {
			id = 20128210,
			quality = 5,
		},
	},
	['信'] = {
		['守望'] = {
			id = 20108001,
			quality = 0,
			desc = "搜查一班队长信的专用套装。一丝不苟的服装设计映衬他严谨的职业态度。",
		},
		['守望-天青'] = {
			id = 20108002,
			quality = 2,
			desc = "信的备用工作套装。雨过天青，不畏险阻。",
		},
		['守望-火花'] = {
			id = 20108003,
			quality = 2,
			desc = "信的备用工作套装。火花激荡，冲破阻碍。",
		},
		['守望-心潮'] = {
			id = 20108004,
			quality = 2,
			desc = "信的备用工作套装。心潮澎湃，如碧波涌动。",
		},
		['守望-脉冲'] = {
			id = 20108005,
			quality = 2,
			desc = "信的备用工作套装。电光闪烁，兼具勇气与智慧。",
		},
		['守望-紫晶'] = {
			id = 20108006,
			quality = 2,
			desc = "信的备用工作套装。紫晶耀目，优雅与高傲并存。",
		},
		['守望-锈迹'] = {
			id = 20108007,
			quality = 2,
			desc = "信的备用工作套装。斑斑锈迹，难掩雄心壮志。",
		},
		['守望-燃尽'] = {
			id = 20108008,
			quality = 2,
			desc = "信的备用工作套装。光芒消退，只余灰烬。",
		},
		['守望-郁荫'] = {
			id = 20108009,
			quality = 2,
			desc = "信的备用工作套装，生生不息，长盛不衰。",
		},
		['守望-岩锻'] = {
			id = 20108010,
			quality = 2,
			desc = "信的备用工作套装。心意果决，破坚摧刚。",
		},
		['动感乐音'] = {
			id = 20108051,
			quality = 3,
			desc = "蓝黑相间，电子风格的长衫长裤，配上碟片涂装的对讲机，这套衣衫让平常冷酷的信，也多了几分动感时尚。",
		},
		['光荣荆棘路'] = {
			id = 20108052,
			quality = 3,
			desc = "高贵优雅的服饰上，绣有荆棘与宝剑的纹饰。这套衣衫仿佛象征着信坎坷的命运，抑或是，他不惧艰险的决心。",
		},
		['远方信使'] = {
			id = 20108053,
			quality = 3,
			desc = "干练紧身的衣着，腰后的古旧信笺，信像是一位尽职尽责的邮差。不知道，最重要的那封信，最终会递送给谁呢？",
		},
		['咖啡绅士'] = {
			id = 20108054,
			quality = 3,
			desc = "白色的衬衫，配上棕褐的外套和领带，让信有种优雅却又高不可攀的气度。他的身上，仿佛有咖啡豆的香气飘散开来。",
		},
		['极速守卫'] = {
			id = 20108055,
			quality = 3,
			desc = "最好的搜查官当然也必须是最好的车手，不仅能在道路飞车中追上罪犯，还能保证不超速。他怎么做到的？",
		},
		['青幽竹海'] = {
			id = 20108056,
			quality = 3,
			desc = "信的定制工作装。以幽深竹林的苍郁之色为主题，很好地衬托出着装者沉静的气质。",
		},
		['心胸开阔'] = {
			id = 20108057,
			quality = 3,
			desc = "以最近在卡丘世界火热的文化形象为参考设计的制服。据本人声称，这套服装带给了他别样的责任感。<br /><br />【“战斗是为了保护身后，以及身前的人。”】",
		},
		['赛博战警'] = {
			id = 20108101,
			quality = 4,
			desc = "专属于信的欧泊特种作战服。在钢铁与皮革的包裹之下，他的俊朗风姿与冷静气度丝毫不减。<br /><br />“远程控制端口接入，雷达系统全开，不要放过任何蛛丝马迹。”<br />在信的指挥下，一场有条不紊的抓捕行动正紧张地进行中。<br />不过，这次抓捕行动在开始之前，就早已结束了。<br />“你就是这次的抓捕对象吧。接下来，是你投降？还是，要让我动手？”",
		},
		['夏日微风'] = {
			id = 20108102,
			quality = 4,
			desc = "紧身泳装配上沙滩裤，尽管简朴，却彰显出信出众的气质。在这段短暂的休憩里，信只想静静地，让海风吹拂在自己脸上。<br /><br />【明明是欢乐的海滨假日，信却独自一人躺在沙滩椅上，静静地看着蓝天。<br />是心情不好，或者发生什么事情了吗？信否认了这一点。<br />“我只是在思考我的未来，还有我的价值。”<br />“稍稍陪我一会儿吧。也许在你身边，我的信念会更加坚定。”】",
		},
		['鹤翼无双'] = {
			id = 20108103,
			quality = 4,
			desc = "以鹤为印象设计的服装。黑色的底色上绘制了两只白鹤，如同从墨色的松林间振翅起飞，并肩而行，追逐白日。<br />穿起这件衣服时，信感到十分怀念。在欧泊的搜查官课程中他学习过古代东方的军事思想——'鹤翼阵'曾经是他们的拿手好戏，这原本需要两名合作者高度配合，从两翼同时包夹敌人。如今，尽管缺少了合作者，但信已经能够将同样的战术运用于单人作战之中——<br /><br />【“你们已经被我一个人包围了，快投降吧。”】",
		},
		['雪原纪行'] = {
			id = 20108104,
			quality = 4,
			desc = "信在参加荒野冬日挑战赛中竞速赛使用的比赛服。良好的保温性能暂且不提，便于雪地行动的护目镜和紧身设计都有助于在雪地竞速的环节中拔得头筹。<br /><br />【“信！又是信！这已经是他第三次获得荒野冬日竞速冠军了！”】",
		},
		['叛逆共鸣'] = {
			id = 20108105,
			quality = 4,
			desc = "信的街头演出服，诠释了他对于摇滚的理解。有人说，摇滚就是吉他上的独奏，贝斯上的低音，架子鼓上的节奏。有人说它是一种精神，是对伪善文化的反叛，是城市之声，是音乐的呐喊。而对信来说，摇滚是一种颠覆，是速度与力量的融合，是生命的昂扬绽放。<br /><br />【“所谓混乱，不止是对旧规则的颠覆，更是未来新秩序的起源。”】",
		},
		['异色格象'] = {
			id = 20108107,
			quality = 4,
			desc = "信参加西洋棋表演赛时的服装。黑白格纹理的戗驳领线条流畅，体现时尚感的同时不失高贵，将西装作为男士在重要场合下“战甲”的刚毅刻画得十分完美。信原本对搜查科要参加这种活动感到倦怠，然而……<br /><br />【“我原本以为，我们就像这两只棋子，永远无法真正地彼此接触。”】",
		},
		['长夜守望'] = {
			id = 20108108,
			quality = 4,
			desc = "信负责戏剧主题活动安保时的着装。参考了古地球地中海区域的文化特征，风格深沉，设计简约，行者的自由与神秘流露其间。<br /><br />【“在黑暗中耕耘，为光明服务——那个人也是这样么？”】",
		},
		['全能执事'] = {
			id = 20108109,
			quality = 4,
			desc = "庄园晚宴的准备阶段，只有负责在树上挂礼物的执事看上去心事重重。<br /><br />【“并非刻意展示严肃，只是庄园需要一个在任何情况下都能站出来收拾——咳，兜底的人。”】",
		},
		['浮金琴键'] = {
			id = 20108110,
			quality = 4,
			desc = "欧泊执行某次特殊任务时的定制装扮，信的伪装身份是沉稳可靠的家族长子，深得家族成员的信任，负责晚宴从发送邀请函到安排全场流程的重要职责。<br /><br />【“推杯换盏间，权利和欲望的主体在悄然更迭。而我的使命，就是让这场仪式永不停歇。”】",
		},
		['猎魔升变'] = {
			id = 20108111,
			quality = 4,
			desc = "即使群敌环伺，孤身入阵的搜查官也未曾想过后退，固然，休假中途遭遇敌人有些意料之外，但——骑士的技艺不仅在于武力，也在于智慧；而技艺的背后，是必须守护的阵地。<br /><br />【“这场棋局，由我突破困境。”】",
		},
		['弦辉骑士'] = {
			id = 20108206,
			quality = 5,
			desc = "执剑的守望者伫立在白塔之顶，护佑着弦能光幕下，那些无剑的人民。他将锋刃迎向敌人的方向，为旗帜镀上永不黯淡的弦光。<br /><br />【“我承载荣誉，便会直面牺牲，我持有剑锋，便该斩断枷锁，我沐浴弦辉，便将照亮黑暗。”】<br /><br /><br />【信并未想过，自己要成为这座白塔的象征。<br />他只是践行着加入搜查官的誓言：守护平民，打击罪恶，让这座城市安全有序，让这个世界和平无忧。<br />他并未振臂高呼，却用自己的言行，让“骑士”有了具象的姓名。<br />于是铠甲与剑回应了人民的呼唤，为被信赖的骑士锻造了满是祝福的武装。<br />当骑士揭下武装的红幔，便看到武装上镌刻的誓言：<br />以谦卑做甲胄，以英勇砺剑锋；予无辜者怜悯，赐弱小者正义；向光明献牺牲，拒晦暗以诚实；视公理为荣誉，守纯洁之灵魂。<br />这是他坚守的过去，坚持的现在，坚信的未来。<br />】",
		},
		['弦辉骑士-光曜'] = {
			id = 20108207,
			quality = 5,
		},
		['弦辉骑士-黯谒'] = {
			id = 20108208,
			quality = 5,
		},
		['弦辉骑士-凌威'] = {
			id = 20108209,
			quality = 5,
		},
		['弦辉骑士-焱勇'] = {
			id = 20108210,
			quality = 5,
		},
	},
	['绯莎'] = {
		['潜行'] = {
			id = 20112001,
			quality = 0,
			desc = "职业杀手客制紧身衣。只为战斗而生，流线型的剪裁中不夹杂任何多余要素。",
		},
		['潜行-冰河'] = {
			id = 20112002,
			quality = 2,
			desc = "绯莎的备用作战服。杀手如冰，寒冷刺骨。",
		},
		['潜行-热浪'] = {
			id = 20112003,
			quality = 2,
			desc = "绯莎的备用作战服。惹眼的红，是枪口带来的热浪。",
		},
		['潜行-黄昏'] = {
			id = 20112004,
			quality = 2,
			desc = "绯莎的备用作战服。黄昏正乃逢魔时刻，恶魔正在择人而噬。",
		},
		['潜行-暗沼'] = {
			id = 20112005,
			quality = 2,
			desc = "绯莎的备用作战服。紫色不光是神秘，也可能是剧毒。",
		},
		['潜行-海原'] = {
			id = 20112006,
			quality = 2,
			desc = "绯莎的备用作战服。人类，何尝不是一种鱼呢？",
		},
		['潜行-大地'] = {
			id = 20112007,
			quality = 2,
			desc = "绯莎的备用作战服。一切行走在这大地的人，都将无拘无束。",
		},
		['潜行-林野'] = {
			id = 20112008,
			quality = 2,
			desc = "绯莎的备用作战服。隐蔽可不只是单单的隐藏气息。",
		},
		['潜行-深谷'] = {
			id = 20112009,
			quality = 2,
			desc = "绯莎的备用作战服。自幽深处来的，是神秘，是未知的恐惧。",
		},
		['机械信条'] = {
			id = 20112051,
			quality = 3,
			desc = "从何时起，<br />我们身陷钢铁耸立的囹圄。<br />星空变得黯淡，<br />照不亮来时的路。",
		},
		['医疗护卫'] = {
			id = 20112052,
			quality = 3,
			desc = "没有什么是比生命更加崇高的，如果有，那就是保护生命。",
		},
		['黑城叛客'] = {
			id = 20112053,
			quality = 3,
			desc = "在黑夜的街道上穿梭的魅影，那正是名为绯莎的幻影。",
		},
		['苍天飞鹤'] = {
			id = 20112054,
			quality = 3,
			desc = "晴空一鹤排云上，便引诗情到碧霄。",
		},
		['像素游戏'] = {
			id = 20112055,
			quality = 3,
			desc = "游戏，有时候也很致命，至少她是这么认为的。",
		},
		['暖意焦糖'] = {
			id = 20112056,
			quality = 3,
			desc = "绯莎以店员身份潜伏在咖啡馆时的伪装服饰。或许鲨鱼不会喜欢喝咖啡，但一杯杯醇香浓厚的焦糖咖啡为少女冰霜般的脸上增添了些许温度。",
		},
		['绯影冰峰'] = {
			id = 20112057,
			quality = 3,
			desc = "绯莎的运动装扮。粉色鲨鱼和青蓝冰山的奇妙组合，带来别样的视觉冲击。",
		},
		['叛逆精神'] = {
			id = 20112058,
			quality = 3,
			desc = "“谁说战斗不能很摇滚？”",
		},
		['暗夜猎人'] = {
			id = 20112101,
			quality = 4,
			desc = "服装原型考据自昔日在夜间森林中行走的猎人，怪诞乖张的设计里蕴含着由内而外的时代张力。<br /><br />【“来嘛来嘛，绯莎，就差你一个了！暗夜猎人——光是想想都觉得很适合你呢！”<br />“这身衣服不适合执行任务。”<br />“别那么古板嘛！来来来，要拍照了！”<br />“那……好吧。”<br /><br />面对同伴们的揶揄，绯纱沉默许久。她知道这只是玩闹，无论行装怎么更替，自己的过去都无法被改变。<br />却不知为何，她的心头泛上了一丝遗失许久的温暖。】",
		},
		['苍白隐者'] = {
			id = 20112102,
			quality = 4,
			desc = "绯莎为了城市战而准备的刺杀用战斗服。在足够的实用性和方便活动的同时更符合了绯莎自己的个人美学，鲨鱼鳍状的整流板也可以更好的辅助飘飞。她将化身穿梭在楼宇间的魅影，用枪声替自己代言。<br /><br />【“砰！简单利落的结束，仅此而已。”】",
		},
		['林中奇遇'] = {
			id = 20112103,
			quality = 4,
			desc = "绯莎参加第一届放飞之王评选赛时穿着的服装。轻便舒适，凉爽透气，棕绿相间的色调也让她得以在跋山涉水的过程中隐匿自身的行踪。<br /><br />【“多亏这套衣服，悄悄接近小动物时基本不会被察觉……有趣的经历。”】",
		},
		['鲜红猎兵'] = {
			id = 20112104,
			quality = 4,
			desc = "绯莎参加节日游行时所穿着的服装。原本只是为了方便保护要员，但意外的却受到了许多目光的追捧，成为了游行队伍的焦点。<br /><br />【“真是一群吵闹的家伙。”】",
		},
		['女仆见习生'] = {
			id = 20112105,
			quality = 4,
			desc = "绯莎亲自搭配的见习女仆。融入了绯莎对于女仆工作的理解，轻便修身的同时便于展现绯莎强大而高效的战斗力。<br /><br />【“如果不想被列入需要分类清除的名单……那么，别碍事。”】",
		},
		['浅酌微醺'] = {
			id = 20112106,
			quality = 4,
			desc = "绯莎在地下沙龙当调酒师时的特殊装扮。配合上她标准的动作，让人忍不住想问上一句：“你为什么这么熟练啊？！”<br /><br />【“这并没有什么稀奇的，我只是习惯在每个领域都做到最好，调酒也不例外——要来一杯吗？”】",
		},
		['迅影奇兵'] = {
			id = 20112110,
			quality = 4,
			desc = "除了全副武装之外，战斗的胜利，当然离不开缜密智慧的战略与稳健惊人的火力——绯莎深谙这一点，由她组建的鲨鱼小队二人组，在真人枪战游戏的赛场中，无往不胜。<br /><br />【“引航者，若你是我的鹰眼，我便是你的鲨齿。像之前一样，我们共同夺得胜利吧！”】",
		},
		['一代宗师'] = {
			id = 20112111,
			quality = 4,
			desc = "“武”之境界，至高至纯。武者想要突破功法境界，就必须先突破心境。绯莎对此虽不认同，却也在暗暗期许将来能得到答案。<br /><br />【“何为‘武’，为何‘学武’，这些问题的答案很重要吗？我不在乎，不也走到了今天？”】",
		},
		['织华颂者'] = {
			id = 20112112,
			quality = 4,
			desc = "与“焰浪”签订契约的魔法少女绯莎的战斗服，清冷的身姿与热烈的装束，交织出绚烂的奇景，难以分辨那是火焰抑或海水，她是朝晖，是席卷黑暗的炽热洋流。<br /><br />【“如果你很在意火焰因何燃起，那不如就认为这是相信带来的奇迹。”】",
		},
		['姜饼摇摇'] = {
			id = 20112113,
			quality = 4,
			desc = "最优秀的佣兵往往没有休息的日子，哪怕是圣诞节也会有独特的工作日程，为了这个特殊的行动，顶尖佣兵将会展示出自己混入节日氛围的顶尖技巧。<br /><br />【“嘘，不要吵，姜饼人视力不好，等他们把自己挂我身上，我立刻就跑。”】",
		},
		['幽行礼装'] = {
			id = 20112114,
			quality = 4,
			desc = "出色的战士从不在意战场的环境，她只需要知道敌人是谁，身在何处，就足以发起一场宣告胜利的突袭——当然，这一切要用优良的战场着装与整备开启。<br /><br />【“发现异常目标——异常目标鲷鱼烧已被消灭，完毕。”】",
		},
		['诗笺狂想'] = {
			id = 20112115,
			quality = 4,
			desc = "绯莎为嘉年华合唱团定制的演出服，虽然不是皮实耐用的作战款式，但强大的战士从不会为装备所困扰，勇敢的少女依然完成了属于自己的试炼，将祝福带给了等待希望的人们。<br /><br />【“我看看……请勿穿着此服装做大幅度动作……啊，糟了。”】",
		},
		['萌鲨出动'] = {
			id = 20112116,
			quality = 4,
			desc = "除了海洋猎手之外，还有其他的鲨鱼形象吗？带着这样的疑问，绯莎偶遇了完·全·无·害的鲨鱼！这一次，真的变成粉色鲨鱼了呢！<br /><br />【“即便如此，也不要小看了我的行动力。”】",
		},
		['酷鲨巡游'] = {
			id = 20112117,
			quality = 4,
			desc = "当绯莎听说世界上还存在满是鲨鱼居住的小城，这位软萌的蓝色鲨鱼在她心中就成了素未谋面的老乡！穿上专门定制的主题服装，说不定有一天能潜入那里呢。<br /><br />【“我的伪装向来完美无缺。”】",
		},
		['假日懒洋洋'] = {
			id = 20112201,
			quality = 6,
			desc = "不执行委托的时候，绯莎会在家中换上这套居家服，然后做所有平时不会做的事情——吃鲷鱼烧、做巧克力、躺在地垫上发呆。小鲨鱼不懂什么叫浮生偷闲，小鲨鱼只想休息。<br /><br />【“你要再来一块鲷鱼烧吗？或者甜甜鲨？“<br />坐在地垫上的绯莎向我伸出两只手，左手是一块鲷鱼烧，右手是一根甜甜鲨，左右都是甜蜜的烦恼。<br />虽然确实很好吃，但今天的糖分摄入实在太多了，我咽了咽口水，坚定拒绝了绯莎。<br />“不吃算了。”绯莎耸耸肩，啊呜一口咬下去，满足地伸出舌头舔舐嘴角的碎屑。随后，又伸了个懒腰，四仰八叉地躺下。<br />“假日，就该懒洋洋的度过啊。”】",
		},
		['深海幻境'] = {
			id = 20112206,
			quality = 5,
			desc = "绯莎执行某项特殊任务时的潜水服。外形设计参考了鲨鱼的生理构造，穿上潜水服的绯莎俨然与那种深海巡游的生物无异。潜水服配置的鲨鱼尾骨来自一条亡故不久的鲨鱼，而绯莎的任务似乎是要接近那条亡鲨的同伴。<br /><br />【“执行这个任务的人需要足够敏锐、足够迅速、足够有耐心……最好，还非常了解鲨鱼。”<br />因此，绯莎被选中了，她接到的任务是穿上特制的潜水服，为仅存的狂躁鲨鱼注射镇定剂。<br />第一次，她不用躲在隐蔽处，真正地可以与活生生的鲨鱼见面。这是她一直以来的心愿。<br />在如梦似幻的海底，鲨鱼丝毫不排斥她，始终绕着她……不，是绕着那条尾骨遨游。<br />那只是一条冷冰冰的尾骨，鲨鱼却发自本能般地追逐那条尾骨。<br />直到她游向海岸，鲨鱼也机械式地跟着她，仿佛没有自我。<br />这时绯莎终于明白了鲨鱼狂躁的原因，也明白了自己与鲨鱼的不同。】 ",
		},
		['深海幻境-碧波白浪'] = {
			id = 20112207,
			quality = 5,
		},
		['深海幻境-极地永昼'] = {
			id = 20112208,
			quality = 5,
		},
		['深海幻境-碳酸泡沫'] = {
			id = 20112209,
			quality = 5,
		},
		['深海幻境-海渊弧光'] = {
			id = 20112210,
			quality = 5,
		},
		['潜海逐浪者'] = {
			id = 20112107,
			quality = 4,
			desc = "作为猎手，偶尔也要换换口味，最近绯莎对一种从未谋面的海洋生物萌生兴趣，为了与之相见她换上一身清凉，甚至模仿起了那种生物的样貌。<br /><br />【“海豚是游泳冠军？呵，与我相比呢？”】",
		},
		['橙香雪芙'] = {
			id = 20112108,
			quality = 4,
			desc = "即使在雪地里，鲨鱼也要保持最高行动速度和灵活的战斗方式！因此，轻便的内搭必不可少。外套……随便穿件暖和的就行了吧？<br /><br />【“这个袜子，还有发带，是那个总背着书包的画家送我的。说觉得我很适合这个颜色。你怎么看？”】",
		},
		['悠哉游人'] = {
			id = 20112109,
			quality = 4,
			desc = "绯莎为归宅部拉票准备的校园日专用制服，花费了宝贵的自由时间对制服进行了重新设计，希望以此唤醒大家对于放学就能回家的热爱。<br /><br />【“放学就是放学，放学最大的意义就是找到学校外的乐趣，比如新鲜出炉的鲷鱼烧。”】",
		},
	},
	['心夏'] = {
		['寻迹'] = {
			id = 20124001,
			quality = 0,
			desc = "为心夏特制的狙击作战服。功能齐全，造型稳重，适合全天候作战条件。",
		},
		['寻迹-樱花'] = {
			id = 20124002,
			quality = 2,
			desc = "心夏狙击作战服的备用款。浅浅的樱色令人心情舒畅。",
		},
		['寻迹-群山'] = {
			id = 20124003,
			quality = 2,
			desc = "心夏狙击作战服的备用款。灰蓝交杂，如天空映衬群山。",
		},
		['寻迹-晴空'] = {
			id = 20124004,
			quality = 2,
			desc = "心夏狙击作战服的备用款。碧蓝如秋日苍穹。",
		},
		['寻迹-星夜'] = {
			id = 20124005,
			quality = 2,
			desc = "心夏狙击作战服的备用款。浅紫为衬，宛如暮色。",
		},
		['寻迹-丛林'] = {
			id = 20124006,
			quality = 2,
			desc = "心夏狙击作战服的备用款。迷彩绿正适合潜伏行动。",
		},
		['寻迹-浅草'] = {
			id = 20124007,
			quality = 2,
			desc = "心夏狙击作战服的备用款。淡淡的草色令人有些惆怅。",
		},
		['寻迹-急救'] = {
			id = 20124008,
			quality = 2,
			desc = "心夏狙击作战服的备用款。红白相间配色，适用于医疗救援行动。",
		},
		['寻迹-戈壁'] = {
			id = 20124009,
			quality = 2,
			desc = "心夏狙击作战服的备用款，配色取自沙砾与枯木，在戈壁滩有着良好的伪装效果。",
		},
		['寻迹-极光'] = {
			id = 20124010,
			quality = 2,
			desc = "心夏狙击作战服的备用款。跨过悠长的夜，寻得幻梦的光。",
		},
		['古地工程'] = {
			id = 20124051,
			quality = 3,
			desc = "工程服款式的战斗装饰，饰以玩闹一般的工地标识。这套服装，是在心夏过去的探险生涯中所留下的纪念品。",
		},
		['密林虎影'] = {
			id = 20124053,
			quality = 3,
			desc = "心夏作战服的改造款式。将白虎的条纹融入服装设计中。在她身上，这套作战服英武非凡，却也有一股掩不住的危险气息。",
		},
		['极限出租'] = {
			id = 20124054,
			quality = 3,
			desc = "像是出租司机一样的工作装，却因穿着者而变得格外出挑亮眼。心夏说，这是她掩饰身份的行动装束，但，这是真的吗？",
		},
		['雪色天青'] = {
			id = 20124055,
			quality = 3,
			desc = "绘有雪花与松林的高雅服装。在心夏身上更显雅致。其中的含义，恐怕也只有她一人知晓。",
		},
		['沙滩寻宝'] = {
			id = 20124056,
			quality = 3,
			desc = "捡贝壳、挖螃蟹……将清新的夏日海滩印在身上，就能随时享受沙滩寻宝的乐趣了。",
		},
		['逐日猎犬'] = {
			id = 20124057,
			quality = 3,
			desc = "据说在某个遥远的国度，一位探索者为了追寻世界的真理曾数次追逐太阳，当地的人们便将她的事迹以壁画的形式记录了下来。我想我们知道她是谁。",
		},
		['鸭梨锁定'] = {
			id = 20124058,
			quality = 3,
			desc = "搜查工作并非事事顺利，身为前辈，心夏必须用最明媚的姿态为队友们鼓舞士气。<br />”让我们把不开心的事情统——统——打——飞！“",
		},
		['鸭鸭摇滚'] = {
			id = 20124101,
			quality = 4,
			desc = "虚拟偶像“达克鸭鸭”的演唱会应援服，前卫新潮，又不失少女的活泼俏皮，是心夏珍藏已久的绝版款。<br /><br />【“心夏前辈，准备好了吗？达克鸭鸭的演唱会要开始了哦！”<br />“那是当然……哎呀！”<br />“怎，怎么回事？远方一阵轰鸣……”<br />“有情况！执行紧急任务！”<br />就这样，少女身着应援服饰，第一时间奔赴前线。】",
		},
		['壮志凌云'] = {
			id = 20124102,
			quality = 4,
			desc = "模仿了旧时代电影中的飞行员装扮。寄托了心夏未竟的梦想。自幼便对世界充满好奇的她总是向往着天空和远方的大地，希望用自己的眼睛去见证未知的土地。<br /><br />【“我看看，这个是操纵杆，这个是高度计……好了，别担心，我已经看过好几十遍操作手册了。记好弹射开关的位置，我们准备起飞了！”】",
		},
		['空间工程师'] = {
			id = 20124103,
			quality = 4,
			desc = "心夏作为太空体验馆的导游时所穿着的衣物。具有抗辐射功能的装束非常适合外宇宙工程师的工作，作为工作的报酬，这件衣服被太空馆送给了心夏。<br /><br />【“宇航员心夏，现已出舱，感觉良好！”】",
		},
		['森林莓果'] = {
			id = 20124104,
			quality = 4,
			desc = "心夏尝试改造的野外装备之一。原本是用来探险的装束，在心夏的改造下变成了适合出游和野餐的礼仪性服装，说起来，身上的草莓似乎是真的可以吃的。<br /><br />【“感兴趣的话，要来吃吃看吗？”】",
		},
		['越野疾行'] = {
			id = 20124105,
			quality = 4,
			desc = "心夏参加秋季山地骑行比赛时的服装。贴身而轻便，透气性与降低风阻方面的表现非常优异，同时配备了容量充足的工具包。据说心夏就是穿着这身衣服，轻松拿下了骑行比赛的冠军。<br /><br />【“很意外吗？小小的身体偶尔也会爆发出惊人的能量！”】",
		},
		['首席乐师'] = {
			id = 20124106,
			quality = 4,
			desc = "心夏在金树乐章音乐会时准备的演出礼服。可爱的小礼帽彰显着俏皮和活力，对于挑战充满着期待。<br /><br />【“要来试试四手联弹吗？指挥不懂的话怎么能做好指挥的工作呢？”】",
		},
		['夏夜祭典'] = {
			id = 20124107,
			quality = 4,
			desc = "心夏参加海滨祭典暨美食大会时的服装。四方各路的美食达人汇集于此，只为争夺本届的“心夏推荐”。当然这其中也包括心夏本人，为此她精心筹备了一种曾经风靡古地球的街边小吃。<br /><br />【“没想到要拿到我自己的推荐居然这么辛苦啊……”】",
		},
		['寻宝专家'] = {
			id = 20124108,
			quality = 4,
			desc = "心夏心目中最浪漫化的探险家形象。出自脍炙人口的动作冒险电影系列。心夏逛遍了古旧服装设计店，一件一件地定制出了这身经典装扮。<br /><br />【“宝藏！到处都是宝藏！嘿嘿，不过比起宝藏，我更喜欢途中遭遇的那些冒险！”】",
		},
		['弦音莲华'] = {
			id = 20124109,
			quality = 4,
			desc = "“幻梦求真录”历史文化展览在沐春期间连续举办，在卡丘人之中掀起了一股仿古风潮。人们仿照古壁画中仙人的服装制式，设计了一系列典雅、精致、飘逸的服装。<br /><br />【“怎么样，这套衣服很适合我吧？古代仙人的传说听了这么多，还是第一次能进行模仿和扮演，真有趣啊！”】",
		},
		['访珍猎秘'] = {
			id = 20124110,
			quality = 4,
			desc = "心夏在希达半岛行动时特制的作战服。其设计采用了当地韵味十足的传统工艺，不仅能适用于全地形的作战环境，还能抵御当地特殊气候带来的问题。<br /><br />【“发掘真相的路千难万险，但勇敢的心会带我们找到希望。”】",
		},
		['邻座师匠'] = {
			id = 20124111,
			quality = 4,
			desc = "手工部部长心夏同学亲自动手改良的制服款式，简洁的外表下增加了大量的工具组件，足以收纳下她所有的灵感和巧思。<br /><br />【“总是学习也太没劲了，说好咯，今天课后我们一起创造些有趣的发明吧。”】",
		},
		['薮椿侍燕'] = {
			id = 20124112,
			quality = 4,
			desc = "治安局的民意支持活动中，心夏作为女仆店店员登场亮相的服装，混合了两种不同文化的设计理念，恰如其分地表达着她本人的不拘一格。但穿着者本人坚称这套衣服的纹饰正是取自自己的品格。<br /><br />【“高洁傲岸，淡雅坚强？没错没错，这说的就是我。”】",
		},
		['晨光织羽'] = {
			id = 20124113,
			quality = 4,
			desc = "心夏为欧泊内部晚会“迷梦芭蕾夜”准备的演出服。服装灵感来自白天鹅在晨光熹微之时展翅的画面，日光透过羽翎，让人迫不及待想要一探她起舞时的优雅身姿。<br /><br />【“哇，好精致的手工！感觉自己会像真正的天鹅一样飞起来！”】",
		},
		['沫夏澄影'] = {
			id = 20124114,
			quality = 4,
			desc = "心夏在“梦想成为幻兽大师”主题活动执勤时穿着的服装，使用了少女钟爱的海兔作为契约的伙伴，轻快的行装装点着远行的愿望，虽然少女口口声声只是为了融入会场，但跳跃的耳朵似乎不这么想。<br /><br />【“我是海兔勇者，快快快，我的海马骑士和章鱼牧师伙伴在哪里！”】",
		},
		['休日冒险'] = {
			id = 20124201,
			quality = 6,
			desc = "心夏休假时穿着的居家服饰。即使身在家中，她也时刻准备着下一场冒险。<br /><br />“不管是外出冒险也好，睡大觉也好，难得的休息日当然要做自己最喜欢的事！”<br />结束了一天的忙碌，心夏换上舒适的居家服，慵懒地躺在家中。<br />身边是成堆的纸箱，和五花八门的道具。<br />其中既有来不及整理的过往回忆，也有前往新的未知天地的必备工具。<br />“哎呀，你也别光看着了，快来给我出点主意。”",
		},
		['机动天使'] = {
			id = 20124206,
			quality = 5,
			desc = "隶属于机动天使队的超弦少女，行动代号：夏日黄，是O.P.A.L为了对抗危害世界的崩溃兽，秘密组建的特殊战队“机动天使”中的一员，用爱与和平的力量前来维护正义。<br />——热门动画《机动天使GEN》官方设定集<br /><br />【“心夏前辈！你看你看，这个动画里的角色好像你啊！”<br />屏幕中播放着机动天使·夏日黄战斗的场景——“红!蓝!这些杂兵就交给我了！别担心，我们不是约好了吗？这场战斗之后，我们一起去吃烤肉吧——”<br />“欸……是吗？哪里像？可是她说完这句话就被敌方的集火击落了啊……我有这么不靠谱吗？”<br />“前辈，这你就不懂了吧？这就是夏日黄的魅力所在！不管立下什么FLAG都能安全回归，不愧是“黄金的不死鸟”，安全感满分！”<br />“嘿嘿，是这样吗？我也想试试说一次这种帅气的台词呢。”<br />“既然这样，下次艾顿城的漫展心夏前辈要不要COS成夏日黄和我一起去？”<br />“好像很有趣的样子，那就算我一个吧！”<br />在那之后，心夏不仅熬夜补完了《机动天使队GEN》，还手工制作了全套的角色道具，出于还原考虑这套装备甚至有着实战能力。在那之后，机动天使的粉丝们之间一度传出了机动天使其实是真实存在的都市传说。<br />“哎呀，我还想着既然要做就做的彻底一点。不过，好像有点过头了？”】",
		},
		['机动天使-黑曜形态'] = {
			id = 20124207,
			quality = 5,
		},
		['机动天使-海蓝形态'] = {
			id = 20124208,
			quality = 5,
		},
		['机动天使-翠玉形态'] = {
			id = 20124209,
			quality = 5,
		},
		['机动天使-樱花形态'] = {
			id = 20124210,
			quality = 5,
		},
	},
	['梅瑞狄斯'] = {
		['箴理'] = {
			id = 20133001,
			quality = 0,
			desc = "由剪刀手尖端科技打造而成的特殊作战服。复杂深奥的设计里汇入了梅瑞狄斯的一生所学。",
		},
		['箴理-石蕊'] = {
			id = 20133002,
			quality = 2,
			desc = "梅瑞狄斯的备用作战服。如同石蕊试纸一般的紫色涂装，以身为尺，测量世界的平衡。",
		},
		['箴理-蓝图'] = {
			id = 20133003,
			quality = 2,
			desc = "梅瑞狄斯的备用作战服。上面有她熟悉的颜色，也许在她心中曾有另一幅关于未来的蓝图。",
		},
		['箴理-热砂'] = {
			id = 20133004,
			quality = 2,
			desc = "梅瑞狄斯的备用作战服。令人想起灼热砂尘的灰粽色涂装，阳光越是热烈，阴影也越是浓稠。",
		},
		['箴理-铜绿'] = {
			id = 20133005,
			quality = 2,
			desc = "梅瑞狄斯的备用作战服。深沉的铜绿色涂装，腐锈的铜绿象征着变化的开始。",
		},
		['箴理-铁红'] = {
			id = 20133006,
			quality = 2,
			desc = "梅瑞狄斯的备用作战服。与剪刀手相衬的红色涂装，旧日的锈刃将开辟铁之道路。",
		},
		['箴理-古树'] = {
			id = 20133007,
			quality = 2,
			desc = "梅瑞狄斯的备用作战服。如同古树一般的深绿色涂装，长久的沉思之后，古树开出了新芽。",
		},
		['箴理-初芽'] = {
			id = 20133008,
			quality = 2,
			desc = "梅瑞狄斯的备用作战服。春日嫩芽般的浅绿涂装，新生的希望需要栽培与呵护。",
		},
		['箴理-萤光'] = {
			id = 20133009,
			quality = 2,
			desc = "梅瑞迪斯的备用作战服。柔和的明黄与她相得益彰，真理也许就隐藏在过去的记忆中。",
		},
		['箴理-钻粉'] = {
			id = 20133010,
			quality = 2,
			desc = "梅瑞迪斯的备用作战服。剪刀手鲜红的意志，与钻石一般坚硬。",
		},
		['海洋呼吸'] = {
			id = 20133051,
			quality = 3,
			desc = "梅瑞狄斯为进行水域实地调查活动而准备的套装。出没于海浪的掩护下，谨慎地行动。",
		},
		['对撞理论'] = {
			id = 20133052,
			quality = 3,
			desc = "黑与白的大面积混搭，究竟哪一面才是真正的她？梅瑞狄斯就像是这件衣服一样捉摸不定。",
		},
		['核心冲突'] = {
			id = 20133053,
			quality = 3,
			desc = "为梅瑞狄斯定制的特殊服装。棱形核心是她内心决意的体现，尖锐，理性，绝不动摇。",
		},
		['幽谷独兰'] = {
			id = 20133054,
			quality = 3,
			desc = "冷艳的紫罗兰绽放于空白的荒野，不为他人，独自绚烂，幽谷独兰，孤芳无需赏。",
		},
		['天平裁决'] = {
			id = 20133055,
			quality = 3,
			desc = "体现天平这一意象的典雅套装。公正而高洁的裁定者将为世界下达判决。",
		},
		['咖啡因依赖者'] = {
			id = 20133056,
			quality = 3,
			desc = "为在深夜中保持清醒与敏锐，梅瑞狄斯一直在苦寻一款好用高效的提神饮料——直到她尝试了某家医疗机构的“星芒咖啡”。仅浅尝一口，她便爱上那份石油般的口感，三日不眠不休的功效对她来说亦恰到好处。",
		},
		['沙尘冒险家'] = {
			id = 20133101,
			quality = 4,
			desc = "为欧泊工作时，梅瑞狄斯曾亲自带队前往真实荒野区域探索，这套凝聚着冒险精神的服装亦由她本人亲手设计。<br /><br />【“若因对未知的恐惧而止步于探索边缘，人类的勇气和未来将因此缺失一角。”】",
		},
		['漫影绘客'] = {
			id = 20133102,
			quality = 4,
			desc = "尽管一开始只是出于好奇的尝试，但梅瑞狄斯很快就发现——她很享受在漫画中绘制出自己理想的世界，这成了她不为人知的业余爱好。<br />但是，即使在漫画的世界里，也同样有着不可调和的矛盾——那就是每一个漫画家都必须与之对抗的，名为截稿日的魔王。<br /><br />【“对，是我…推迟下次的作战。理由？没什么，只不过是要退治一下魔王。”】",
		},
		['魔术礼仪'] = {
			id = 20133103,
			quality = 4,
			desc = "在普雷顿义演时，梅瑞狄斯为流离失所的孩子表演节目时穿着的服装，尽管表情依旧一板一眼，但这位魔术师依旧受到了孩子们的欢迎。<br /><br />【“魔术也不过是一种定量的技术罢了。”】",
		},
		['全局观察'] = {
			id = 20133104,
			quality = 4,
			desc = "经过梅瑞狄斯个人改造，考究而专业的咖啡厅工作装。配合精准的钟表器械，咖啡厅的一切动向都在她的观察之下。<br /><br />【“客人，关于你的事情，我可以近距离观察记录么？”】",
		},
		['守护者'] = {
			id = 20133105,
			quality = 4,
			desc = "梅瑞狄斯参加古文明主题活动时的装扮，以华美古典之风还原了月亮之神的神话造型，既充斥着月亮的温柔，又凸显了着装者猫一般的迷人身姿。<br /><br />【“神守护着万民安康，而我也在见证着属于我们的繁荣。”】",
		},
		['自由蓝调'] = {
			id = 20133106,
			quality = 4,
			desc = "梅瑞狄斯的乐队演出服。以大胆酷炫地裁剪与设计，表达了梅瑞狄斯对摇滚精神的理解。除了实验台上的严谨肃穆，作为学者的梅瑞狄斯也同样向往着没有约束的自由。<br /><br />【“摇滚包含着自由与探索的品质，这与科学精神不谋而合。”】",
		},
		['远方来客'] = {
			id = 20133107,
			quality = 4,
			desc = "不知何时出现在地下沙龙的神秘客人，没有人知道她的来意，也没有人知道她携带的秘密。<br /><br />【“我们真的是第一次见面吗？总觉得就连这个疑问，都曾经被发出过许多次呢。”】",
		},
		['潜海定锚'] = {
			id = 20133108,
			quality = 4,
			desc = "庆典园游会总设计师梅瑞狄斯参加泳池派对时穿着的服装。面料特殊，不光适用于日常的游泳运动，也可以穿着浮潜。<br /><br />【“你说得没错，参与庆典的人们，和他们在此感受到的快乐与感动，也是一场完美庆典必不可少的部分。”】",
		},
		['幽影之魔女'] = {
			id = 20133109,
			quality = 4,
			desc = "在惊魂节游行评选中以最高票数夺得最佳装扮奖的选手“暗夜与幽影之魔女”，其真实身份是剪刀手的大脑——梅瑞狄斯。魔女能看透人心这一点，倒是和梅瑞狄斯本人十分符合呢。<br /><br />【“你说参赛用的名字？随便取的，这只是对造型上的客观描述，什么中二病之类的，听不懂你在说什么。”】",
		},
		['子夜孑音'] = {
			id = 20133110,
			quality = 4,
			desc = "为了融入霓之城的夜幕，梅瑞狄斯换上了她并不习惯的街头风格。而耳机能够帮她隔绝城市的浮躁与嘈杂，使她保持那一贯的自我。<br /><br />【“我将指引霓之城的所有人，就像你指引我一样。”】",
		},
		['执羽司祭'] = {
			id = 20133111,
			quality = 4,
			desc = "“溯光者”梅瑞狄斯的战服，以羽翼为袍托起真理，用锋喙做甲拱卫正义，掌控风暴的司祭将承继崇高的仪典，相伴荆棘与花蕊，迎来黎明。<br /><br />【“不要犹疑，穿越晦暗的风沙，日出一定就在那里。”】",
		},
		['砾金贤狼'] = {
			id = 20133112,
			quality = 4,
			desc = "掌控着“岩砂”的魔灵使梅瑞狄斯的战斗服，黑曜石被魔力所柔化，金色的流沙吟诵着秘法，她是岩漠，是荒芜混沌中觉醒的奇迹。<br /><br />【“奇迹不是在沙漠中跪下祈雨的双膝，而是迎着风沙求索绿洲的足迹。”】",
		},
		['鸿运巧术'] = {
			id = 20133113,
			quality = 4,
			desc = "沐春节期间，工作总要停一停，架不住伙伴软磨硬泡的邀请，梅瑞狄斯只能换上早就为自己准备好的礼服，加入一起玩耍的队列。<br /><br />【“规章上有说必须要展示才艺吗？……我回头就改了它。”】",
		},
		['诡筹三叶'] = {
			id = 20133114,
			quality = 4,
			desc = "虽然不情愿，但这个兼具快速计算、临场指挥、技术指导、身份伪装的工作只能由梅瑞狄斯亲自完成。不过她坚持认为，这身衣服并非必要。<br /><br />“这是一场心理博弈，一旦你的注意力分散到不该去的地方，便必输无疑。”",
		},
		['菘菁碧璋'] = {
			id = 20133115,
			quality = 4,
			desc = "梅瑞狄斯化身古老部落的祭司，身披太阳与飞鸟的章纹，带来真理与哲思跨越时空的传讯。即便过去的图腾已经消散，她将带领族人寻找新的明天。<br /><br />【“时空流转，唯真理永恒。”】",
		},
		['阿卡西之眼'] = {
			id = 20133206,
			quality = 5,
			desc = "阿卡西，这是一切的起源，也是一切的终点。过去、现在、未来皆被记录在阿卡西档案中，静待宇宙无声的翻阅。<br /><br />【“从来都是神明造物，可如若无穷的智慧被凝结于一物，便出现了物造的神明。我是翻开档案的人，亦是祂的眼睛。”】<br /><br />【梅瑞狄斯时常会听到一个声音，从幼时有记忆开始，那个声音陪伴着她入睡与醒来，解答她的困惑与猜想。<br />这是个无法辨别出性别和年龄的声音，悠远而飘渺，仿佛来自遥远的宇宙，又似乎根植于她的脑海。梅瑞狄斯并不为此感到困扰，她习惯这个声音就像习惯自己承载意识的躯体。作为学者，她对万事万物都有探究的兴趣，除了这个声音——她坚信命运终会让祂们遇见彼此，在这之前，只需要耐心等待。<br />多年之后，梅瑞狄斯对阿卡西档案的研究进入了收尾阶段。整个宇宙的经历和记忆都被收束在她创造出的小小装置内。那些状似流动的液体从未淌出过她的掌心，却也从未真的让她触碰。<br />“终于见到你了。”<br />这一回，她看清了时间彼端的身影，听到了那个如叹息一般，来自她自己的声音。】",
		},
		['阿卡西之眼-磷墨'] = {
			id = 20133207,
			quality = 5,
		},
		['阿卡西之眼-淬金'] = {
			id = 20133208,
			quality = 5,
		},
		['阿卡西之眼-苍玄'] = {
			id = 20133209,
			quality = 5,
		},
		['阿卡西之眼-砂蚀'] = {
			id = 20133210,
			quality = 5,
		},
	},
	['星绘'] = {
		['星佑'] = {
			id = 20146001,
			quality = 0,
			desc = "星绘于星庇所内工作时所着的裙装，其间闪烁的星辰图案象征着星庇所救死扶伤的理念。",
		},
		['星佑-青柠'] = {
			id = 20146005,
			quality = 2,
			desc = "星绘的备用工作服。略带酸涩的青，增添了少女的魅力。",
		},
		['星佑-青叶'] = {
			id = 20146006,
			quality = 2,
			desc = "星绘的备用工作服。叶片般的裙装掩映间，星辰纹样若隐若现。",
		},
		['星佑-神秘'] = {
			id = 20146007,
			quality = 2,
			desc = "星绘的备用工作服。幽蓝的裙装，令少女显得神秘莫测。",
		},
		['星佑-踏云'] = {
			id = 20146008,
			quality = 2,
			desc = "星绘的备用工作服。裙裾飘舞，如一朵紫色流云。",
		},
		['星佑-海旗'] = {
			id = 20146009,
			quality = 2,
			desc = "星绘的备用工作服。海蓝色的裙装，映衬出少女的风姿。",
		},
		['星佑-南瓜派'] = {
			id = 20146010,
			quality = 2,
			desc = "星绘的备用工作服。温暖的橙黄色，让人想起灯火与美食。",
		},
		['星佑-盛宴'] = {
			id = 20146011,
			quality = 2,
			desc = "星绘的备用工作服。庄重的紫红色，最适合出现在盛大的晚宴上。",
		},
		['星佑-紫微星'] = {
			id = 20146012,
			quality = 2,
			desc = "星绘的备用工作服，淡雅的紫色，也是北极星的另一种别称。",
		},
		['糖果之夏'] = {
			id = 20146053,
			quality = 3,
			desc = "糖果为裙装点缀了虹色，少女的气息也随之绽放于夏日。下一颗彩虹糖，会是什么颜色呢？",
		},
		['荆棘公主'] = {
			id = 20146054,
			quality = 3,
			desc = "缀以金纹的深青裙装，在星绘身上就如同华丽的公主。小心，不要随便对她伸出手，荆棘可是带刺的。",
		},
		['紫羽夜鸦'] = {
			id = 20146055,
			quality = 3,
			desc = "典雅的紫色裙装。衬托出星绘高雅神秘的气质。这套衣裙与星绘很相称，但背后的故事，她却从来闭口不谈。",
		},
		['青提冻饮'] = {
			id = 20146056,
			quality = 3,
			desc = "摇曳的碧裙清新亮眼，甜美得宛如夏日凉风。与身着这套衣裙的星绘对谈，也如喝下一杯甜美的冷饮一般，沁人心脾。",
		},
		['夏夜之梦'] = {
			id = 20146058,
			quality = 3,
			desc = "夏夜，月升，风吹草动，蜻蜓扑腾。在她身边，闭上眼睛，享受这宁静一刻。",
		},
		['梦境茶会'] = {
			id = 20146101,
			quality = 4,
			desc = "梦幻般的裙装，华丽绽于衣袂的繁复之中，究其灵感，似乎源于某广为流传的童话故事。<br /><br />【“梦的世界里有什么呢？”<br />“皇后、茶会、好看的衣服？”<br />“除此之外呢？”<br />“还有引航的白兔前……啊不，是白兔先生！”<br />人们总以为少女的梦境流连于童话，只有无端的华美和幻想。<br />不过也有着关于某些真实人物的记忆呢。】",
		},
		['疗心天使'] = {
			id = 20146102,
			quality = 4,
			desc = "天使般纯然的护士服，温柔的外表下，却隐隐透露着危险的意味。<br /><br />【“您的病情还没稳定下来，可千万不要随意走动呀。”<br />“不如在这里多住一阵子吧？”<br />“……永远留在这里怎么样？”<br /><br />在那个仅属于她的故事里，她将永远守护着你，直到时间的尽头。】",
		},
		['田间漫步'] = {
			id = 20146103,
			quality = 4,
			desc = "星绘为田园旅行特别设计的服装，以“园艺师”为主题，色调是清新的绿色。住进充满田园气息的小屋，嗅闻清新凉爽的空气，身边有好友相伴，或许，这就是返璞归真的快乐吧。<br /><br />【“久等了，今天你独自照看牧场，真是辛苦啦。让我把这只向日葵送给你，再给你介绍个新朋友。”】",
		},
		['漫步苍穹'] = {
			id = 20146104,
			quality = 4,
			desc = "星绘在太空体验馆所穿着的实验性穿梭服。该服装使用多种聚合物材料构成，在保温性和抗冲击方面都有着不错的水平。但曾经是为了保证星际航行中使用的装备，而现如今只能存放在场馆之中供人体验。<br /><br />【“在迈上太空之前，我们却走向了维度的迷雾。——展品说明标签上，是这么说的呢。”】",
		},
		['游园回忆'] = {
			id = 20146105,
			quality = 4,
			desc = "星绘为了参加游乐园活动精心搭配的装束。清爽的牛仔外套给人以别样的心动感觉，悄悄拉下圆帽的时候又能遮住她那双害羞的眼睛……<br /><br />【“还有很多项目没有体验呢，那个……可以不用看着我也可以的哦？”】",
		},
		['晚秋星意'] = {
			id = 20146106,
			quality = 4,
			desc = "星绘为了准备流星雨的夜间观测而准备的服装。稍显较厚质地的服装能够在夜晚也提供充足的保温，不失可爱的版型设计更是衬托出了星空下的她那一份质朴的美丽。<br /><br />【“流星的美丽在于它划过黑夜所带来的一丝光亮，而我们就像这流星雨，划过夜空，遇见彼此。”】",
		},
		['三色花容'] = {
			id = 20146108,
			quality = 4,
			desc = "以花朵为主题，加入了盘扣、流苏等要素的传统服饰。<br />白色代表纯洁，紫色象征忧悯，黄色寓意温婉，就像她本人一样，无私的疗愈着这个世界的一切。<br /><br />【沉默，也是一种无言的爱。】",
		},
		['锦衣夜游'] = {
			id = 20146109,
			quality = 4,
			desc = "星绘主持沐春前夜星庇所活动时的装束。精心装扮的裙裳掩盖不了她想同最重要的人一同夜游的心情。<br /><br />【“前辈，团圆夜活动之后，可以和我看看夜景吗？就我们两个人。”】",
		},
		['星咏幽歌'] = {
			id = 20146110,
			quality = 4,
			desc = "手持烛台的女仆笑意盈盈，在任何你需要的时候出现在面前。她似乎无所不知，也总是无所不在。究竟她是这座庄园的缩影，抑或这座庄园是她的化身？<br /><br />【“如果需要帮助，请一定要及时告诉我，我……什么都会为您做的。”】",
		},
		['星潮帷幕'] = {
			id = 20146111,
			quality = 4,
			desc = "星绘作为摄影师，参加海滨竞速俱乐部活动时穿着的服装。以深蓝色为主体的泳衣搭配上浅蓝的轻纱装饰，让人一时分不清散落其中的究竟是星光还是浪花。<br /><br />【“前辈很好奇，为什么我随身带着照相机？因为能将这些美好场景定格的机会并不多，我一定要好好珍惜。”】",
		},
		['绯夜鸣奏'] = {
			id = 20146112,
			quality = 4,
			desc = "星绘参加合唱团排练时的特殊服装，统一而规整的制式勾勒出少女姣好的身材和优雅的姿态。在夜空之下，星绘和少女们抬头仰望，唱起无名的歌谣，希望这份祝愿能被星星接收到。<br /><br />【“虽然是夜晚的排练，但是这套服装意外很保暖呢，不会受凉的。诶，前辈说像打歌服……？”】",
		},
		['暗夜绮梦'] = {
			id = 20146113,
			quality = 4,
			desc = "这是为万圣节剧本《血之契约》专属定制的服饰。当摇曳的烛火渐次点亮昏暗的宴会厅，血族少女星绘的盛宴已然揭开序幕。或许今夜，她将以魅惑之姿洗礼你的灵魂，引你坠入这场暗夜绮梦。<br /><br />【“你选择这颗恶魔的果实，还是这杯甘醇的鲜血？”】",
		},
		['星幕垂语'] = {
			id = 20146114,
			quality = 4,
			desc = "这特别的一夜，值得星绘换上自己的新装，去做一个徜徉流连的游人，是想要享受这热闹又恬静的庆典，还是想要寻求她心中默念的遇见？或许此夜少女的心事和花火一样，瞬息万变。<br /><br />【“我喜欢烟花绽放的瞬间，但我更希望能一直看见星星点亮的长夜。”】",
		},
		['谣星牧云'] = {
			id = 20146115,
			quality = 4,
			desc = "星绘在“梦想成为幻兽大师”主题活动当志愿者时穿着的服装，使用了柔软的云朵装饰少女美好的身影，虽然夜幕还未落下，但怀抱星星的少女手中的温柔，一定会给你一整天的舒心和惬意。<br /><br />【“星星不会说话，但它们邀请我为大家降下温柔的魔法。”】",
		},
		['仲夏星夜'] = {
			id = 20146201,
			quality = 6,
			desc = "星绘休憩时经常穿着的居家服。只有她最熟悉的人才有机会一睹其容。<br /><br />“前辈有好好注视过这片星空吗？”<br />“据说，每个人都有一颗属于自己的星辰，它在宇宙里孤独地等待着，希望有一个人能与它遥遥相望。”<br />“如果有一天，前辈遥望天际的时候发现了一抹别样的光芒，那大概就是前辈的星辰正在眨眼吧。”<br />“前辈问我的星辰在哪里？那……那是秘密。”<br />少女从未曾停止对夜空的追寻。<br />在无数个与星光对视的夜晚里，少女等待着那颗星星，自浩瀚渺茫的星海里捕捉属于自己的光芒。<br />有一天，星星眨眼了。<br />整片夜空都改变了颜色。",
		},
		['逆影蔷薇'] = {
			id = 20146206,
			quality = 5,
			desc = "劲装风格的骑士服。优雅华美的外形下，隐藏着利剑般的凛然气质。<br /><br />【瑰丽的宫廷剑士向着远方眺望。<br />战场哭嚎，血涂四方。<br />装饰蔷薇的利剑刺穿了敌人的心脏。<br />蔷薇染血，逆影怒放。<br />思念如风，飘向远方。<br />“花期为君，死又何妨？”】",
		},
		['逆影蔷薇-荆'] = {
			id = 20146207,
			quality = 5,
		},
		['逆影蔷薇-耀'] = {
			id = 20146208,
			quality = 5,
		},
		['逆影蔷薇-苍'] = {
			id = 20146209,
			quality = 5,
		},
		['逆影蔷薇-寂'] = {
			id = 20146210,
			quality = 5,
		},
		['沐春灼华'] = {
			id = 20146211,
			quality = 5,
			desc = "当司春神女自百花间款款而来，人们便会感受到拂去料峭春寒的暖意，与抚慰心灵的芬芳。流霞织就的霓裳让神女倾城绝艳，但唯有她自己知晓，她仍是那个想要守护每个良善之人的女孩。<br /><br />【“我心菁菁，春露在襟；我意蓁蓁，春风惠庭。”】<br /><br />花朝典仪，是一个只在古籍里留下零星记载的祭礼。<br />没有仪式与规制，没有行程与礼节。<br />像一段流落在无限时光里的孤独回忆，像一个找不到回乡之路的归人。<br />泛黄纸页上的寥寥数语，却反复让星绘的心悸动。<br />她想到了许多，那些无法重构的序列，那些仍在祈求明天的灵魂。<br />是记忆，也是传承。<br />更是她想要背负的责任。<br />但穷尽求索，星绘也只找到了花朝典仪的意义：一场于春光洒落之间，传递希望的祭礼。<br />若希望迷离，那便由我唤醒。<br />她竭尽全力地复现着这场残缺的典仪，一朵花，一枝叶，一点妆，一段锦。<br />直至寒阳渐落，月上柳梢，人们感叹着沐春的仪式有些低迷之际，万花吐绽出了这个春天最沁人的暖意。<br />她捧着星辉而来；她点落月光而来；她踏着薰风而来。<br />她洒落浅碧深红，向着她深爱的世界而来。<br />沐春的祭礼，在此再放异彩。<br />而司春神女的传说，也会再次流传开来。<br />“拂栏千姝色，云裳弄春霏，愿落瑶台种，星谪人间风。”",
		},
		['沐春灼华-将离'] = {
			id = 20146212,
			quality = 5,
		},
		['沐春灼华-解语'] = {
			id = 20146213,
			quality = 5,
		},
		['沐春灼华-梨霜'] = {
			id = 20146214,
			quality = 5,
		},
		['沐春灼华-幽兰'] = {
			id = 20146215,
			quality = 5,
		},
	},
	['令'] = {
		['暗匿'] = {
			id = 20109001,
			quality = 0,
			desc = "令最为青睐的服装搭配。舒适简约，实用可靠，沉稳中流溢着一位战士最坚定的意志。",
		},
		['暗匿-暗夜红'] = {
			id = 20109005,
			quality = 2,
			desc = "令常用作战服的备用款。功能完备，战斗能力与原款相当。<br /><br />【不要停止抗争，也不要失去希望。】",
		},
		['荧火'] = {
			id = 20109006,
			quality = 2,
			desc = "在荧火汇聚成皓月之前，<br />我未曾见过真正的月色。",
		},
		['暗匿-紫夜'] = {
			id = 20109002,
			quality = 2,
			desc = "令常用作战服的备用款。神秘紫色的内衬，包裹着他重重的心事。",
		},
		['暗匿-余晖'] = {
			id = 20109003,
			quality = 2,
			desc = "令常用作战服的备用款。不论在怎样的黑暗中，他都怀抱着一丝希望的余晖。",
		},
		['暗匿-幽歌'] = {
			id = 20109004,
			quality = 2,
			desc = "令常用作战服的备用款。幽蓝的色调，仿佛一支满怀愁绪的歌。",
		},
		['暗匿-律己'] = {
			id = 20109007,
			quality = 2,
			desc = "令常用作战服的备用款。军绿的色彩，代表着他对自己的戒律。",
		},
		['暗匿-苍青'] = {
			id = 20109008,
			quality = 2,
			desc = "令常用作战服的备用款。浅青色的内衬，象征着他心中依旧保有的明净天空。",
		},
		['暗匿-玄绿'] = {
			id = 20109009,
			quality = 2,
			desc = "令常用作战服的备用款。黯淡的绿，就像他那几近枯萎，却依旧不灭的希望。",
		},
		['暗匿-晨光'] = {
			id = 20109010,
			quality = 2,
			desc = "令常用作战服的的备用款。鲜明如晨光的内衬与深色的外套形成强烈反差，他很少穿着。",
		},
		['暗匿-熹微'] = {
			id = 20109011,
			quality = 2,
			desc = "令常用作战服的的备用款，黑夜与白昼的中间调，宛如清晨间的日升一样温热。",
		},
		['战场医师'] = {
			id = 20109053,
			quality = 3,
			desc = "雪白简练的衣衫，让令看上去像个年轻的医生。但实际上，他只精通战场上的紧急处理。一切，都是为了胜利。",
		},
		['电能奔涌'] = {
			id = 20109054,
			quality = 3,
			desc = "浅蓝的牛仔服，充满着活力与激情。与之相对的，是令冷漠的面容。在冰山一般的外表之下，能量正汹涌澎湃着。",
		},
		['特种强袭'] = {
			id = 20109055,
			quality = 3,
			desc = "身为狙击手的令也曾参与正面战场，身着丛林风格装扮，勇敢而又无情。在任务时刻到来前，他永远能够保持耐心。",
		},
		['海盗船长'] = {
			id = 20109056,
			quality = 3,
			desc = "这套服装饰以交叉的刀剑和神秘的触须，就如同古代海盗的船长服。令从不惧怕深海的诅咒，因为，他自己早已诅咒了自己。",
		},
		['热力燃烧'] = {
			id = 20109057,
			quality = 3,
			desc = "与令的冷漠印象相反，绘制着熊熊烈火的服装。即使是最为冰冷的工具，也需要热力来驱动。",
		},
		['禁止通行'] = {
			id = 20109058,
			quality = 3,
			desc = "人们追随剪刀手并不是因为强大的武力，而是那份建设新秩序的决心，为了崇高的理念，令不介意做那些微小的工作，并乐此不疲。",
		},
		['致命忠仆'] = {
			id = 20109101,
			quality = 4,
			desc = "令在执行窃听任务时穿着的服装。<br />融入环境是特工的一环，哪怕是在咖啡厅，亦是如此。<br /><br />【“今日会降下一些……不一样的雨。”】",
		},
		['深海潜将'] = {
			id = 20109102,
			quality = 4,
			desc = "令在海滨度假时，为自己准备的水下装束。尽管以功能性为主，却也有许多花哨的小饰物。或许，他的小心思比表面上要多得多。<br /><br />【“呼……哪怕是海中，也有那么多美丽的珊瑚啊。”<br />潜水结束，从海中浮上的令，露出了一抹浅浅的微笑。<br />平时那样冷漠的他，看上去发自内心地享受着这次海滨之旅。<br />“别那么紧张嘛，平时的我，其实还挺好相处的。”<br />总觉得，你看到了令极少向人展露出的一面。】",
		},
		['驭电先锋'] = {
			id = 20109103,
			quality = 4,
			desc = "为驾驭实验性的高能电磁武器而设计的特殊作战服。根据令的作战经验，着重强化了绝缘防护能力。<br />无言的狙击手驾驭着澎湃能量抵达战场——<br /><br />【“小心。漏电。”】",
		},
		['星空遥梦'] = {
			id = 20109104,
			quality = 4,
			desc = "令根据旧时代的宇航服定制的私人服装。虽然一部分如实进行了还原，但是为了面对随时突如其来的任务，还是改造成了方便战斗的样式。如果没有争斗也许他也会选择登上宇宙的道路，将自己的奇思妙想挥洒在浩瀚的星空之中吧。<br /><br />【“气压正常，温度正常……嗯，可惜要是能还原推进装置就好了。”】",
		},
		['古玩游商'] = {
			id = 20109106,
			quality = 4,
			desc = "令用于潜入黑市的特殊装备。强调了东方神韵的神秘感和个人特色，身上的吊坠是令用废石打磨而成的，并非真品的古玩，但也能以假乱真。<br /><br />【“呵……真是好眼光，这可是尖子货啊。”】",
		},
		['修理达人'] = {
			id = 20109107,
			quality = 4,
			desc = "乡村生活可不止有田野和牧场，一定也少不了一位水电家装样样精通的修理达人。房屋漏水？电器短路？不管要修理的是什么，总之找他就对了。<br /><br />【“什么？你说要修理的不是电器，是欧泊的治安小队？好吧，也没问题。”】",
		},
		['冰川旅人'] = {
			id = 20109108,
			quality = 4,
			desc = "想要进行极地探险，一套足够保暖的装备必不可少。因此，令对自己常用的作战服进行了特殊改造，添加了即使在极寒环境下也能恒温的零温差功能，色调也采用了冰川蓝，让人与自然融为一体。<br /><br />【“这是个不小的挑战，但我做到了。冰川只是第一步，之后，我会通过改造作战服来征服更多环境。”】",
		},
		['异域行商'] = {
			id = 20109109,
			quality = 4,
			desc = "“幻梦求真录”历史文化展览在沐春期间连续举办，在卡丘人之中掀起了一股仿古风潮。人们仿照古壁画中仙人的服装制式，设计了一系列典雅、精致、飘逸的服装。<br /><br />【“这套服装穿着舒适，对于一些特殊部位的改造也很精巧，不过这个匕首如果由我来改造的话，还要再调整一下手柄的弯曲程度……”】",
		},
		['驱逐协议'] = {
			id = 20109110,
			quality = 4,
			desc = "作为隐藏于现代社会的驱魔师，令曾想过自己是否要在着装上尽可能保持低调，毕竟在许多人眼中，“驱魔”本就是只存在于影视、动漫中的行为。但当他将传统驱魔装束进行改良后，却受到了一些人的围观。<br /><br />【“你们误会了，这并不是角色扮演……等等，也不是不行……”】",
		},
		['无染夜曲'] = {
			id = 20109111,
			quality = 4,
			desc = "令在嘉年华会场上穿着的定制礼服，无论春夏寒暑，也无论哪一个场合，他都是那个隐于你未曾注意的角落，却又在你需要时令你移不开眼睛的守护者。<br /><br />【“一切都已安排妥当，请您尽情享受这个特别的夜晚。”】",
		},
		['轻冷巧匠'] = {
			id = 20109112,
			quality = 4,
			desc = "火热的工坊实在不适合待客，善待友人的匠人稍加思索就想到了破解的方法，要给气氛和心情降温，想必要从自己开始，虽然他不理解为什么大家变得更加拘谨了。<br /><br />【“抱歉，工坊温度不能调低，但希望我的工服能让你感觉凉快一些。”】",
		},
		['后翼弃兵'] = {
			id = 20109105,
			quality = 4,
			desc = "令参加西洋棋表演赛时的服装。软呢帽的配饰以及超宽的翻领使造型在优雅之中增添了几分闲适。平光镜的存在修饰了脸型，再加上染色的头发，如果不是熟人的话，一定不会认出自己吧？<br /><br />【“教过你多少次了，后翼弃兵的目的是为了保障中央棋盘的安全，不要在这种时候太过在意一枚‘兵’的生死。”】",
		},
	},
	['白墨'] = {
		['无羁'] = {
			id = 20110001,
			quality = 0,
			desc = "白墨执行任务时所着的佣兵服。强调实战的同时融入了街头元素，利落洒脱，自由无羁。",
		},
		['无羁-野营'] = {
			id = 20110002,
			quality = 2,
			desc = "白墨的备用佣兵服。像是个还未成熟的大男孩，正准备开始一场快乐的野餐。",
		},
		['无羁-湖畔'] = {
			id = 20110003,
			quality = 2,
			desc = "白墨的备用佣兵服。湖蓝的衣着潇洒俊逸，代表着他奔放的心。",
		},
		['无羁-粉樱'] = {
			id = 20110004,
			quality = 2,
			desc = "白墨的备用佣兵服。尽管不羁，却也不失浪漫与雅致。",
		},
		['无羁-青野'] = {
			id = 20110005,
			quality = 2,
			desc = "白墨的备用佣兵服。如他童年梦中，那片广袤的绿野。",
		},
		['无羁-落叶'] = {
			id = 20110006,
			quality = 2,
			desc = "白墨的备用佣兵服。如秋日之下，随自由之风起舞的落叶。",
		},
		['无羁-深海'] = {
			id = 20110007,
			quality = 2,
			desc = "白墨的备用佣兵服。他曾搏击浪涛，也曾潜入海底。",
		},
		['无羁-尘沙'] = {
			id = 20110008,
			quality = 2,
			desc = "白墨的备用佣兵服。沙海之中，自由之声将扬起新的风暴。",
		},
		['金牌料理人'] = {
			id = 20110051,
			quality = 3,
			desc = "饰以双鱼和竹叶纹样的料理人服装。让人想起了寿司的香气。对白墨来说，唯有自由……与美食不可辜负。",
		},
		['碳酸活力'] = {
			id = 20110052,
			quality = 3,
			desc = "印有可乐图案的卫衣款战斗服。与白墨的气质十分契合。身穿这件战斗服的白墨，也如同被摇晃过的可乐一般，充满了激情与跃动的活力。",
		},
		['太空舞步'] = {
			id = 20110053,
			quality = 3,
			desc = "宇航服样式的战斗服。不仅体现出白墨特立独行的性格，更有种充满幻想的优雅感。",
		},
		['高速车手'] = {
			id = 20110054,
			quality = 3,
			desc = "黑绿间杂，赛车手款式的战斗服。在白墨身上显得倜傥不群。速度与激情，正是白墨喜欢的词句。",
		},
		['椰子特饮'] = {
			id = 20110055,
			quality = 3,
			desc = "有着清爽的蓝白色调的休闲服装。坐着躺椅，听着海风，来上一杯清凉的椰子水，悠闲享受度假时光。",
		},
		['浓缩咖啡'] = {
			id = 20110056,
			quality = 3,
			desc = "白墨的咖啡师装扮。据说他曾以这身打扮悄悄在乌尔比诺某家咖啡厅工作过半个月。",
		},
		['面包师之梦'] = {
			id = 20110101,
			quality = 4,
			desc = "白墨亲手设计的面包师制服。这套服装版型前卫，内衬舒适，只是，近来的他，却没什么机会穿上这套衣服。<br /><br />“嗨，你看，这款蓝莓奶酥面包色泽金黄，松软绵密，吃起来酸甜可口，是我亲自烘焙的哦。”<br />白墨曾悄悄潜入旗下的一家面包店内，作为普通的面包师辛劳了好几天。<br />看到人们微笑着品尝他烘焙的面包时，他的心中不禁油然而生一股喜悦之情。<br />至今，那段时光仍是他最美好的回忆之一。",
		},
		['整修王牌'] = {
			id = 20110102,
			quality = 4,
			desc = "传闻，有一位不定期出现在整修铺里，技术高超的青年。无论什么样的车辆故障他都能搞定，无论怎样老旧的赛车，只要经他的手修理调整，车辆性能都会得到提升。人人都称赞他的修理技术，不过很少过问他的身份。这正是他想要的效果。<br /><br />“看看，我修的如何？还没有我这把扳手搞定不了的。”<br />“不过，你这辆车的零件磨损也太严重了。我说，你得珍惜你的伙计啊。”<br />“…好像在别的地方见过我？这个嘛，这座城市这么大，谁知道是在哪呢？你就别在意了。”",
		},
		['时代冲击'] = {
			id = 20110103,
			quality = 4,
			desc = "近未来风格的运动装，色彩鲜明，款式时尚。白墨在这套服装上，加入了不少独属于自己的小设计。<br /><br />【“呀，被你发现了！你也是来带我回去的吗？”<br />明明已被逼到穷途末路，白墨的脸上，却挂上了一抹狡黠的微笑。<br />”我可不是在偷懒，乌尔比诺需要一位自由的领袖。把我关在办公室里，可是最大的浪费。”<br />在你被他的演讲吸引注意的同时，他纵身一跃，用纯熟的街头跑酷技巧逃出了你的视野范围。】",
		},
		['苍天牧歌'] = {
			id = 20110104,
			quality = 4,
			desc = "运用了过去的草原民族服装元素进行设计，融合了白墨的个人巧思和创想。<br />以天为盖，以地为席，苍茫天地，四海为家——这样自由的生活正可谓白墨所追求的理想。<br /><br />【“天高云阔，任我遨游，再没有比这更自由的感觉了！”】",
		},
		['怪盗英雄'] = {
			id = 20110105,
			quality = 4,
			desc = "《怪盗英雄》电影的改装款夜行衣。硬朗修身的设计很符合白墨对于美观、舒适的追求。只是，在加入了定制绷带和荧光眼镜后，闪亮的效果与其设计初衷相距甚远。<br />镜子前的白墨正对自己的品味赞叹不已，可紧接着发生的事情却让他终生难忘。<br /><br />【“嗯，偶尔扮演一下夜行侠也不错。欸——别抓着我啊，我可不是小偷！”】",
		},
		['气质号手'] = {
			id = 20110106,
			quality = 4,
			desc = "白氏集团特别定制的演出礼服。穿上这身衣服的白墨举手投足都散发着沉稳庄重的气质，如果他不开口说话的话……<br /><br />【“我的音准还不错吧！”】",
		},
		['超能奇袭客'] = {
			id = 20110107,
			quality = 4,
			desc = "在电玩比赛报名现场出现的神秘男子，尽管他用墨镜、帽子、假胡子做了三重伪装，但是围观的群众还是辨认出了他的真实身份。<br /><br />【“我只是一名普通玩家，主办方什么的简直是天方夜谭！我为电玩比赛出过力，我要当选手！”】",
		},
		['入幕之宾'] = {
			id = 20110108,
			quality = 4,
			desc = "当白墨换上西服，收敛笑意时，属于乌尔比诺少主的那份沉稳才显现出来。<br /><br />【“你是贵客，当然要享受最好的服务。至于我们要聊的事……不着急，慢慢来。”】",
		},
		['自由所向'] = {
			id = 20110109,
			quality = 4,
			desc = "在人头攒动的盟主选举现场，伴随着一阵强劲的音乐，一道绿色闪电驰骋而来。不同于往日浪迹街头的街舞小子、涂鸦大王，今日的白墨盛装出席，风度翩翩，但是他的嘴角依旧挂着那抹向往自由意志的标志性微笑。<br /><br />【“如果我能连任的话，就一个月休三十天吧！”<br />面对台上台下浪潮般的欢呼与掌声，白墨不由得惊叹道。<br />“哟呵，大伙比我还要热情啊~”】",
		},
		['万人迷南瓜头'] = {
			id = 20110110,
			quality = 4,
			desc = "在惊魂节游行评选中以最高票数夺得最抽象奖的选手“万人迷南瓜头先生”，其真实身份是乌尔比诺联盟盟主——白墨！对于获得这个奖项，抽象之神实至名归！只是南瓜头似乎让他的方向感变差了，截止到目前，他还没有来领走属于自己的奖杯。<br /><br />【“不好意思啊，刚刚冲刺到反方向了，现在应该还可以领奖吧？最抽象奖……？你们是不是评错人了？我难道拿的不是最具人气奖吗？”】",
		},
		['赛场终结'] = {
			id = 20110111,
			quality = 4,
			desc = "作为主办方代表，这位年轻的乌尔比诺盟主在比赛开幕式上一经亮相，就吸引了媒体的长枪短炮。他的打扮，似乎在致敬某个经典角色？<br /><br />【“啊，抱歉，比起赛车，骑着摩托车炫酷登场果然更适合我啊！”】",
		},
		['破浪强音'] = {
			id = 20110112,
			quality = 4,
			desc = "白墨参加海滨竞速俱乐部冲浪比赛时穿着的服装。随性潇洒的牛仔背心搭配沙滩风冲浪短裤，配饰选择了挂在腰间的迷你音箱，即使在冲浪比赛中也能伴随着强劲的音乐出场！<br /><br />【“哇呼——这就是飞驰于海面的感觉吗？真不赖啊！”】",
		},
		['自由守则'] = {
			id = 20110113,
			quality = 4,
			desc = "白墨为在欧泊活动吸引流量想出来的捣乱主意，欧泊风格的配色混淆了大部分人的视线，在秩序有度公正严谨的活动现场闹出了一点不大不小的喜剧。但据事后统计，的确出现了喜爱白墨的粉丝。<br /><br />【“让欧泊也享受自由！我本想这样喊，但治安机器人实在是太多了。”】",
		},
		['百万主播'] = {
			id = 20110206,
			quality = 5,
			desc = "白墨作为乌尔比诺联盟的盟主，代言了联盟旗下娱乐集团发明的数字化直播设备，并缔造了一夜之间获得百万粉丝的直播界奇迹！如今，他的身份又多了一个——引领潮流的顶流主播。很显然，他对这个身份适应良好，并随时准备在这个世界掀起新的风暴。<br /><br />【看看我，看看我，我不有趣吗？呃……吞噬注意力的怪兽，他们是这么形容我的？只要进入一次我的直播间，就会像上瘾一样根本离不开？】<br />【这怎么会是冒犯呢？这分明是最好的夸奖啊！！！】<br /><br />【近日，乌尔比诺商业联盟中心大厦外的巨大屏幕时常轮播一则广告：一个模糊到只能依稀辨认出是男性的身影，穿行在卡拉彼丘各个城市。他的身体是变换的数字信号，有时出现在热闹的集市内，有时穿梭在夜晚的高楼间，有时又直接像素化，出现在某个热门的游戏里。广告最后结束在一串数字里：1220。人们驻足仰望，猜测这串数字究竟有什么含义。<br />这是一个粉丝数为0的直播间，却在最热门时间段出现在最热门直播网站的首页。直播间内空空荡荡，只有一把转椅，甚至连直播间的号码都被马赛克覆盖。怀着好奇心涌入的观众越来越多，马赛克也越来越稀薄，最终完全消失，定格在熟悉的1220。直播间热闹起来后，一把吉他出现在空中，随后是手握吉他的白墨。<br />直播间沸腾了，而属于顶流主播白墨的时代，才刚刚拉开序幕。】",
		},
		['百万主播-喧嚣讯号'] = {
			id = 20110207,
			quality = 5,
		},
		['百万主播-赛博梦境'] = {
			id = 20110208,
			quality = 5,
		},
		['百万主播-极地尽头'] = {
			id = 20110209,
			quality = 5,
		},
		['百万主播-卫冕冠军'] = {
			id = 20110210,
			quality = 5,
		},
	},
	[220] = {
		['哨兵机器人'] = {
			id = 20220001,
			quality = 0,
			desc = "驱逐!驱逐！驱逐!",
		},
	},
	['加拉蒂亚·利里'] = {
		['礼装'] = {
			id = 20205001,
			quality = 0,
			desc = "加拉蒂亚进行魔术表演时的服装。低调而华丽。为了避免被人认出，她还会搭配上宽檐礼帽，尽管，这似乎让她更加夺目了。",
		},
		['礼装-靛蓝'] = {
			id = 20205002,
			quality = 2,
			desc = "加拉蒂亚众多魔术礼装中的一件。据说配色灵感来源于孔雀的眼睛。",
		},
		['礼装-墨竹'] = {
			id = 20205003,
			quality = 2,
			desc = "加拉蒂亚众多魔术礼装中的一件。据说配色灵感来源于青翠的竹林。",
		},
		['礼装-香槟金'] = {
			id = 20205004,
			quality = 2,
			desc = "加拉蒂亚众多魔术礼装中的一件。据说配色灵感来源于某次“上流社会”的晚宴。",
		},
		['礼装-灰羽'] = {
			id = 20205005,
			quality = 2,
			desc = "加拉蒂亚众多魔术礼装中的一件。据说配色灵感来源于快要下雪的阴沉傍晚。",
		},
		['礼装-紫露'] = {
			id = 20205006,
			quality = 2,
			desc = "加拉蒂亚众多魔术礼装中的一件。据说配色灵感来源于果园里成熟的葡萄。",
		},
		['礼装-青苍'] = {
			id = 20205007,
			quality = 2,
			desc = "加拉蒂亚众多魔术礼装中的一件。据说配色灵感来源于上好品质的蓝绿猫眼石。",
		},
		['礼装-红酒'] = {
			id = 20205008,
			quality = 2,
			desc = "加拉蒂亚众多魔术礼装中的一件，据说配色灵感来源于她地窖里珍藏的红酒。",
		},
		['礼装-宝石蓝'] = {
			id = 20205009,
			quality = 2,
			desc = "加拉蒂亚众多魔术礼装中的一件，据说配色灵感来源于某件“下落不明”的珍稀宝石。",
		},
		['深烘希爪'] = {
			id = 20205051,
			quality = 3,
			desc = "虽然比起咖啡，加拉蒂亚更喜欢“浓烈”一点的饮料，但不得不说，这种咖啡豆的风味确实独特。<br /><br />【“唔……下次加点儿酒，做成酒渍希爪吧。”】",
		},
		['星河流光'] = {
			id = 20205052,
			quality = 3,
			desc = "传闻这件礼服的设计灵感来源于某次加拉蒂亚仰望星空半小时，也有人说是她出席白芸博物馆珠宝展后灵感迸发。对此，加拉蒂亚不置可否。<br /><br />【“星星与宝石，本来就很相像嘛。”】",
		},
		['假面牌手'] = {
			id = 20205053,
			quality = 3,
			desc = "擅长使用扑克牌道具的魔术师，在其他牌类游戏中也技艺超群，这是理所当然的事情吧？可不要因为一直输给加拉蒂亚，就恼羞成怒哦。",
		},
		['绿隐春林'] = {
			id = 20205054,
			quality = 3,
			desc = "尽管很习惯长时间处于喧闹的环境中，但偶尔，加拉蒂亚也会前往宁静的山野林间休憩。<br /><br />【“听了太多人类的声音，偶尔，也想听听自然在说些什么嘛。”】",
		},
		['蝠翼魔术'] = {
			id = 20205055,
			quality = 3,
			desc = "是谁将旧时的城堡带入黑暗，谁又将这份黑暗当作了新的舞台？<br /><br />【“魔术师可不止会放鸽子，蝙蝠同样具有演出效果。”】",
		},
		['瞬息洋流'] = {
			id = 20205056,
			quality = 3,
			desc = "观察“海”是加拉蒂亚获取灵感的方式，毕竟她的职业告诉她，越是神秘，越会让人想要一探究竟。<br />“洋流变幻莫测，你想好要跟随谁的身影了吗？”",
		},
		['红粉倩影'] = {
			id = 20205101,
			quality = 4,
			desc = "急促的倒计时钟声鸣响着，本届星光魔术师的获奖者即将揭晓……伴随一抹颓靡的浅笑，无数道绯红倩影登台亮相，宛如归巢的红鹮鸟，而所有的灯光也汇集到了她们的身上。<br /><br />【“今夜的荣誉属于我，以及更多的我。”】",
		},
		['泳池派对'] = {
			id = 20205102,
			quality = 4,
			desc = "乌尔比诺旗下音乐厂牌签约DJ加拉蒂亚在本次泳池派对活动中穿着的服装。据现场观众回忆，玩到兴起时，加拉蒂亚曾把自己头戴的宽檐草帽抛向泳池中，还引起了游客的争抢，不过到晚上，那顶帽子又奇迹般回到了加拉蒂亚头上。<br /><br />【“泳池派对，我玩得很开心呢。下次再叫我吧？这次不需要演出费。”】",
		},
		['孔雀羽'] = {
			id = 20205103,
			quality = 4,
			desc = "一道刺眼的光芒，一霎模糊的幻象，没有人能形容孔雀羽的美丽，也没有人能逃脱欺诈师的诡计。<br /><br />【“开屏魔术！这也是骗你的哦。”】",
		},
		['融雪初霁'] = {
			id = 20205104,
			quality = 4,
			desc = "虽然身着短款格纹打歌服，但加拉蒂亚特意选择了一顶毛茸茸的贝雷帽，为优雅成熟的形象增添了几分柔和与纯真。<br /><br />【“这顶帽子……是不是很像雪落在了我的头上？”】",
		},
		['漫舞飞天'] = {
			id = 20205105,
			quality = 4,
			desc = "“幻梦求真录”历史文化展览在沐春期间连续举办，在卡丘人之中掀起了一股仿古风潮。人们仿照古壁画中仙人的服装制式，设计了一系列典雅、精致、飘逸的服装。<br /><br />【“哎呀呀，总觉得换上这套衣服，就要羽化登仙了呢。”】",
		},
		['蔚蓝绚影'] = {
			id = 20205106,
			quality = 4,
			desc = "加拉蒂亚作为乌尔比诺代表选手，参加耐力赛时的装束。每当赛车驶过固定位置，摄像机总能捕捉到她一闪而过的侧颜，和嘴角一抹从容的笑意。<br /><br />【“呼~这种把一切都甩在身后的感觉，真是喜欢呢。”】",
		},
		['弹幕玩家'] = {
			id = 20205107,
			quality = 4,
			desc = "蝉联多届电玩比赛冠军、如风一样来去自由的加拉蒂亚选手，在观众瞩目之下递交了今年比赛的报名表，她参加报名仪式的时尚装扮也迅速在年轻人中流行起来。<br /><br />【“看好了哦，我只表演一次的弹幕魔术！”】",
		},
		['金宵玉相'] = {
			id = 20205108,
			quality = 4,
			desc = "一座华宫，一场盛宴，一段独演，一个传奇。这个世界从不缺少一鸣惊人的新贵，但只有寥寥数位永远在王座举起酒杯。<br /><br />【“舞台的主角只有一个，从始至终，唯有我。”】",
		},
		['折跃边缘'] = {
			id = 20205109,
			quality = 4,
			desc = "加拉蒂亚在“无限巅峰超弦装甲大奖赛”中使用的战衣，以追寻之旅为主题，大胆地表达着人类对未知旅途的想象，银色的光辉里闪耀着属于探索者的希望。<br /><br />【“终有一天，我们每个人，都会跨过世界的阈限，与群星同行”】",
		},
		['焰翎魔女'] = {
			id = 20205206,
			quality = 5,
			desc = "“火之弦”守护者，永恒的魔女加拉蒂亚的标志性装束，火焰自幽深处闪烁，翎羽从禁绝处飘落，当魔女款款行来，你能否看清，裙裾处燃起的微光，是旅人尚未燃尽的幻想，还是勇者焚烧成灰的希望？<br /><br />【“她是遮天蔽日的黑翎，她是蔓延无际的幽火，她是真实与虚无之间，永恒的荧惑。”】<br /><br />【当藏书馆被失序的烈焰点燃那一刻，所有人都在绝望中嚎啕，祈求神明的瞥视，宽恕，抑或是救赎。但神听不到被灼烧的声音。<br />直至一扇不起眼的老旧木门被焚毁，是幽居的秘术师加拉蒂亚迎向了那席卷而来的炽烈，用自己的身躯吞噬了恶魔的火焰，探寻着弦能最古老而隐晦的秘密。<br />加拉蒂亚的轻笑在狂乱的火海中蔓延，弦能在她的手中喧嚣爆裂，但最终沿着她刻下的纹章，化作沉默温驯的翎羽，化作魔女披戴的冠服。<br />焰翎魔女在此刻书写了这场火焰之灾的终章。<br />无数后继者想要寻求她的身影，却鲜有人能通过她于厌烦中随手布设的考验。<br />魔女并不在意这凡间的一切，权利，欲望，金钱，皆是消弭于火焰的虚妄。<br />她钟情于弦能，亦陶醉于魔法本身。<br />崩溃之日是永恒炙烤着文明的梦魇。<br />但魔女的眼中，这只是一场有趣的洞见。】",
		},
		['焰翎魔女-曼烬'] = {
			id = 20205207,
			quality = 5,
		},
		['焰翎魔女-荼火'] = {
			id = 20205208,
			quality = 5,
		},
		['焰翎魔女-蔷焰'] = {
			id = 20205209,
			quality = 5,
		},
		['焰翎魔女-堇煌'] = {
			id = 20205210,
			quality = 5,
		},
	},
	['伊薇特'] = {
		['绒绒熊'] = {
			id = 20131001,
			quality = 0,
			desc = "伊薇特经常穿着于身的研究服。兜帽上两只可爱的小熊耳朵，透露出稚子般的童真。",
		},
		['绒绒熊-薰衣草'] = {
			id = 20131002,
			quality = 2,
			desc = "伊薇特的备用研究服。被一抹靓丽的紫映衬着，亭亭如纤细的薰衣草。",
		},
		['绒绒熊-赤心'] = {
			id = 20131003,
			quality = 2,
			desc = "伊薇特的备用研究服。藏在她冰冷的外表之下的，是一颗火热的内心。",
		},
		['绒绒熊-柑橘'] = {
			id = 20131004,
			quality = 2,
			desc = "伊薇特的备用研究服。柑橘色清新淡雅，正衬得她愈发甜美动人。",
		},
		['绒绒熊-萌芽'] = {
			id = 20131005,
			quality = 2,
			desc = "伊薇特的备用研究服。萌芽般的绿意，宛如阳光下新生的幼芽。",
		},
		['绒绒熊-明黄'] = {
			id = 20131006,
			quality = 2,
			desc = "伊薇特的备用研究服。灿灿的黄色让人感到内心的温暖。",
		},
		['绒绒熊-暖意'] = {
			id = 20131007,
			quality = 2,
			desc = "伊薇特的备用研究服。深埋冰雪之中的，是那动人的暖意。",
		},
		['绒绒熊-林荫'] = {
			id = 20131008,
			quality = 2,
			desc = "伊薇特的备用研究服。盛夏树木的繁叶也难以掩盖少女的心思。",
		},
		['绒绒熊-丁香'] = {
			id = 20131009,
			quality = 2,
			desc = "伊薇特的备用研究服。丁香般素雅的浅蓝色让人感受到少女的宁静与美好。",
		},
		['魔女之夜'] = {
			id = 20131052,
			quality = 3,
			desc = "在神秘的紫色映衬下，以蛛网，蝙蝠与古堡为饰的服装。即使这是个童话故事，伊薇特也不一定是其中的公主哦。",
		},
		['少女四叶草'] = {
			id = 20131054,
			quality = 3,
			desc = "以四叶草为装饰，清新可爱的研究服。希望、信心、爱、还有幸运。伊薇特祝愿这些美好的东西，永伴你的身边。",
		},
		['樱吹雪'] = {
			id = 20131055,
			quality = 3,
			desc = "浅粉色的研究服，以樱花、雪山与明月为装饰意象。伊薇特仿佛立于风中，飘落的花瓣正落在她的肩上。",
		},
		['波子汽水'] = {
			id = 20131056,
			quality = 3,
			desc = "白蓝相间的简洁外套下，浅橙色的长袜让人想起甜甜的汽水。内向且羞涩的伊薇特，偶尔，也会展露出这样甜美的一面。",
		},
		['榛果摩卡'] = {
			id = 20131057,
			quality = 3,
			desc = "慵懒的午后，最适合来上一杯见习咖啡师伊薇特亲手冲制的浓郁摩卡。",
		},
		['四叶信使'] = {
			id = 20131058,
			quality = 3,
			desc = "为了研究不同信件对人们情绪波动的影响，伊薇特换上信使的服装，穿梭于各家各户感受人们的心情。只是，面对着她自己想要送出信件的对象时，伊薇特注意到自己的心跳骤然加快。",
		},
		['海洋泡影'] = {
			id = 20131059,
			quality = 3,
			desc = "伊薇特在海洋馆所穿的研究服。学术上生命的诞生起源于海洋，这个世界中同样有着“海”。她相信通过研究，解析，模仿这些生物的习性和行为，能帮我们解决“崩溃”的危机。",
		},
		['霜夜星晓'] = {
			id = 20131060,
			quality = 3,
			desc = "彻夜的研究工作让伊薇特喜欢上了仰望星空的感觉，有星星陪伴的夜晚，再冷也不会孤单。<br />“向大熊星座许愿的话，会有流星实现我的愿望吗？”",
		},
		['野餐时光'] = {
			id = 20131101,
			quality = 4,
			desc = "伊薇特野外出行时喜着的服装。朴素不加点缀的风格映射着她纯洁的内心。当然，偶尔她也会有属于自己的少女心。<br /><br />“诶？你是说，你想和我们一起吃午餐吗？可是，我找不到菲了……”<br />“那，要不然，这一次就我们俩，偷偷一起吃吧……”<br />伊薇特是真的找不到菲吗？还是说……<br />这个问题，只有等日后，她亲自来为你解答了。",
		},
		['海滨奇遇'] = {
			id = 20131102,
			quality = 4,
			desc = "伊薇特的海滨装束。少女的青春活力和清凉感，让人眼前一亮，看上去就像是一只可爱的熊猫。<br /><br />“熊猫……是不会出现在海边的。”<br />理所当然，伊薇特不可能不知道这一点。<br />那么，她为何会选择这套衣装呢？你不禁有些好奇<br />“……这样的话，我就是独一无二的了。”",
		},
		['心晶冰锁'] = {
			id = 20131103,
			quality = 4,
			desc = "伊薇特在咖啡店实习时穿着的服装。<br />为了改善自己的交流能力，伊薇特在引航者的建议下接受了这份工作。<br />尽管伊薇特是抱着服务的态度来的，却经常被顾客反向投喂，令她感到些许不解。<br /><br />【“客人，这样的话，菲也会很困扰的……”】",
		},
		['转角遇到熊'] = {
			id = 20131104,
			quality = 4,
			desc = "在研究遇到瓶颈时，伊薇特偶尔会溜出实验室，没人知道她去了哪，只知道在她回来时会带着一脸满足继续埋头工作。<br />如果你在奶茶店的街角遇到了熊，请不要惊慌，只要假装没看到她就行，她会在补充完糖分后自行离开。<br /><br />【“糖分，很重要……糖果屋，似乎很有人气……稍微，有点兴趣。”】",
		},
		['雪精灵'] = {
			id = 20131105,
			quality = 4,
			desc = "伊薇特受邀参加荒野冬日特别活动时所穿的服装。保暖的绒装充满贴身感与弹力，足以支持一切冬季的户外活动，是伊薇特十分喜欢的冬装。<br /><br />【“冷吗？我觉得……一点也不会冷。”】",
		},
		['小红帽'] = {
			id = 20131106,
			quality = 4,
			desc = "伊薇特在参加苹安节活动时穿着的服装。一改平时的冷色调风格，并尽力还原了某个童话中的造型，只是相比故事里的主人公，她可不会束手就擒的。<br /><br />【“我的苹安果……你可以收下吗？”】",
		},
		['漫舞霓裳'] = {
			id = 20131107,
			quality = 4,
			desc = "伊薇特受邀参加乌尔比诺的文艺汇演时所穿的服装。轻盈而凸显着古文明的山水诗意，虽然伊薇特的舞步还有几分稚嫩和不熟练，但这并不妨碍她成为汇演时的焦点。<br /><br />【“一曲霓裳舞，只因夜思君。”】",
		},
		['战术研习'] = {
			id = 20131108,
			quality = 4,
			desc = "护目镜、战术头盔、迷彩作战服……因为引航者的邀请，伊薇特认真备齐了一名战术分析官应有的全套装备。虽然战场不同于研究所，但伊薇特充分发挥自己强大的分析与研究能力，为前方作战的同伴保驾护航。<br /><br />“战、战术分析官伊薇特前来报道……”<br />害羞柔弱的声音微微颤抖着。<br />“那个……引航者，伊薇特收集到的作战数据，帮到大家了吗？”<br />那双温柔熟悉的双手轻轻摩挲着她的额头。<br />紧张羞红的少女渐渐地平复了自己的心情，来自引航者的安抚似乎是一种最为神奇的特效药，无论面对什么，她都能变得勇敢而坚定。",
		},
		['心动疗程'] = {
			id = 20131109,
			quality = 4,
			desc = "伊薇特为了深入研究崩溃症，在临床试验时所穿的制服。对一个严谨的科研工作者来说，只要对方的心脏还在跳动，就证明没有什么大问题。<br /><br />【“心跳节奏，60……78……110，状态良好，你可以出院了。”】",
		},
		['珠霜舒芙蕾'] = {
			id = 20131110,
			quality = 4,
			desc = "欧泊执行某次任务时定制的晚宴装扮，伊薇特扮作家族中幽居深闺的小女儿。作为家族明珠第一次在公开场合的亮相，吸引了不少好奇的目光。<br /><br />【“只是听说今晚会来一位传奇的客人啦。如果是她的话，无论如何也想亲眼见见。”】",
		},
		['萌趣探险'] = {
			id = 20131111,
			quality = 4,
			desc = "伊薇特参加欧泊戏剧节定制的演出服。短款连帽斗篷和琴键图案的短裙衬托出了少女优越的身材比例，身后作为装饰物的狐狸玩偶更是为装束增添了几分可爱，穿着这样的服装展开探险，一定会吸引到许多同路人吧。<br /><br />【“唔，因为没有把菲背在身后，它好像还有一点吃醋了呢……”】",
		},
		['菲空环游'] = {
			id = 20131112,
			quality = 4,
			desc = "少女的梦想被气球轻轻托举，沉入蔚蓝的梦境，循着永不磨灭的好奇心，寻找这一片澄澈中的奇迹，这无关征服与探索，只是关于飞翔的梦想，穷尽一切努力也要追寻。<br /><br />【“因为想摸摸太阳有多暖，因为想和月亮说晚安。”】",
		},
		['雪绒团子'] = {
			id = 20131113,
			quality = 4,
			desc = "传说在满月之夜，会有一道白色的倩影，带着一个矮小的孩童在邪灵祟生的地域中漫游，拯救那些善良的人，见过她的人都说，她的手泛着微微凉意，却是一片森冷中，最暖的太阳。<br /><br />【“……可是，菲是伙伴，不是小孩……”】",
		},
		['清甜草莓'] = {
			id = 20131114,
			quality = 4,
			desc = "为了甜品艺术节的现场取材，乖巧的研究员少女在状况外接受了变身的任务，懵懵懂懂地融入环境，懵懵懂懂地品味艺术，懵懵懵懂地发现，那些美味又特别的记忆。<br /><br />【“一定要变成奶油蛋糕吗……可以的话，冰淇淋口味的可以吗？”】",
		},
		['萌软心事'] = {
			id = 20131115,
			quality = 4,
			desc = "布置好房间里的一切，时针也才来到晚上八点，离睡衣派对开始还有两个小时。无事可做的伊薇特将脸埋进菲的怀抱里，紧张又期盼地等待着门铃响起。大家会对她举办的派对感到满意吗？<br /><br />【虽然很不擅长这些……但也想和伙伴们更亲近一点……】",
		},
		['熊熊曲奇'] = {
			id = 20131201,
			quality = 6,
			desc = "小熊居家服、电子设备和冰饮料构成了伊薇特的宅家三件套。这套居家服有着柔软的熊耳朵，每当缺乏灵感时，伊薇特总会下意识地摸摸它。<br /><br />“也不是真的，不喜欢出门……”<br />女孩不好意思地把小熊兜帽的帽檐往下扯了扯：“只是外面人太多了，很吵闹……家里，有菲，有毛绒毯子，还有喝不完的冰饮料……”<br />“伊薇特觉得，呆在家里也很开心……你，你会同意我的看法吧？”",
		},
		['轻舞成双'] = {
			id = 20131206,
			quality = 5,
			desc = "伊薇特参加欧泊舞会的服装。虽然有点不好意思在众人面前打扮得如此隆重，但偶尔能展现出不一样的一面，也很好。<br /><br />虽然以高级研究员的身份加入了欧泊，但伊薇特内向、社恐的性格一直难以改变。每每从人群中穿过，她总是拉低帽檐，尽量降低自己的存在感。殊不知，这也为她打上了“怪人”的标签。<br />“比起人类，那家伙看上去更像是个动物吧？只靠直觉活着的样子真是可悲呢。”<br />“和谁都不说话，只会工作的怪胎，简直就像提线木偶一样。”<br />“和她制造的那只机器熊一样，都是没有灵魂的东西啦。”<br />没关系，只要捂住耳朵，快点离开，就听不到那些话了……伊薇特加快了脚步。下一秒，两个熟悉的身影出现在她面前。<br />“小熊，你怎么又不看通讯消息！穿什么去参加下个月的欧泊舞会，你想好了吗？需要建议吗？”米雪儿顶着火力大喵满脸兴奋。<br />“啊？舞会……”伊薇特脸上露出为难的表情：“是要穿礼服的那种吗……伊薇特没有可以穿去舞会的衣服……而且，有点不好意思……”<br />“没关系，现在时间还很充裕，无论是买衣服，还是亲手做一件，都完全来得及哦！”心夏自信满满地握拳：“最重要的是，伊薇特必须在舞会上盛大登场，给那些只会在背后编排你的人看看——”<br />心夏没有降低音量，不如说，她本来就是要说给某些人听的：“伊薇特不是怪人，她有朋友，而且朋友们也很喜欢她！”<br />“米雪儿、心夏前辈……”伊薇特怔怔地看着两人：“明白了……！伊薇特给菲做过衣服，给自己做，应该也不难……关于服装造型的建议，就拜托两位了……！”<br />单片的雪花，往往还没有落地便已融化。但当它们凝结在一起，便有了迎风飞舞的勇气。",
		},
		['轻舞成双-白水晶'] = {
			id = 20131207,
			quality = 5,
		},
		['轻舞成双-日光石'] = {
			id = 20131208,
			quality = 5,
		},
		['轻舞成双-红宝石'] = {
			id = 20131209,
			quality = 5,
		},
		['轻舞成双-月光石'] = {
			id = 20131210,
			quality = 5,
		},
	},
	['香奈美'] = {
		['夜莺'] = {
			id = 20137001,
			quality = 0,
			desc = "香奈美的演出服。兼具美丽与实用。纤细修长的衣摆，宛如夜莺舒展羽翼。",
		},
		['夜莺-花青'] = {
			id = 20137002,
			quality = 2,
			desc = "香奈美的备用演出服。青涩的渐变色如同花瓣般娇嫩。",
		},
		['夜莺-焰色'] = {
			id = 20137003,
			quality = 2,
			desc = "香奈美的备用演出服。耀眼的橙黄，如同她心中跃动的热情火焰。",
		},
		['夜莺-紫罗兰'] = {
			id = 20137004,
			quality = 2,
			desc = "香奈美的备用演出服。紫罗兰的闪耀，在她身上尽情绽放。",
		},
		['夜莺-未央'] = {
			id = 20137005,
			quality = 2,
			desc = "香奈美的备用演出服。夜如何其？夜未央，鸾声将将。",
		},
		['夜莺-芭蕉'] = {
			id = 20137006,
			quality = 2,
			desc = "香奈美的备用演出服。凤尾芭蕉，龙吟细细。",
		},
		['夜莺-鎏金'] = {
			id = 20137007,
			quality = 2,
			desc = "香奈美的备用演出服。鎏金的色彩与偶像的光芒交相辉映。",
		},
		['夜莺-萌芽'] = {
			id = 20137008,
			quality = 2,
			desc = "香奈美的备用演出服。鲜嫩的绿意贸然生长。",
		},
		['夜莺-月光'] = {
			id = 20137009,
			quality = 2,
			desc = "香奈美的备用演出服。舞台上，她如那颗名为月亮的星星一般明亮。",
		},
		['甜心梦魇'] = {
			id = 20137051,
			quality = 3,
			desc = "香奈美特制的一套演出服。有着魅惑中略带危险的氛围。也许，就在今晚，她会在你的梦中出现哦。",
		},
		['极夜之舞'] = {
			id = 20137052,
			quality = 3,
			desc = "这套演出服上，描绘着星环的图样。裙上星光的舞动，正如香奈美华丽的舞姿。",
		},
		['薄荷之夏'] = {
			id = 20137053,
			quality = 3,
			desc = "清淡素雅的薄荷色衣装。衬托得香奈美更加清纯动人。夏日热情的演唱会，也因为她的装扮，多了几分清凉。",
		},
		['糖果波普'] = {
			id = 20137054,
			quality = 3,
			desc = "可爱的粉色包装纸，包裹着甜蜜的浅青色糖果。香奈美的这套演出服，将她的甜美魅力衬托得淋漓尽致。",
		},
		['温热咖味'] = {
			id = 20137055,
			quality = 3,
			desc = "香奈美参加咖啡品牌推广活动时的演出服装。服装设计特别参考了咖啡的拉花工艺，只为向粉丝们传递咖啡般温暖的心意。",
		},
		['向阳舞台'] = {
			id = 20137056,
			quality = 3,
			desc = "香奈美演出服的特别版。以灿烂阳光照耀下的向阳葵田为灵感设计，展现出香奈美无限的热情。",
		},
		['聚焦主流'] = {
			id = 20137057,
			quality = 3,
			desc = "以最近在卡丘世界火热的文化形象为参考设计的制服。作为偶像，可不能允许大家的目光从自己身上移开。<br /><br />【不论任何题材，任何风格，超级偶像香奈美都能驾驭。】",
		},
		['幸运音律'] = {
			id = 20137058,
			quality = 3,
			desc = "香奈美演出服的特别版，以青葱的幸运四叶草为灵感设计，只为将好运通过歌声传递给粉丝们。",
		},
		['浪漫华彩'] = {
			id = 20137101,
			quality = 4,
			desc = "只有在正式场合，香奈美才会换上这套华丽庄重的礼服。少女的浪漫与成熟女性的优雅完美结合，彰显出她独有的熠熠华彩。<br /><br />“我就是穿着这套衣服，第一次作为偶像登台的。”<br />“那时的感情，我一辈子都不会忘记。”<br />“为了再度邂逅那样的感动，我必须要肩负起所有人的期望才行。”",
		},
		['零时之约'] = {
			id = 20137102,
			quality = 4,
			desc = "作为香奈美新曲宣传的活动企划而设计的服装。<br />经过多次改修，在偶像的距离感与女仆的亲近感间达成了完美平衡，而她喜欢这件服装的理由，似乎另有原因……<br /><br />【“香奈美是属于大家的偶像，但是……此时此刻，请让我成为专属于您的女仆。”】",
		},
		['心跳回忆'] = {
			id = 20137103,
			quality = 4,
			desc = "香奈美在享受假日时选择的休闲服装。当沐浴在聚光灯下时，很少有人意识到——舞台上无敌的偶像，在褪去光芒后也只是一个平凡的邻家少女，她也有权力享受属于少女的青涩时光。<br />只是，身为偶像的职业素养似乎让她总是敏锐地感觉着周围的目光。这让香奈美感到一丝紧张与悸动，不由得抓紧了身边人的手臂。<br /><br />【咚、咚、咚……香奈美的心跳，你听到了吗？】",
		},
		['乡野芳华'] = {
			id = 20137104,
			quality = 4,
			desc = "香奈美作为偶像参加乡间录制节目时所穿的服装。轻快的短裤背带裙上即使沾染了些许泥土，也不会影响偶像可爱的风格，即便是剧组结束了工作，香奈美依旧保留了这套服装。<br /><br />【“看着作物一天天成长，内心也有被充实的感觉呢。”】",
		},
		['交响情梦'] = {
			id = 20137105,
			quality = 4,
			desc = "香奈美受邀参加金树乐章音乐会时所穿的服装。非常注重表现自身魅力，以及与指挥家的搭配感，不知道是否是有意为之……？<br /><br />【“想和你，做最美的梦。”】",
		},
		['蔚蓝魔影'] = {
			id = 20137106,
			quality = 4,
			desc = "香奈美受邀前往月桂大厅演出的魔术表演礼服。同时借鉴了燕尾服与芭蕾舞裙的元素。优雅与浪漫是香奈美永恒的追求，而裙摆华丽的装饰品中似乎暗藏玄机。<br /><br />【“呼……香奈美，你可以的。一定要把我们的东西拿回来！”】",
		},
		['浪舞心涟'] = {
			id = 20137108,
			quality = 4,
			desc = "香奈美出演神话戏剧所穿的戏服。以古希腊女神为原型，衣白如浪花，裙摆若鱼尾，月桂叶编制的金色花冠更显高洁与神圣。<br /><br />“我会一直为你祈祷的。”<br />少女倾注了全部的情感与心意念完了最后一句台词。<br />“果然把你当作排练对象，很快就能……啊，没什么。”<br />少女似乎想说出什么，却又在一阵慌乱中欲言又止。",
		},
		['超银河歌姬'] = {
			id = 20137109,
			quality = 4,
			desc = "在超银河主题演唱会上，香奈美个人搭配的演出服。跨越星河的歌声与战斗曾是某个科幻系列的永恒主题，而香奈美仿佛化身为唱响银河的歌姬，诠释着自己的理解。<br /><br />【“你可曾记得银河与爱呢？”】",
		},
		['萤光海之梦'] = {
			id = 20137110,
			quality = 4,
			desc = "少女坠入深海，她的裙纱与长发随波绽放，点点萤光将大海点亮。在海的怀抱中，她度过了一段梦想已久的难忘旅途。<br /><br />【“这段冒险，要是没有终点就好了。”】",
		},
		['踏雪寻鸢'] = {
			id = 20137111,
			quality = 4,
			desc = "作为偶像，在沐春节到来之际，当然要换上符合气氛的新衣裳！今年的设计主题是“剪纸”，香奈美特地选择了鸟儿的图案，配合上复古的款式设计，在城中掀起了一股新的时尚风潮。<br /><br />【“都说时尚是个轮回，香奈美也觉得，稍加改造、配上饰品，这套衣服穿去打歌也不违和呢！”】",
		},
		['最强应援'] = {
			id = 20137112,
			quality = 4,
			desc = "担任运动会啦啦队队长的是——校园女神香奈美！这次，香奈美会携啦啦队全体成员进行精彩的表演。稍等，现场似乎出现了一点状况，不同学院的啦啦队成员起了些争执，香奈美站了出来，是要解决纠纷吗？<br /><br />【“你们不要再打了！要打去练舞室打！由香奈美作为裁判，来一场公平的啦啦操对决！”】",
		},
		['朝颜鹤语'] = {
			id = 20137113,
			quality = 4,
			desc = "香奈美参加夏日烟火祭活动时穿着的定制服装，以修身的短款版型为基础，加入了少女的诸多小巧思。朵朵朝颜，或缀于发梢，或悬挂腰间，如同升空绽放的烟火般，璀璨而浪漫。<br /><br />【“传讯的千纸鹤已经送出了邀请，夏日祭典，香奈美会一直等着你赴约。”】",
		},
		['雪夜风谣'] = {
			id = 20137114,
			quality = 4,
			desc = "壁炉的火打着噼啪的鼓点，星夜的雪落下簌簌的和声，人们闭眼安静地许下愿望，而月亮下，今夜的精灵摇着带来幸福的铃铛，用一首欢歌，回应着所有祈求美好的呼唤。<br /><br />【“铃儿响，风儿唱，夜不长，我们手牵手，互诉梦与望。”】",
		},
		['晴香瑰夏'] = {
			id = 20137115,
			quality = 4,
			desc = "香奈美专门为海滨之行特意定制的度假泳衣，少女的清新气息与时刻环绕在她身边的花丛相得益彰，但谁也不知道，究竟是为了新单曲的拍摄所设计的造型，还是为了海滨之行刻意准备的妆扮。<br /><br />【“轻快，清新，倾心为你准备的歌曲，这就是香奈美的夏天。”】",
		},
		['花的私语'] = {
			id = 20137201,
			quality = 6,
			desc = "香奈美假日里穿着的可爱裙装。卸下舞台多重装扮的香奈美，穿上了一身淡黄色的连衣裙，或许只有在你的身边，她的心境才能变得轻盈自在。<br /><br />【作为偶像的香奈美平时很喜欢研究妆容造型。<br />无论是清透的白开水裸妆，还是精致的舞台亮片妆，香奈美都能很好地完成。任何彩妆产品一旦到了她的手里，就能被巧妙地运用起来。<br />此时此刻，做好妆造的香奈美用唇膏在镜子上画了一个可爱的标记。<br />“引航者，你会不会染上香奈美的颜色呢？”。】",
		},
		['世纪歌姬'] = {
			id = 20137206,
			quality = 5,
			desc = "在世界濒临记忆崩溃之际，香奈美抵达了偶像这一身份的巅峰与尽头，成为了音乐的化身，灵魂的容器。<br />她于万众瞩目之下唱起了一首承载着希望的歌，用自己的力量改写了故事的结局。<br /><br />【“我会化作永恒的世纪之歌！”】<br /><br />【晶源感染危机爆发后，异形怪物占领了一些重要城市，以科莫斯为中心的防护体系濒临崩溃，整个区域陷入了一种极其不稳定的逆弦化状态。<br />根据卡丘紧急事务署的深入调查，异形怪物的暴力趋势与情绪的波动呈正相关，某些特殊的声音能对其产生有效的抑制作用。香奈美在得知这件事情的第一时间，迅速赶往了世界的至高点位，因为只有在那里，歌声才能传遍整个空间。<br />此时此刻，香奈美以天穹为舞台，以歌声为武器，拉开了演出的序幕。只见一阵又一阵的声波贯穿了异形怪物的身体，异化的谵惘晶粹也纷纷碎裂成了漫天璀璨的“钻石”，至此，歌姬完成了她的使命。】",
		},
		['世纪歌姬-天籁之音'] = {
			id = 20137207,
			quality = 5,
		},
		['世纪歌姬-余烬之光'] = {
			id = 20137208,
			quality = 5,
		},
		['世纪歌姬-极夜声浪'] = {
			id = 20137209,
			quality = 5,
		},
		['世纪歌姬-心语交织'] = {
			id = 20137210,
			quality = 5,
		},
		['心之奏鸣'] = {
			id = 20137211,
			quality = 5,
			desc = "香奈美为新专辑亲自设计的舞台形象，借由艾顿城的全新舞台技术，香奈美得以与另一个自己同场演唱。羽翼交映间，救赎的祝祷与诱惑的歌谣一同响彻。<br /><br />【“忠于自己的内心吧，无论是怎样的情感，香奈美都会接下哦！”】<br /><br />身为“偶像”，面对的究竟是怎样的情感呢？<br />一场座无虚席的演唱会结束后，香奈美离开聚光灯，静立在黑暗而安静的观众席中，于脑海中编织舞台上的自我。<br />“如果我憧憬着什么人，那么……那份情感，也许并非纯然光明。”<br />“信仰、欲望、治愈、占有……”<br />她推翻了经纪公司为她准备的“双生天使”概念，亲自设计了一组充满反差与张力的新形象。<br />你用怎样的目光看向我，又期待着得到我怎样的目光？<br />这一次，香奈美不愿只用“爱”来回答。<br />'你们在台下注视着我，呼唤我的名字。但你们真正渴望的，是被我看见的那一刻——无论那是救赎，还是坠落。' <br />——选自新EP《Cuter Me》",
		},
		['心之奏鸣-狂想'] = {
			id = 20137212,
			quality = 5,
		},
		['心之奏鸣-夜莺'] = {
			id = 20137213,
			quality = 5,
		},
		['心之奏鸣-恋歌'] = {
			id = 20137214,
			quality = 5,
		},
		['心之奏鸣-海妖'] = {
			id = 20137215,
			quality = 5,
		},
	},
	['芙拉薇娅'] = {
		['轻蝶'] = {
			id = 20115001,
			quality = 0,
			desc = "芙拉薇娅的作战服。整体设计简洁舒适，蝴蝶元素作为点睛之笔，更能衬托穿着者的优雅魅力。",
		},
		['轻蝶-微风'] = {
			id = 20115002,
			quality = 2,
			desc = "芙拉薇娅的备用制服。蝶翼伴随着微风舞动，忽近忽远，难以琢磨。",
		},
		['轻蝶-湖光'] = {
			id = 20115003,
			quality = 2,
			desc = "芙拉薇娅的备用制服。如同一汪深沉的湖水，看不透，望不穿。",
		},
		['轻蝶-春芽'] = {
			id = 20115004,
			quality = 2,
			desc = "芙拉薇娅的备用制服。忍耐过寒冬的嫩芽，等待着初春的绽放。",
		},
		['轻蝶-朽叶'] = {
			id = 20115005,
			quality = 2,
			desc = "芙拉薇娅的备用制服。蝴蝶收起翅膀，隐藏在朽叶之中。",
		},
		['轻蝶-紫夜'] = {
			id = 20115006,
			quality = 2,
			desc = "芙拉薇娅的备用制服。谎言与真相不分彼此，一同融入了紫色的夜中。",
		},
		['轻蝶-幻火'] = {
			id = 20115007,
			quality = 2,
			desc = "芙拉薇娅的备用制服。失去温度的黯淡火焰，如同幻影，冰冷地燃烧。",
		},
		['轻蝶-迷丛'] = {
			id = 20115008,
			quality = 2,
			desc = "芙拉薇娅的备用制服。宛若蝴蝶飞入花丛，迷失在殷色之中。",
		},
		['轻蝶-寞影'] = {
			id = 20115009,
			quality = 2,
			desc = "芙拉薇娅的备用制服。疏离于人群外的蝶翼，飞舞向俯瞰人们的天穹。",
		},
		['卡布奇诺'] = {
			id = 20115051,
			quality = 3,
			desc = "芙拉薇娅的个人定制服装。咖啡、牛奶与鲜奶油的灵感碰撞。游走在咖啡与牛奶的边界之间，亦是一种危险的游戏。",
		},
		['授勋式'] = {
			id = 20115052,
			quality = 3,
			desc = "芙拉薇娅在欧泊的授勋式上穿着的正式服装。她不会就此止步，她将继续向上攀登，直到没有人可以为她授勋。",
		},
		['晚安舞会'] = {
			id = 20115053,
			quality = 3,
			desc = "芙拉薇娅的个人定制服装。薰衣草一般的淡紫色衣裙，散发着似有若无的香气，在蝴蝶的舞姿中沉入梦乡。",
		},
		['碧波潜影'] = {
			id = 20115054,
			quality = 3,
			desc = "芙拉薇娅的个人定制服装。毒蛇潜伏在潭水之中，等待着前来饮水的猎物。不，她不是毒蛇，她是守在一旁等待结果的猎人。",
		},
		['初春绿意'] = {
			id = 20115055,
			quality = 3,
			desc = "当温暖的第一缕春风吹来，树木的枝头披上新绿，万物开始复苏。在这个时候，去踏踏青、晒晒太阳正好，毕竟蝴蝶可不会错过如此美好的春日。",
		},
		['幽色翅脉'] = {
			id = 20115056,
			quality = 3,
			desc = "芙拉薇娅的个人定制服装。芬芳而又幽静的季节已悄然到来，蛹虫难抑心中的躁意，化生翅脉，翩入幽色绽放的春天。",
		},
		['青海蜉涌'] = {
			id = 20115057,
			quality = 3,
			desc = "水母在海中漂浮，就像蝴蝶在空中飞舞。传闻芙拉薇娅在游览水族馆后，以此为灵感设计的衣服。",
		},
		['假日邀约'] = {
			id = 20115101,
			quality = 4,
			desc = "抱着试探的想法向芙拉薇娅发出了一同出游的邀约，没想到对方却爽快地答应了。<br /><br />【“嗯？怎么了？天气这么好，蝴蝶也想晒晒太阳嘛。”】",
		},
		['迷蝶翩跹'] = {
			id = 20115102,
			quality = 4,
			desc = "结合蝴蝶元素而设计的女仆工作服。华贵而优雅。芙拉薇娅以这身迷人的着装神秘地现身咖啡厅，原因不得而知。她似乎掌握了关于某个人的重要情报。<br /><br />【“想要换取情报么，客人？呵呵，先赢了我再说喔。”】",
		},
		['流光雀翎'] = {
			id = 20115103,
			quality = 4,
			desc = "像孔雀羽毛般华丽的裙装。穿在芙拉薇娅的身上，轻易就能吸引整个舞池的目光。<br /><br />【“不要紧张，把一切交给我——作为舞伴，我会照顾好你的”。】",
		},
		['漫享情调'] = {
			id = 20115104,
			quality = 4,
			desc = "热情而大方的餐厅制服。芙拉薇娅用以潜伏于某家街边小馆中。迎着美丽的日落，享受着伊比利亚式的醇香与美味，芙拉薇娅和客人们一同沉浸在这种浪漫的情调中。<br /><br />【“在日落之处，我为他们奉上醇香与火腿。”】",
		},
		['浮光拾贝'] = {
			id = 20115105,
			quality = 4,
			desc = "芙拉薇娅参加泳池派对时穿着的服装。清凉又优雅的设计勾勒出她完美的身材，蝴蝶装饰物则采用了特殊的贝壳纹材料，在阳光的照耀下能折射出特殊的光纹。<br /><br />【“一直被包裹在制服里，偶尔让身体晒晒太阳也不错呢。泳池派对很有意思，下次，跟我去海边吧？”】",
		},
		['幻夜霓响'] = {
			id = 20115106,
			quality = 4,
			desc = "霓之城的午夜电台迎来了一位特殊的主持，蝴蝶的翅脉又将在这灯火辉煌的不夜城掀起怎样的声浪呢？<br /><br />【“清除这座城市的罪恶，就拿你们作为蝴蝶效应的第一循吧。”】",
		},
		['军情特工'] = {
			id = 20115107,
			quality = 4,
			desc = "作为新人搜查官的芙拉薇娅，因为自身特殊的弦能力，常被派去执行特工任务。她的所到之处，都会留下关于紫色幻蝶的传说。<br /><br />【“啊，又受了点伤……还需要更加熟练一点才行啊。”】",
		},
		['赤红闪电'] = {
			id = 20115108,
			quality = 4,
			desc = "芙拉薇娅作为欧泊代表选手，参加方程式竞赛时的装束。代表欧泊出战的居然是这位身居高位、传闻中的蝴蝶女士，让不少人深感意外。<br /><br />【“比起欧泊的任务，这更像是我的个人爱好。至于实力……我的排名，你也看到了不是吗？”】",
		},
		['永夜王女'] = {
			id = 20115109,
			quality = 4,
			desc = "传说中永夜古堡的主人，永生不灭、已在世上存活了数千年的貌美女子——芙拉薇娅。当天空中黑月升起，灵蝶会送来古堡的邀请函，此为邀约，亦是试探。<br /><br />【“我既不吸食人血，也不惧怕阳光，如果对我真的如此好奇，不如亲自来看一看？”】",
		},
		['极星诫喻'] = {
			id = 20115110,
			quality = 4,
			desc = "欧泊为芙拉薇娅参照过去“远征计划”设计的作战服，为了更加贴合着装者的需要，新款战服选用了更加优雅的款式，便于芙拉薇娅在监视者与审判官之间切换自如。<br /><br />【“若你见我，无需惊惧，我是指引，是仅为黎明闪耀的极星。”】",
		},
		['茵茵青帝'] = {
			id = 20115111,
			quality = 4,
			desc = "复眼很忙，但沐春节依然值得驻足小憩。平日里说不上平易近人的头领主动换上了新装，给她遇见的每一个人都带来了独属于这个节日的祝语。<br /><br />【“今日休沐，好春时节，亲友望盼，不可辜负。”】",
		},
		['迷醉桃方'] = {
			id = 20115112,
			quality = 4,
			desc = "作为秘密情报部队，芙拉薇娅的衣柜里有为各种场合定制的卧底服装。无论怎样的环境，都能游刃有余地融入其中。她拥有的高级侍酒师的头衔，更是为这次行动增添了专业保障。<br /><br />“别这么心急。在正式开始之前，先喝一杯吧。”",
		},
		['迷夜湾流'] = {
			id = 20115113,
			quality = 4,
			desc = "芙拉薇娅在调查地下赛车组织时穿着的伪装服，为了行动方便，使用了在夜间既耀眼但又能融入环境的二段式设计，虽然本人并不知道，这身衣服在此后成为那段弯道里被传颂的女王称号。<br /><br />【“操控，加压，变向，爆发，哎呀，这不都是我熟悉的技巧嘛。”】",
		},
		['千面之月'] = {
			id = 20115206,
			quality = 5,
			desc = "如果对着月亮虔诚祈祷的话，月光女神就会回应你的呼唤。对待虔诚的信徒，她播撒恩赐；对投机取巧的小人，她降下神罚——这是这个世界的孩子们从小听着长大的童话故事。<br /><br />【“神明造物，亦有物造的神明。我诞生于信仰，生命未有消亡，我便会永生。”】<br /><br />【美丽而高洁的月光女神是如此令人向往，她的眼眸深不见底、洞察一切，她的胸怀芬芳柔软、包容一切，而她处决罪人时又是如此狠戾果决，月光海一样的裙摆会抹除一切。她是所有行走在夜晚之人的共同信仰。<br />人们明明追寻着相同的目标，却走向了不同的结局。无数人说自己见过芙拉薇娅，有些人觉得她温柔怜悯，有些人觉得她冰冷无情，但很少有人能想起，这个世界根本看不见月亮。】",
		},
		['千面之月-银月光辉'] = {
			id = 20115207,
			quality = 5,
		},
		['千面之月-绯红帷幕'] = {
			id = 20115208,
			quality = 5,
		},
		['千面之月-猫眼翠榴'] = {
			id = 20115209,
			quality = 5,
		},
		['千面之月-怀金垂紫'] = {
			id = 20115210,
			quality = 5,
		},
		['惑世冥鳞'] = {
			id = 20115211,
			quality = 5,
			desc = "芙拉薇娅作为蛇灵圣女展现的身姿。古朴银饰点缀在蛇影之间，随着她的步伐摇曳。这并非单纯的装饰，而是惑人心神的一环。若是被她的目光捕捉，意志将会在灵蛇纠缠间顷刻溃散，脑海中只剩她的舞姿与眼眸。<br /><br />【“放下一切，与我一起享受此刻的沉沦吧。”】<br /><br />【叮铃、叮铃。<br />空灵的银铃声从密林深处传来，那是阳光也照不进的所在。<br />没有人会踏进这片瘴气弥漫的雨林，毒雾与沼泽足以让最有勇气的冒险者却步。<br />传说，密林之中曾有古老的部族，他们围绕在蛇灵圣女周围，惑乱人心的毒雾终年不散。<br />如今，古老的部族早已消失，故土的雨林里再无人烟。<br />可她就这样从毒雾中走来了。<br />曼陀罗的花香缠在蛇鳞摩擦之间，银饰叮当作响。<br />芙拉薇娅艳丽的面容在瘴气中若隐若现，如同枯骨上开出的红花。<br />此世无人能够逃得过如此诱惑。<br />但这并非心智不坚——你既察觉到她的存在，幻毒便早已深入骨髓，无法祛除。<br />这是一生只得一次的动摇。<br />放任逃离还是纠缠陷落，在她的意念之中没有区别。<br />“特殊之人，向来值得特殊的招待。”<br />“逃吧，直到我需要你再次回到我的身旁。”<br />于是，有人逃出了那片迷障。<br />叮铃、叮铃。<br />可那铃音分明还在回响，回响在生还者的耳旁。】",
		},
		['惑世冥鳞-迷蝶'] = {
			id = 20115212,
			quality = 5,
		},
		['惑世冥鳞-渊息'] = {
			id = 20115213,
			quality = 5,
		},
		['惑世冥鳞-锦素'] = {
			id = 20115214,
			quality = 5,
		},
		['惑世冥鳞-碧幽'] = {
			id = 20115215,
			quality = 5,
		},
	},
	['艾卡'] = {
		['高校制服'] = {
			id = 20119001,
			quality = 0,
			desc = "艾卡的学生制服。是普雷顿地区最常见的款式，不过因为艾卡的身体温度很高，所以这身制服被她特别改出了几处用于散热的开口。",
		},
		['高校制服-青绿'] = {
			id = 20119002,
			quality = 2,
			desc = "艾卡的制服夏季版配色。在苍郁的树木和青草间偷偷午睡。",
		},
		['高校制服-浅樱'] = {
			id = 20119003,
			quality = 2,
			desc = "艾卡的制服春季版配色。在漫天花瓣与花粉中匆匆前往校园。",
		},
		['高校制服-流金'] = {
			id = 20119004,
			quality = 2,
			desc = "艾卡的制服秋季版配色。在缤纷落叶间寻味烤红薯的焦香。",
		},
		['高校制服-蔚蓝'] = {
			id = 20119005,
			quality = 2,
			desc = "艾卡的制服冬季版配色。呼吸寒冷的空气时抬头遥望蔚蓝天空。",
		},
		['高校制服-薄尘'] = {
			id = 20119006,
			quality = 2,
			desc = "艾卡的制服褪色版配色。洗涤的次数过多了，却总是不舍得丢弃。",
		},
		['高校制服-芋紫'] = {
			id = 20119007,
			quality = 2,
			desc = "艾卡的制服香芋版配色。其实是和紫色衣物混洗后串色的结果。",
		},
		['高校制服-浮萍'] = {
			id = 20119008,
			quality = 2,
			desc = "艾卡的制服早春版配色。是积雪消融的初春中，大地的第一抹新绿。",
		},
		['高校制服-萄嫣'] = {
			id = 20119009,
			quality = 2,
			desc = "艾卡的制服晚秋版配色。在忙碌的季节中感受收获的喜悦。",
		},
		['高校制服-靛青'] = {
			id = 20119010,
			quality = 2,
			desc = "艾卡的制服深蓝版配色，更深的颜色能够化解酱料弄洒在裙子上的危机。",
		},
		['粉色地雷'] = {
			id = 20119051,
			quality = 3,
			desc = "艾卡在时尚服饰店打工时穿着的服装。以制服为基础，加入了外面大城市流行的粉色与暗色系的潮流设计。由于在店内还要兼顾服装模特，所以艾卡经常亲自上阵展示穿搭，据说带动的销量数据相当好看。",
		},
		['摩卡高手'] = {
			id = 20119052,
			quality = 3,
			desc = "艾卡在咖啡店打工时穿着的服装。以制服为基础，采用了“店长每日推荐款”咖啡作为设计素材。由于在店内还要兼顾咖啡师，所以艾卡经常亲自上阵为顾客冲泡咖啡，据说每日售卖杯数相当可观。",
		},
		['速食游戏'] = {
			id = 20119053,
			quality = 3,
			desc = "艾卡在快餐店打工时穿着的服装。别出心裁地将高中制服和店员制服结合在一起，既符合行业标准，整体又显青春靓丽。据说上面红色滴液设计，源自艾卡开心地买了一大盘鸡块却不小心把辣椒酱打翻在上面时的悲伤经历。",
		},
		['高分少女'] = {
			id = 20119054,
			quality = 3,
			desc = "艾卡在电玩店打工时穿着的服装。以制服为基础，使用了热门游戏机为主题的涂装。由于在店内还要兼顾游戏宣传，所以艾卡经常亲自上阵和各路高手进行PK，据说其节目效果相当不俗。",
		},
		['田园物语'] = {
			id = 20119055,
			quality = 3,
			desc = "艾卡在乡下农场打工时穿着的服装。以制服为基础，结合了草原的鲜绿与土壤的深厚。热情开朗的少女在农场里颇受欢迎，就连农场的机器牧犬也喜欢追在她的身后，或许是他们之间的赛跑游戏，亦或许是……艾卡单纯地怕狗？",
		},
		['春日樱色'] = {
			id = 20119056,
			quality = 3,
			desc = "艾卡在春季庆典打工时穿着的服装，以制服为基础，结合街道旁盛开的樱花作为设计要素。在人群中穿行的身姿倒映在了每个人的眼瞳中，留下了今年春日的影子。想必，她内心中的热情也如这磅礴的春意一样温暖人心。",
		},
		['课后魔王'] = {
			id = 20119101,
			quality = 4,
			desc = "艾卡亲自穿搭的户外潮服。大胆酷炫的搭配展现着女高中生的青春狂野。至于放学后她去了哪些地方“疯狂”，暂且保密。<br /><br />【“女高中生的一天，在放学之后才算真正开始！”】",
		},
		['星河快运'] = {
			id = 20119102,
			quality = 4,
			desc = "艾卡在天文馆兼职搬运工作时的服装。由她本人亲自搭配，集合了各种科幻电影的要素，以及少女对星海的浪漫想象。在天文馆的氛围中，艾卡忽然觉得，能做上宇宙送货员或许是一件很酷的事情。<br /><br />【“如果咱家的餐馆遍布了全宇宙，我是不是得在各个星球之间送外卖啊？”】",
		},
		['夏日炽焰橙'] = {
			id = 20119103,
			quality = 4,
			desc = "这个夏日的海面大概率不会风平浪静，因为有火花小鱼的闪亮出场。她的炽焰与热情将在海底掀起一阵热烈激昂的风暴。<br /><br />【“想一睹被焚风染红的海底吗？”】",
		},
		['怒意假面'] = {
			id = 20119104,
			quality = 4,
			desc = "为了使这份堪称艺术的文化再次流行，艾卡模仿影像中的人物改造了自己的制服，为了避免被熟人辨认出来，她在面具上额外黏贴了一张她最为中意的贴纸。<br /><br />【让你们见识一下女高中生的怒火！额，其它学校的……】",
		},
		['靛色愈炎'] = {
			id = 20119105,
			quality = 4,
			desc = "在没有病痛的新世界中，也有着疗愈他人“心病”的医护人员，剪刀手是其中手法激进的一派，在这一过程中，某位平凡的女高中生依旧需要隐藏“身份”。<br /><br />【“火焰将净化，并疗愈一切。”】",
		},
		['火舞者'] = {
			id = 20119106,
			quality = 4,
			desc = "她的烈焰远比这片沙海要更为炽热，随着火舞者的舞步扬起灰烬，一场热潮即将席卷而来。<br /><br />【“为了获得新的力量，有时我们需要烧毁旧的躯壳。”】",
		},
		['不给糖就捣蛋！'] = {
			id = 20119107,
			quality = 4,
			desc = "在惊魂节游行评选中以最高票数夺得最佳视觉奖的选手“不给糖就捣蛋！”，其真实身份是一般路过的女高中生——艾卡！可爱的南瓜面具和凹凸有致的身材碰撞出了奇妙的视觉效果，当天来找艾卡拍照集邮的人是最多的。<br /><br />【“哈哈哈哈，我这身打扮确实不错呢，应该能吓到你们吧！还有，我的名字是‘艾卡’，不是什么‘给糖大使’也不是‘捣蛋小姐’，只是把参赛宣言和名字写反了而已……”】",
		},
		['假面甜心'] = {
			id = 20119108,
			quality = 4,
			desc = "专属于艾卡的打歌服，面具上的小兔子软萌可爱，但格纹蓬蓬裙和吊带背心又彰显出摇滚的态度。面具下的偶像艾卡，此刻是什么样的表情呢？<br /><br />【“虽然总是用面具来遮掩表情，但是艾卡对粉丝的一片真心，你们能感受到吧？”】",
		},
		['轻羽铃音'] = {
			id = 20119109,
			quality = 4,
			desc = "手捧托盘的女仆笑意款款，即使透过遮挡的面具，也能感受到她的欢欣与得意。很明显手上的糖果屋是她的得意之作，只是看上去有些过于甜蜜了……<br /><br />【“来到庄园，就是我们尊贵的客人了！这份见面礼就收下吧，你可一定要全部吃完啊！”】",
		},
		['游园冒险'] = {
			id = 20119110,
			quality = 4,
			desc = "女高中生的假日，当然要在游乐园度过！为赴玛德蕾娜之约，艾卡设计了新的服装，戴上了小怪兽帽子、背上了喷火龙背包。有这两个小家伙帮忙，今天无论是打气球、抓娃娃还是捞金鱼，她都不会输的！<br /><br />【“无敌的艾卡大王，在游乐园也战无不胜！”】",
		},
		['覆面兽焰'] = {
			id = 20119111,
			quality = 4,
			desc = "艾卡是冒险者公会的新成员。任谁也想不到，那怪异的兽骨面具之下，竟藏着一张可爱稚气的脸庞。初来乍到的她选择在这里接取委托、交换情报，偶尔也帮忙干些杂活。<br /><br />【“欢迎来到冒险者公会！别看我打扮得有点奇怪，我做的饭超级好吃哦！”】",
		},
		['灼火之心'] = {
			id = 20119112,
			quality = 4,
			desc = "艾卡在卡奥斯圣殿战役中穿着的战斗服。经典的罗马制式装束，昭示着其不容置疑的圣斗士身份。金属流光的月桂头冠与红发交织，宛如暗夜中燃起的火焰。<br /><br />【“这颗灼火之心，永远都不会熄灭！”】",
		},
		['宵宫雅乐'] = {
			id = 20119114,
			quality = 4,
			desc = "一场美好的庆典，怎么少得了热闹的节目，仿照记载制成的舞乐服就是此夜最好的战袍。少女的歌声从不需要伴奏，那份如升空烟火般的热情，足以让所有人都收获夏日的感动。<br /><br />【“你问我是谁？那当然是带来欢乐和幸运的狐仙大人啦！”】",
		},
		['日珥战姬'] = {
			id = 20119206,
			quality = 5,
			desc = "任何时间，任何地点，任何困难，都会为你解决！照亮普雷顿之心的火焰，蓄势于日珥装甲之中，静待时机，一飞冲天。<br /><br />【“‘英雄’……在说我吗？嘿嘿，终于等到这个从小向往的头衔落在我头上啦。不过，内心居然没有很激动？大概是守护普雷顿的信念，早已与‘艾卡’融为一体了吧！”】<br /><br />【不知名的怪兽突然袭击了普雷顿中学！外貌憨态可掬，甚至能从中找到许多可爱小动物的影子，但当它眉头紧皱，呲出愤怒的门牙时，那股气势几乎能将整座教学楼撼动。<br />“现在，英雄该登场了！”<br />以玻璃的碎裂声作为前兆，身着日珥装甲的英雄少女从高层教室一跃而出，挡在了众人身前。<br />少女身姿所到之处，皆有火焰燃烧留下的残影。灰色的庞大怪兽面前，燃起了代表勇敢与正义的火焰。<br />“爸爸妈妈和剪刀手的大家送给我这个礼物时，告诉我，是时候站出来堂堂正正守护普雷顿了。”<br />“而击败你，就是日珥战姬的第一个任务！”<br />——<br />看着睡梦中也不忘紧紧抱着礼物盒的女儿，艾卡的妈妈又好笑又无奈，只是伸出手给艾卡掖好了被角。<br />晚安，我的小英雄，普雷顿未来的大英雄。】<br />",
		},
		['日珥战姬-赤橙'] = {
			id = 20119207,
			quality = 5,
		},
		['日珥战姬-黑岩'] = {
			id = 20119208,
			quality = 5,
		},
		['日珥战姬-深潜'] = {
			id = 20119209,
			quality = 5,
		},
		['日珥战姬-蔷薇'] = {
			id = 20119210,
			quality = 5,
		},
	},
	['珐格兰丝'] = {
		['寻芳'] = {
			id = 20120001,
			quality = 0,
			desc = "珐格兰丝进行植物研究时穿着的研究服。款式干练而优雅，充分凸显了她的学者气质。",
		},
		['寻芳-龙井'] = {
			id = 20120002,
			quality = 2,
			desc = "珐格兰丝所穿研究服的换色款。清新的绿色仿佛刚冒头的茶叶嫩芽。",
		},
		['寻芳-青禾'] = {
			id = 20120003,
			quality = 2,
			desc = "珐格兰丝所穿研究服的换色款。颜色之纯净，仿佛经过提纯一般。",
		},
		['寻芳-紫韵'] = {
			id = 20120004,
			quality = 2,
			desc = "珐格兰丝所穿研究服的换色款。紫罗兰在夜色中绽放，如美酒般让人陶醉。",
		},
		['寻芳-深玫'] = {
			id = 20120005,
			quality = 2,
			desc = "珐格兰丝所穿研究服的换色款。深玫红色更能衬托她的成熟气质。",
		},
		['寻芳-秋叶'] = {
			id = 20120006,
			quality = 2,
			desc = "珐格兰丝所穿研究服的换色款。秋叶般的色调预示着即将到来的冬天。",
		},
		['寻芳-蓝调'] = {
			id = 20120007,
			quality = 2,
			desc = "珐格兰丝所穿研究服的换色款。蓝色不止代表忧郁，也代表着内心的平静。",
		},
		['寻芳-罗勒'] = {
			id = 20120008,
			quality = 2,
			desc = "珐格兰丝所穿研究服的换色款，辛盈清苦，回味无穷。",
		},
		['寻芳-月露'] = {
			id = 20120009,
			quality = 2,
			desc = "珐格兰丝所穿研究服的换色款。如月光照耀的露珠般青蓝，让人联想到夜晚绽放的仙昙。",
		},
		['香萦瑰夏'] = {
			id = 20120051,
			quality = 3,
			desc = "“每种咖啡豆都有不同的香味呢。”<br />珐格兰丝把面前的咖啡杯推到艾卡面前。<br />“这一款闻起来有花香和果香，应该会很好喝。”<br />“果香？是水果那样甜甜的味道吗！……哇哇哇好酸！！！”",
		},
		['春樱缤纷'] = {
			id = 20120052,
			quality = 3,
			desc = "春天是珐格兰丝最喜欢的季节，万物复苏，生机盎然。<br /><br />【“今年的第一款香氛，就制作樱花香味的吧。”】",
		},
		['古堡探险'] = {
			id = 20120053,
			quality = 3,
			desc = "在剪刀手一行人的古堡探险挑战中，最快走出来的居然是戴着眼罩的珐格兰丝。<br /><br />【“蝙蝠用回声定位，我用味道定位……古堡外的空气，确实要更清新一些呢。”】",
		},
		['幽蓝水母'] = {
			id = 20120054,
			quality = 3,
			desc = "在和剪刀手的其他伙伴一起参观完水族馆后，珐格兰丝给自己制作了一件以水母为主题的装扮。<br /><br />【“水母……像盛开在海底，幽蓝的花。”】",
		},
		['暗香疏影'] = {
			id = 20120055,
			quality = 3,
			desc = "珐格兰丝探访香雪海时穿着的服装。雪光如昼的冬日，梅花如期盛放在她飞舞的衣角上，弥散出了一缕幽香。",
		},
		['橙果凝调'] = {
			id = 20120056,
			quality = 3,
			desc = "空气本身是没有味道的，我们闻到的气味实际上是细小的分子，而现在这清新，芬芳的气息来源于柑橘的果肉与油脂，就当作她赠予我们的礼物吧。",
		},
		['香染山麝'] = {
			id = 20120057,
			quality = 3,
			desc = "这种偶然间寻得的古老技艺让珐格兰丝非常惊喜，它平静，简洁，淡雅，一如她安心研究时窗外的天气。<br />“何处觅芳影，烟岚云岫，再上雨花亭。”",
		},
		['抚创香氛'] = {
			id = 20120102,
			quality = 4,
			desc = "珐格兰丝的医护装扮。无论她本人对这类穿着是否习惯，要做的事情都是一样的，治愈病患，抚平创痛。<br /><br />【“请好好休息一下吧。”】",
		},
		['探漠人'] = {
			id = 20120103,
			quality = 4,
			desc = "跟随地图的指引，在科斯迷特的沙漠中寻找传说中的香氛原料，为了抵抗炎热的天气，珐格兰丝也换上了一身清凉的装扮。<br /><br />【“跟着香气走吧，带着眼罩是看不见地图的。”】",
		},
		['夜城声息'] = {
			id = 20120104,
			quality = 4,
			desc = "斑斓的光芒从这座城市溢出，随着射灯的角度，映向漆黑的夜空。在那昙华般绽放的光幕中央，那道身影倾听着城市的声浪，也轻嗅着城市的味道。<br /><br />【“误解，仇恨，暴力，这片土地不该一直被这些缠绕。”】",
		},
		['雪夜绮星'] = {
			id = 20120105,
			quality = 4,
			desc = "珐格兰丝很喜欢冬日的雪夜，尤其是站在路灯下，仰望雪花一片片飘落。那片幽深的蓝却能孕育如此纯净的白，也许这就是自然的馈赠吧。<br /><br />【“当雪花落在你的掌心，他们不是消失了，而是融入为了你身体的一部分。”】",
		},
		['点墨入池'] = {
			id = 20120106,
			quality = 4,
			desc = "在沐春节到来之际，珐格兰丝以‘锦鲤’为主题设计了新的作战服。主色调为黑白，点缀一抹优雅的红，如同水墨画中跃出的一尾锦鲤。<br /><br />【“说我像是水墨画中走出来的人吗？哎呀，能被当作古迹的再现，也不枉我花费不少时间设计这套作战服呢。”】",
		},
		['暗夜颂者'] = {
			id = 20120107,
			quality = 4,
			desc = "永夜古堡背后的长廊通往一片花园，里面种植着无数奇异诡丽的植物。人们总是好奇，花园的主人珐格兰丝是如何将这些植物打理得如此繁茂的，却没有人敢真的上前询问。<br /><br />【“这些植物的养料是什么？当然是我制作的培养剂了。唔？你的表情怎么有点失望？”】",
		},
		['云中芳色'] = {
			id = 20120109,
			quality = 4,
			desc = "她是空中盛放的花朵，呵护着旅人穿过寒潮和雾雨，向着天际的太阳追寻。有她相伴的旅程里，再急骤的风暴，也会在温柔的芳菲中变得宁静。<br /><br />【“一处栖霞的馥郁，一段旅行的流连。”】",
		},
		['花漾圣裔'] = {
			id = 20120110,
			quality = 4,
			desc = "与“清漪”签订契约的魔法少女珐格兰丝的战斗服，珊瑚间散落着倒映的星河，涟漪在芬芳中绽放，她是花海，是生命馥郁的波光。<br /><br />【“我可以是滋养万物的清泉，也可以是涤荡罪恶的洪涛。”】",
		},
		['珠涟曼彩'] = {
			id = 20120111,
			quality = 4,
			desc = "珐格兰丝在嘉年华海岸音乐节会场穿着的泳装，一朵花停留在盛夏的海岸，她安静地等待着海浪的轻抚，为这个热烈的季节，献上一场宁静的绽放。<br /><br />【“浪花穿过了我们的脚尖，那个漩涡很轻很轻，像一片会消失的花瓣。”】",
		},
		['桑榆琼芳'] = {
			id = 20120112,
			quality = 4,
			desc = "珐格兰丝化身古老部落的医女。她从古方中获取灵感，将植物的芳华流转于指尖，化作治愈的良药，令远行的旅者不必担心伤痛，她能够治愈一切毒痈。<br /><br />【“从自然中汲取生命的力量，这便是治愈之术最本初的模样。”】",
		},
		['溯光圣祈'] = {
			id = 20120206,
			quality = 5,
			desc = "“光之弦”传承者、溯光派领袖、圣女珐格兰丝特有的服装。以花做冠，散落光辉，以蔓为铠，缚锁黑暗；纵然世界灾劫未尽，但她披荆执锐的身影，将会绽放不朽的希望。<br /><br />【吾身化不败的花蕊，祈吾人之一族，溯光明，永盛放。】<br /><br />【光之弦的传承者珐格兰丝曾是“暗之塔”的守望者。<br />无人知晓她在暗之塔中经历的岁月，只知在她驻守的年代，暗之弦的崩溃只发生过一次。<br />“崩溃”侵袭之日，驰援暗之塔的战士怀着赴死之心踏入，却只见珐格兰丝神情从容宁静，满身密布伤痕。<br />少女用怀抱紧缚暗之弦的暴动，以自己的凋零，换来所有生命的新生。<br />人们将她置入花棺，封于“光之塔”底，期待光之弦的生机能带来奇迹。<br />而奇迹之花的盛放，始于“崩溃”的再次侵袭。<br />光与暗在珐格兰丝的体内交缠相生，如荆棘上盛开了花蕾，她的生命踏入超凡的存在。<br />苏醒的珐格兰丝将“崩溃”的力量隔断，“圣女”在此刻降生。<br />溯光者们迎来了新的领袖。<br />但珐格兰丝仍能窥见“崩溃”重临的未来，她决定寻找人间的一切力量，共同抵御毁灭一切的威胁。<br />先哲既逝，她将与后来者披荆执锐，护人类之光不灭长存。】",
		},
		['溯光圣祈-莹菱'] = {
			id = 20120207,
			quality = 5,
		},
		['溯光圣祈-穹夜'] = {
			id = 20120208,
			quality = 5,
		},
		['溯光圣祈-蚀蔷'] = {
			id = 20120209,
			quality = 5,
		},
		['溯光圣祈-辉冠'] = {
			id = 20120210,
			quality = 5,
		},
	},
	['忧雾'] = {
		['弦能拘束'] = {
			id = 20121001,
			quality = 0,
			desc = "欧泊对忧雾进行“监管”后，特意为她定制了一款带有弦能抑制功能的战斗服。是限制，也是一种保护。",
		},
		['弦能拘束-淡紫余韵'] = {
			id = 20121002,
			quality = 2,
			desc = "忧雾所穿着的作战服换色款。在原本的基础款式上增添了一抹浅紫，据说这是忧雾喜欢的颜色。",
		},
		['弦能拘束-浅草初春'] = {
			id = 20121003,
			quality = 2,
			desc = "忧雾所穿着的作战服换色款。色调清新淡雅，春天到来的时候，如果有机会穿着它去踏青，感觉应该会很不错。",
		},
		['弦能拘束-粉桃朵朵'] = {
			id = 20121004,
			quality = 2,
			desc = "忧雾所穿着的作战服换色款。点缀了充满少女气息的粉色，忧雾穿上意外很合适。",
		},
		['弦能拘束-漫步深林'] = {
			id = 20121005,
			quality = 2,
			desc = "忧雾所穿着的作战服换色款。深绿的色调如同漫步在森林中，头顶的阳光被遮蔽，只留一地斑驳。",
		},
		['弦能拘束-成熟气质'] = {
			id = 20121006,
			quality = 2,
			desc = "忧雾所穿着的作战服换色款。深粉的色调让整体气质都更显成熟，似乎在战斗中也更可靠了。",
		},
		['弦能拘束-一颗酸杏'] = {
			id = 20121007,
			quality = 2,
			desc = "忧雾所穿着的作战服换色款。淡淡的黄色，像一颗还未成熟的酸杏，还需要一些成长的时间。",
		},
		['蒸汽奶泡'] = {
			id = 20121051,
			quality = 3,
			desc = "比起醇香苦涩的咖啡，忧雾更喜欢在别人制作完拿铁后，用剩余的牛奶给自己做一份热乎乎的蒸汽奶。不苦，很香，就像把云朵吞进肚子里的感觉。",
		},
		['抹茶橙片'] = {
			id = 20121052,
			quality = 3,
			desc = "在蛋糕里加上足够多的抹茶粉，本该入口即化的甜蜜，也变得有些苦涩。还好有橙片的点缀，让这份苦涩的回味保留一丝甘甜。",
		},
		['前方危险'] = {
			id = 20121053,
			quality = 3,
			desc = "再危险的任务，忧雾也都是面不改色地直接接受。<br /><br />“这很难吗？我其实觉得还好。危险的地方，就让我去探索吧。”",
		},
		['永恒的紫罗兰'] = {
			id = 20121055,
			quality = 3,
			desc = "忧雾喜欢紫罗兰盛开的季节，这样她就能躺在那片与她相称的紫色海洋里，任由无尽的浪漫与幻想在眼前翻涌。<br /><br />【“或许在梦境里，我能抓住幸福的机会。”】",
		},
		['溟海孤云'] = {
			id = 20121056,
			quality = 3,
			desc = "忧雾仍然记得那曾经困住自己的黑暗，但在浩瀚的孤独中，她依然倔强地寻到了自己前进的方向。<br />“你看到海底的星星了吗，那是小水母努力寻找光的证明。”",
		},
		['春樱折枝'] = {
			id = 20121054,
			quality = 3,
			desc = "春天到了，欧泊组织团建，也带上了总是闭门不出的忧雾，还为她特意定做了新衣服，忧雾有些别扭地穿上了。<br /><br />“应该不会很奇怪吧，我穿上的样子。”",
		},
		['梅落寒枝'] = {
			id = 20121057,
			quality = 3,
			desc = "梅花落在枝头，融化后，就是下一个春天。",
		},
		['灰羽舞者'] = {
			id = 20121101,
			quality = 4,
			desc = "欧泊的换装舞会，忧雾也获得了参加的资格，这次为她准备服装的是伊薇特。羞涩的研究员少女举起轻盈的芭蕾舞裙，小声说：“希望你喜欢……那个，忧雾穿上一定很好看……”<br /><br />【“明明跟我说话都紧张得不行，却坚持要为我准备衣服，说什么‘之前也有人为她准备过’。欧泊的人果然还是很奇怪啊。”】",
		},
		['千禧偶像'] = {
			id = 20121102,
			quality = 4,
			desc = "在设计自己的专属打歌服时，忧雾展现出了对复古风格的强烈喜爱。最终呈现出的效果，俨然是千禧年海报上的少女偶像。<br /><br />【“平时只能在杂志上看到这种装扮……偶尔打扮成这样，感觉也挺不错。”】",
		},
		['墨染梅香'] = {
			id = 20121103,
			quality = 4,
			desc = "又是一年沐春节到来，欧泊为今年表现优异的员工设计了新的制服，忧雾也分到一件。虽然嘴上不说，但其实能看出来她很喜欢。<br /><br />【“特意为我设计的吗？我说怎么突然问了我那么多关于喜好的问题。我确实很喜欢……你们费心了。”】",
		},
		['力速双A'] = {
			id = 20121104,
			quality = 4,
			desc = "在一年一度的校运动会拳击总决赛中登场的选手是——欸，是忧雾吗？和其他选手比起来，忧雾选手似乎身材更加瘦弱一些呢。忧雾选手向裁判点头示意了！状态看上去很好嘛！忧雾选手摆好了姿势！忧雾选手出拳了！对面选手……倒下了？<br /><br />【“谢谢组委会颁给我的奖牌，虽然这是我自己一拳打出来的结果。不过我还有一个疑问，这真的是对面最强的选手吗？”】",
		},
		['假日邂逅'] = {
			id = 20121105,
			quality = 4,
			desc = "忧雾为假日出行设计的服装，粉色制服裙和可爱的游乐设施相映成趣。奇趣游乐园门口，忧雾被两个女孩叫住了，一张门票被塞进掌心，一段奇妙旅程就此展开。<br /><br />【“她们喊着“买二送一”、“薅羊毛”什么的就冲上来了。不过，和她们度过的一天，很开心很开心。”】",
		},
		['晴霄涡灵'] = {
			id = 20121107,
			quality = 4,
			desc = "掌控着“气旋”的魔灵使忧雾的战斗服，云朵包裹着少女的秘密，雾霭蕴藏着魔法的典仪，她是风息，是万象流转间诞生的韵律。<br /><br />【“相信我，风会在迷惘的雾气中带你找到出口，千万里始终，千万次亦然。”】",
		},
		['幽夜丝绒'] = {
			id = 20121108,
			quality = 4,
			desc = "出人意料地，忧雾也报名了“迷梦芭蕾夜”的表演。她别出心裁地改编了传统舞剧中的反派形象，用自己的经历，重新诠释那一段经典的变奏曲。<br /><br />【“黑夜里的舞者吗……嗯，很适合我。”】",
		},
		['三途雾徊'] = {
			id = 20121206,
			quality = 5,
			desc = "于幽冥彼岸现身的武者，踏雾而来，引渡亡魂，在未见到她前，那些执念永远不知道这彼岸之萤是否真的能点亮净世的灵火，唯有盛开在曾被灾厄浸染之地的彼岸花知晓，她曾来过。<br /><br />【“放心，我才不是阴阳师，只有他们才有收服你的兴趣。”】<br /><br />【“于这弦能幽微、明暗交织的常世之中，现世与彼岸宛若镜之两面，相依而生。<br />生者栖于阳面，享现世之醇美，亡者囿于阴面，受彼岸之裁夺，此为因果之理，维系天地循环。<br />然，有执念深重之亡者，将行彼岸，踌躇狭间，贪恋生欢，徘徊不散，怨而拒返，终成「罪灵」，酿成祸乱。<br />罪灵之罪，一有侵占生者之躯，扭曲善洁；二有玷污现世之地，散播邪秽。<br />其心癫狂，胎结恶果，其行如瘴，俱是业障。<br />然，灾厄现世，致令彼岸花生，雾影通幽，渡来复净之人。<br />世人颂言：<br />有少女曼珠随行，灵火缭身，执祓除之神器，涤罪灵之污浊。灾祸中显其芳踪，光明处隐入烟尘。<br />或曰：<br />彼岸门开，有女独行，鬼首覆面，头生异角，袖间流火，焚罪灵于血雾；足踊花零，净秽土引桥生。<br />然，世言种种，终成流言，若常世无忧，则花雾不现。<br />其行过处，火照路开，万孽驱祓。唯余落花寂影。”——《花夜行抄》】",
		},
		['三途雾徊-汐潮风'] = {
			id = 20121207,
			quality = 5,
		},
		['三途雾徊-狱散花'] = {
			id = 20121208,
			quality = 5,
		},
		['三途雾徊-溟细雪'] = {
			id = 20121209,
			quality = 5,
		},
		['三途雾徊-鸦胧月'] = {
			id = 20121210,
			quality = 5,
		},
	},
	['玛拉'] = {
		['暗影幽魂'] = {
			id = 20122001,
			quality = 0,
			desc = "如幽魂潜伏于暗影，如死神般降临。踪迹难寻，却又无处不在——正如死亡本身。",
		},
		['暗影幽魂-苍青'] = {
			id = 20122002,
			quality = 2,
			desc = "玛拉的备用作战服，行走在夜色中时，只会留下一道苍青的影子。",
		},
		['暗影幽魂-深蓝'] = {
			id = 20122003,
			quality = 2,
			desc = "玛拉的备用作战服，浓墨重彩的一笔蓝，正如夜空深邃的眼眸。",
		},
		['暗影幽魂-深绿'] = {
			id = 20122004,
			quality = 2,
			desc = "玛拉的备用作战服，深重而沉稳的绿色亦能彰显她的个性。",
		},
		['暗影幽魂-绛紫'] = {
			id = 20122005,
			quality = 2,
			desc = "玛拉的备用作战服，紫色既能代表高贵优雅，也能彰显冷酷与强势。",
		},
		['暗影幽魂-焦黄'] = {
			id = 20122006,
			quality = 2,
			desc = "玛拉的备用作战服，一抹焦黄，伴随着她行走在苍茫大地上。",
		},
		['暗影幽魂-紫红'] = {
			id = 20122007,
			quality = 2,
			desc = "玛拉的备用作战服，在紫色的基础上增加了一抹红调。",
		},
		['层峦叠翠'] = {
			id = 20122051,
			quality = 3,
			desc = "玛拉的个人定制服装。当一线阳光穿过重重山脉，绿意也随之盎然。",
		},
		['摩加佳巴'] = {
			id = 20122052,
			quality = 3,
			desc = "玛拉的改装作战服，设计灵感来源于玛拉小时候常喝的家乡饮料，虽然这种味道似乎有些过于刺激了。",
		},
		['暗夜蝠影'] = {
			id = 20122053,
			quality = 3,
			desc = "玛拉的改装作战服，设计灵感来源于蝙蝠。日常生活中，玛拉也同蝙蝠一般，时常昼伏夜出。",
		},
		['黄色警戒'] = {
			id = 20122054,
			quality = 3,
			desc = "玛拉的改装作战服，如同一道黄色的闪电，预警着极端危险的到来。",
		},
		['赛博音符'] = {
			id = 20122055,
			quality = 3,
			desc = "玛拉的改装作战服，如同随机波动的音量般，带有迷幻的电子色彩。",
		},
		['逐魂律令'] = {
			id = 20122101,
			quality = 4,
			desc = "玛拉在希达半岛行动时特制的作战服，参考了当地传说中的经典款式，既能完成隐匿作战的需要，也能在行动中获得当地普通民众的支持。<br /><br />【“行于黑暗者并非只能凝望深渊，也有机会在长夜中点燃光明。”】",
		},
		['亡灵女爵'] = {
			id = 20122102,
			quality = 4,
			desc = "背负着无数传闻和秘密、已经消失许久的亡灵女爵玛拉再次出现，是在永夜古堡的晚宴上。显然，这次灵蝶邀请来了一位贵客。<br /><br />【“哈，闯入者？现在，看着我的邀请函再说一次？”】<br />",
		},
		['暮落怨叹'] = {
			id = 20122103,
			quality = 4,
			desc = "玛拉在“远征计划”中所用作战服的重制款，与夜幕相衬的战服让战士以无惧的姿态孤身赴险，踏入黑暗，为后来者开辟出一道通往光明的航线。<br /><br />【“无需为我加封，我战斗，只为我之正义，世之公理。”】",
		},
		['月咏原罪'] = {
			id = 20122104,
			quality = 4,
			desc = "这是为万圣节剧本《血之契约》特别定制的服饰。当月亮悬于暗色城堡之上，昼伏夜出的吸血鬼伯爵玛拉悄然现身。她静候那些即将赴宴的客人，将真实意图隐匿于诡谲的行动之中。<br /><br />【“永生永世，我都无法拥抱光明。”】",
		},
		['溟光幽落'] = {
			id = 20122105,
			quality = 4,
			desc = "玛拉在嘉年华海岸音乐节会场穿着的泳装，无法触碰的深寒化为夏日的清凉，只因为幽深的海底也见到了属于自己的阳光。<br /><br />【“我不做无意义的准备，至少为这一刻，很值得。”】",
		},
	},
	['蕾欧娜'] = {
		['监理'] = {
			id = 20123001,
			quality = 0,
			desc = "作为欧泊工程部的部长，蕾欧娜对一切诞生于此的建筑负责。每当她作为监理出现在施工现场，都会引起下属们的窃窃私语：“部长真的很严格！”",
		},
		['监理-军绿'] = {
			id = 20123002,
			quality = 2,
			desc = "蕾欧娜的备用作战服，质朴的军绿色凸显出她严谨认真的性格。",
		},
		['监理-原野'] = {
			id = 20123003,
			quality = 2,
			desc = "蕾欧娜的备用作战服，辽阔的原野一望无际，静静等待来访者的探索。",
		},
		['监理-苍蓝'] = {
			id = 20123004,
			quality = 2,
			desc = "蕾欧娜的备用作战服，苍蓝天穹照耀着的，是建设者勇敢而进取的心。",
		},
		['监理-褐岩'] = {
			id = 20123005,
			quality = 2,
			desc = "蕾欧娜的备用作战服，九层之台，起于累土，看似最普通的岩石，其实是一切的基础。",
		},
		['监理-砂玫'] = {
			id = 20123006,
			quality = 2,
			desc = "蕾欧娜的备用作战服，深玫粉色让她的气质更显稳重亲和。",
		},
		['监理-绛紫'] = {
			id = 20123007,
			quality = 2,
			desc = "蕾欧娜的备用作战服，绛紫的优雅在她身上显露无遗。",
		},
		['咖色生活'] = {
			id = 20123055,
			quality = 3,
			desc = "蕾欧娜的个人定制服装，特别选用了她喜欢的咖啡图案。对工作繁忙的她来说，只要穿上这身衣服，立马就能感受到一种苦涩与甘甜交织的滋味。<br /><br />【“是时候休息片刻，来一杯由时间萃取的咖啡了。”】",
		},
		['古堡探险'] = {
			id = 20123051,
			quality = 3,
			desc = "除了负责建筑建造之外，欧泊工程部的职能也包括前期的实地调查和勘探。至于这次的目标地点为什么是一栋古堡……这就是另一个故事了。<br /><br />【“工程部全体成员，跟紧我，报数！”】",
		},
		['电力充足'] = {
			id = 20123052,
			quality = 3,
			desc = "虽然知道施工现场有备用发电装置，但在每天开工前，检查两遍设备的状态和设置是否正确，已经成为了蕾欧娜的固定习惯。<br /><br />【“很好，电力充足，随时可以开工！”】",
		},
		['安全驾驶'] = {
			id = 20123053,
			quality = 3,
			desc = "蕾欧娜认真细致的工作习惯显然也延续到了生活中，那些有幸坐上她副驾驶的人，都要在享受旅途前接受一番拷问。<br /><br />【“安全带系好了吧？再检查一遍。”】",
		},
		['远古印记'] = {
			id = 20123054,
			quality = 3,
			desc = "这套制服的设计灵感来源于某次工程部的异域探索行动，神秘的流沙、高大的石柱和柱子上栩栩如生的灵兽给蕾欧娜留下了深刻的印象。<br /><br />【“这些都是古老文明留下的印记，如果可以的话，希望能保留到新生的建筑上。”】",
		},
		['地心勘测'] = {
			id = 20123101,
			quality = 4,
			desc = "地心开发与建设是一个漫长的工作，需要严明的纪律，完善的流程，勇敢的领袖和聪明的工程师，而恰好这些都是她擅长的领域。<br /><br />【“别担心，规划区就在这里，向下三百米，我们一定能发掘奇迹。”】",
		},
		['华檐鳞瓦'] = {
			id = 20123102,
			quality = 4,
			desc = "“幻梦求真录”历史文化展览在沐春期间连续举办，在卡丘人之中掀起了一股仿古风潮。人们仿照古壁画中仙人的服装制式，设计了一系列典雅、精致、飘逸的服装。<br /><br />【“咳咳，别一直盯着我看，大家回到工作岗位上吧。虽然节日将近，但还是要保持工作状态啊。”】",
		},
		['次元协警'] = {
			id = 20123103,
			quality = 4,
			desc = "蕾欧娜作为电玩比赛现场工作人员所穿着的服装，展露出了她率性洒脱的另一面。相信在蕾欧娜的维护下，现场的秩序一定会井井有条……吧？<br /><br />【“那位打扮奇特、行踪可疑的先生！请停在原地，接受工作人员的问询！诶！不许跑！”】",
		},
		['境域誓约'] = {
			id = 20123104,
			quality = 4,
			desc = "欧泊为蕾欧娜参照过去“远征计划”设计的作战服，贴身的款式保证了充分的行动力，古典的甲胄确保防护的同时，也展现其战士的丰姿。<br /><br />【“奔赴远方，构筑新的战场，这就是我的使命。”】",
		},
		['疾速航行'] = {
			id = 20123105,
			quality = 4,
			desc = "蕾欧娜参加海滨竞速俱乐部摩托艇比赛时穿着的服装。为了减少骑行阻力，蕾欧娜的泳衣使用特殊材料制作，贴合身体曲线的同时又不会过于紧绷，非常适用于海上运动场景。<br /><br />【“怎么样，我健身的成果不错吧？毕竟，力量在什么时候都不可或缺啊。”】",
		},
		['醺醺童子'] = {
			id = 20123106,
			quality = 4,
			desc = "传说在战阵之中，有一座城塞，其中高坐着一位豪气的君王，她豪饮后吞吐的醉意，能够化作阻滞恶灵侵袭的城墙，与她同行过的战士说，她只是挥手，就能在荒芜中构起华宴。<br /><br />【“不不不，我打仗时候从不喝酒，打仗喝酒会头痛。”】",
		},
		['升维航路'] = {
			id = 20123107,
			quality = 4,
			desc = "蕾欧娜在“无限巅峰超弦装甲大奖赛”中使用的战衣，用经典的旅航设计诠释着人类对更高空间求索中的浪漫期待，以优雅的姿态向未知致以启航的决心。<br /><br />【“茫茫黑暗，旅夜漫长，但旅途本身就会创造名为奇迹的风景。”】",
		},
		['凝彩铅华'] = {
			id = 20123108,
			quality = 4,
			desc = "欧泊的研究室复原出了一种传统涂料，这种涂料在特定条件下会产生变幻莫测的纹理与色彩，对研究弦的变化具有非常积极的意义。而对于工程师和设计师而言，这种类似“釉料”的涂料，给了他们新的灵感。<br /><br />“这色彩古朴而庄重，如同建筑本身一般。”",
		},
	},
	['千代'] = {
		['御天织'] = {
			id = 20125001,
			quality = 0,
			desc = "千代正式加入搜查官部门后，结合其本人喜好与作战风格改制的作战服，脱胎于古典的设计，在实现作战功能的同时，一展少女搜查官的风致。",
		},
		['御天织-琥珀'] = {
			id = 20125002,
			quality = 2,
			desc = "千代的备用作战服，明媚的颜色即使在深雾中也能透出华彩。",
		},
		['御天织-樱宴'] = {
			id = 20125003,
			quality = 2,
			desc = "千代的备用作战服，清丽的颜色足以在春日中成为一道盛景。",
		},
		['御天织-麹尘'] = {
			id = 20125004,
			quality = 2,
			desc = "千代的备用作战服，淡雅的颜色能够让少女与山野合而为一。",
		},
		['御天织-黛紫'] = {
			id = 20125005,
			quality = 2,
			desc = "千代的备用作战服，华美的颜色衬托出了少女典雅的气质。",
		},
		['御天织-黛玫'] = {
			id = 20125006,
			quality = 2,
			desc = "千代的备用作战服，沉静的颜色喻示着穿戴者慎守的法度。",
		},
		['御天织-无心'] = {
			id = 20125007,
			quality = 2,
			desc = "千代的备用作战服，温和的颜色仿若新出的绿芽抚慰人心。",
		},
		['墨尽孤云'] = {
			id = 20125051,
			quality = 3,
			desc = "千代的个人定制服装，取自她喜欢的古画墨色，如置身画境，令人放空身心。<br /><br />【“残砚染丹青，枯山寒枫浸瘦水，点墨化孤云。”】",
		},
		['御前警示'] = {
			id = 20125052,
			quality = 3,
			desc = "千代的个人定制服装，使用明亮且易于辨识的颜色，威慑宵小，警示罪犯。<br /><br />【“请注意您的行为，否则可能会被采取强制措施。”】",
		},
		['异邦苦茶'] = {
			id = 20125053,
			quality = 3,
			desc = "千代的个人定制服装，结合特制饮品的调色，醇厚且富有年代感。<br /><br />【“午后无事，调制咖啡，啜饮时光，此为佳品。”】",
		},
		['眠樱吹雪'] = {
			id = 20125054,
			quality = 3,
			desc = "千代的个人定制服装，花色与雪色相承，恰如不经意间流露的温婉。<br /><br />【“樱花之生固然短暂，绚烂之景却可传颂千年。”】",
		},
		['胭脂红霞'] = {
			id = 20125055,
			quality = 3,
			desc = "千代的个人定制服装，以水红胭脂进行晕染，使裙摆渐变如烟霞。<br /><br />【“当那位戴着狐面的信使现身时，是否会在扇影摇曳间给予人们幸福？”】",
		},
		['射手锋仪'] = {
			id = 20125101,
			quality = 4,
			desc = "千代在搜查官射击竞赛中穿着的定制服装，结合她的射击风格与修行习惯使用了古典风格的防护措施，充分解放运动能力的同时，也展现了少女不同平日的活力风致。<br /><br />【“金牌？我并没有很在意，但既已踏上赛场，就该拼尽全力，此即，射礼。”】",
		},
		['海滨萌趣'] = {
			id = 20125102,
			quality = 4,
			desc = "千代参加海滨竞速俱乐部水枪比赛时穿着的服装。精致的蝴蝶结和蓝色轻纱让身为少女的她更显柔美，至于海鸥装饰的箭筒，那就是另一个小巧思了。<br /><br />【“经常听伙伴们说，‘去码头整点薯条’，这次，我提前给大家准备了一些。”】",
		},
		['秋枫鸣狩'] = {
			id = 20125103,
			quality = 4,
			desc = "千代参加秋日出游活动时穿着的定制服装，下装是轻便且适宜步行的裤装和长靴，上装则是款式优雅的长袖衬衫。为了让着装不会太过严肃，她特意搭配了撞色围巾和晴天娃娃配饰。<br /><br />【“在这个季节，山间的温度还是有些低的。不过等到太阳出来就会变得暖融融啦。”】",
		},
		['稻荷绮肴'] = {
			id = 20125104,
			quality = 4,
			desc = "治安局的民意支持活动中，千代作为女仆店店员登场亮相的服装，混合了两种不同职业的设计理念，含蓄而文雅地表现出她本人的不同风貌。但穿着者拒绝承认是因为自己被可爱的萌物所倾倒。<br /><br />【“请不要叫我狐仙小姐……那……那只是……按照规定……”】",
		},
		['绛雪丹茗'] = {
			id = 20125105,
			quality = 4,
			desc = "离开家族的禁锢，千代才发现外面还有这么多有趣的节日与习俗。第一次参加花朝典仪的她，特意以自己喜爱的花卉为题准备了服装，还尝试了新的形制。<br /><br />【“簌簌绯雪，灼灼彤霜，啾啾雀鸣，脉脉幽芳。”】",
		},
		['花游舞夜'] = {
			id = 20125206,
			quality = 5,
			desc = "她换上了亲手制成，精心设计的衣装，来赴这场期待了太久的约定。她也下定了决心，要在漫天花火绽放的时分，用酝酿很久的勇气，说出那些藏在心底的话语。<br /><br />【“再给我一点点时间，去眺望这倒映在海中的耀眼。”】<br /><br />【“花火祭典，是许多许多心愿的终点。”<br />千代已经有些忘记了是从哪里看到关于花火大会的记载，在很久的过去和很远的故土里，人们会用一场盛大的庆典来迎接新的希望，扫去旧的烦恼，为往生者献上祝祷，为现世传递美好。<br />而这些美好的寓意，现在也终于可以在卡丘世界的夜空亮起。<br />虽然筹办的过程很辛苦，但结局还是令千代和伙伴们满意——有很多人都愿意参加这场希望、祝福、与爱的庆典。<br />以及，一场只有在花火大会上才能实现的约定。<br />她应该如何出现在那里？素净的脸上看不出少女的苦恼，只有微微颤抖的弓弦暴露出她的心情。<br />作为庆典的守护者，她需要整装待发，维持和平与秩序；可作为庆典中的游人，她也只想和重要的人一起，享受这份独特的温情。<br />她最终还是穿上了这件漂亮的浴衣，每一道纹都是她亲手绘制的心意。<br />她想履行那个约定，想被看见，想要成为哪怕转瞬即逝，也会被铭记整个夏天的耀眼。<br />她想要永远记住这场庆典。<br />在花火升空之前。<br />“花火祭典，是许多许多故事的起点。”】",
		},
		['花游舞夜-霜枫'] = {
			id = 20125207,
			quality = 5,
		},
		['花游舞夜-恋樱'] = {
			id = 20125208,
			quality = 5,
		},
		['花游舞夜-松烟'] = {
			id = 20125209,
			quality = 5,
		},
		['花游舞夜-浮世'] = {
			id = 20125210,
			quality = 5,
		},
	},
	['汐'] = {
		['邦邦代打'] = {
			id = 20130001,
			quality = 0,
			desc = "汐的专用工作服，虽然本司员工只有一位，但并不妨碍她给您的大量对手邦邦两拳。",
		},
		['邦邦代打-蔚蓝天'] = {
			id = 20130002,
			quality = 2,
			desc = "汐的替换工作服，晴天的时候穿这件，像是把天空穿在身上。",
		},
		['邦邦代打-薄雾紫'] = {
			id = 20130003,
			quality = 2,
			desc = "汐的替换工作服，紫气东来披在身，一看就能接大单。",
		},
		['邦邦代打-青草地'] = {
			id = 20130004,
			quality = 2,
			desc = "汐的替换工作服，摸鱼的时候躺在草地上，谁也发现不了。",
		},
		['邦邦代打-薄荷糖'] = {
			id = 20130005,
			quality = 2,
			desc = "汐的替换工作服，在炎热的夏日出外勤时，带来一丝清凉。",
		},
		['邦邦代打-柠檬水'] = {
			id = 20130006,
			quality = 2,
			desc = "汐的替换工作服，困倦的时候嚼一片柠檬，提神醒脑。",
		},
		['邦邦代打-蜜桃茶'] = {
			id = 20130007,
			quality = 2,
			desc = "汐的替换工作服，少女感十足的粉色，像一杯蜜桃果茶。",
		},
		['邦邦代打-橙住气'] = {
			id = 20130052,
			quality = 3,
			desc = "汐的高级替换工服，彰显她的工作态度与专业素养，完成任务要镇定！",
		},
		['邦邦代打-放点水'] = {
			id = 20130053,
			quality = 3,
			desc = "汐的高级替换工服，彰显她的机敏反应与沉稳心态，冲突未起先告饶！",
		},
		['邦邦代打-蝠不蝠'] = {
			id = 20130054,
			quality = 3,
			desc = "汐的高级替换工服，彰显她的强而有力与高超技巧，有了靠山要示威！",
		},
		['邦邦代打-樱樱怪'] = {
			id = 20130055,
			quality = 3,
			desc = "汐的高级替换工服，彰显她的温和内在与细腻思考，不可力敌就卖乖！",
		},
		['绒绒衔春'] = {
			id = 20130101,
			quality = 4,
			desc = "汐在沐春节前购置的新衣，来自乌尔比诺高端服装品牌线，是她平时很少尝试的风格。不过难得与新朋友们一起过节，汐决定挑战自己。<br /><br />【“怎么样，这套衣服和我今天要放的鞭炮很配吧？每年沐春节，我最期待的就是这个了！”",
		},
		['秘宴华裙'] = {
			id = 20130102,
			quality = 4,
			desc = "乌尔比诺的夜宴并非只是灯红酒绿之地，往往也是另一场不见兵锋的战局——但在盛装出席的代行者眼中，兵锋只藏在眼中与裙下，它依旧冷厉，且从未收起。<br /><br />【“那桌甜点看起来很好吃，但职业道德阻止了我的食欲——骗你的，是违约金。”】",
		},
		['半糖柠蜜'] = {
			id = 20130103,
			quality = 4,
			desc = "雇主为汐特意定制的海滨之行度假泳衣，亮丽用色和少女的活泼身影水乳交融，不过略显薄弱的防护还是让汐有些小小担心，毕竟她也说不上来，究竟哪一个瞬间，放松警惕的自己就会被击穿防御。<br /><br />【“阳光！沙滩！海浪和果汁！真是意犹未尽的完美假期！”】",
		},
		['百万伏特宝贝'] = {
			id = 20130206,
			quality = 5,
			desc = "汐在“无限巅峰超弦装甲大奖赛”中使用的战衣，以【翼姬】为核心做了特化改装，且为了这个综艺性质的格斗擂台增加了许多特别的设计，以此来凸显汐的绝美风姿，俏皮气质，以及“无可匹敌的力量”。<br /><br />【“我可是大赛超级明星汐，就要配超级英雄式的紧身衣！”】<br /><br />【乌尔比诺财团们联合打造的'无限巅峰超弦装甲大奖赛'正在如火如荼展开。<br />汐的笑容在全城的大荧幕上闪闪发光——<br />'我是格罗夫财团的参赛代表——百万伏特宝贝，请为我应援！'<br />'Cut！辛苦了，休息一下。'<br />荧幕的另一边，摄影棚里的导演话音未落，刚才还活力四射的小明星就扑到了雇主的身旁。<br />'大小姐，我真的要叫这个名字参赛吗！”<br />“呜呜呜比赛时间好长人家好怕，我想回去给你的花园浇花！'<br />奥黛丽看了看耍赖的家伙，嘴角轻微扬起：<br />'拿下第一，奖金我会给你追加一百万。'<br />刚才还在抱怨“衣服有点紧”“出镜有点害羞”的家伙瞬间消失。<br />一个闪电般的弹射起步，汐又回到了自己的营业现场。<br />电光在战服表面蜿蜒流转，盾牌张开，就像个忠诚的士兵在站岗——<br />'为了格罗夫的荣耀！为了大小姐！百万伏特宝贝，迎接挑战！'<br />（超小声）“嘻嘻，一百万，一百万！”】",
		},
		['百万伏特宝贝-黄金'] = {
			id = 20130207,
			quality = 5,
		},
		['百万伏特宝贝-未来'] = {
			id = 20130208,
			quality = 5,
		},
		['百万伏特宝贝-泡沫'] = {
			id = 20130209,
			quality = 5,
		},
		['百万伏特宝贝-燎原'] = {
			id = 20130210,
			quality = 5,
		},
	},
	['诺诺'] = {
		['晦朔'] = {
			id = 20126001,
			quality = 0,
			desc = "诺诺定制的外出服。整体设计贯彻了机能主义美学，兼顾实用性与灵活性。其胸前佩戴的念灵兽面不仅是点睛之笔，更是感应暗弦波动的神秘媒介。",
		},
		['晦朔-夕照'] = {
			id = 20126002,
			quality = 2,
			desc = "诺诺的替换外出服，暮色深沉时，有助于厘清思路，寻找灵感。",
		},
		['晦朔-浓霞'] = {
			id = 20126003,
			quality = 2,
			desc = "诺诺的替换外出服，朝夕观霞景，能帮助平心静气，保持心情。",
		},
		['晦朔-常磐'] = {
			id = 20126004,
			quality = 2,
			desc = "诺诺的替换外出服，踏入自然中，可以放空思维，重新启航。",
		},
		['晦朔-夜青'] = {
			id = 20126005,
			quality = 2,
			desc = "诺诺的替换外出服，万籁俱寂时，适合孤身漫步，感受静谧。",
		},
		['晦朔-雾止'] = {
			id = 20126006,
			quality = 2,
			desc = "诺诺的替换外出服，薄雾中独行，最宜拂去心尘，归于安然。",
		},
		['晦朔-霄云'] = {
			id = 20126007,
			quality = 2,
			desc = "诺诺的替换外出服，登高处望云，就此释怀烦忧，拥抱长风。",
		},
		['远山遥'] = {
			id = 20126051,
			quality = 3,
			desc = "诺诺的高级替换作战服，取远山之凝重，凸显镇压万敌的决心。",
		},
		['萃香庭'] = {
			id = 20126052,
			quality = 3,
			desc = "诺诺的高级替换作战服，萃取香之沉敛，释放从容破局的雅意。",
		},
		['樱满笺'] = {
			id = 20126053,
			quality = 3,
			desc = "诺诺的高级替换作战服，如落樱之凛冽，绽放一瞬皆杀的绝景。",
		},
		['月暝声'] = {
			id = 20126054,
			quality = 3,
			desc = "诺诺的高级替换作战服，似永夜中幽行，于静默中制敌的寒锋。",
		},
		['梦雨晴星'] = {
			id = 20126101,
			quality = 4,
			desc = "为嘉年华应援分会场准备的主题应援服，融合了乌尔比诺最新的可爱设计，让平日冷静从容的天才看起来娇憨动人，虽然小雨点未曾落下，但执伞的少女已经准备好为眼中的世界驱赶阴霾雾雨。<br /><br />【“我没想那么多哦，只要雨不会淋湿别人，我也不介意踩踩水花。”】",
		},
	},
	['爆裂魔怪'] = {
		['爆裂殖甲'] = {
			id = 20301001,
			quality = 0,
			desc = "晶源体爆裂魔怪的初始形态，可观察到明显的晶簇爆发痕迹，似乎诉说着它带来的可怖痛楚。",
		},
		['裂变体'] = {
			id = 20301006,
			quality = 0,
			desc = "红色三阶",
		},
	},
	['血荆皇女'] = {
		['荆棘殖甲·狩'] = {
			id = 20302001,
			quality = 0,
			desc = "晶源体血荆皇女的初始形态，晶簇如荆棘张开，鲜艳的体色宣告着它是一位危险的捕猎者。",
		},
		['血荆皇女'] = {
			id = 20302006,
			quality = 0,
			desc = "红色三阶",
		},
	},
	['冥荆皇女'] = {
		['荆棘殖甲·愈'] = {
			id = 20305001,
			quality = 0,
			desc = "晶源体冥荆皇女的初始形态，与异形体不同，更加暗沉的体色让它危险地遁入群落中。",
		},
		['冥荆皇女'] = {
			id = 20305003,
			quality = 0,
			desc = "红色三阶",
		},
	},
	['刺镰魔怪'] = {
		['刺镰殖甲'] = {
			id = 20304001,
			quality = 0,
			desc = "晶源体刺镰魔怪的初始形态，其外展的尖刺臂爪俨然是为猎杀而生的利器，宣告着噩兆的开端。",
		},
	},
	['莉莉丝'] = {
		['欲心冰骨'] = {
			id = 20306001,
			quality = 0,
			desc = "仿照人类形体创造的拟态外貌，藏着她的窥视与欲念，是莉莉丝最初的作品。",
		},
		['夜猎时分'] = {
			id = 20306101,
			quality = 4,
			desc = "莉莉丝从猎物的意识中观察到一种有趣的习性，人类会在一些重要的活动或场合更换自己的外观。而出于趣味和学习后的反馈，她特地拟态出了一套全新的外骨骼，让自己夜晚的到访更令人颤栗。<br /><br />【“捕获猎物，怎么不算一种……晚宴呢？”】",
		},
		['蜜蔷温床'] = {
			id = 20306102,
			quality = 4,
			desc = "她并不是那么清楚“情人”的含义，但她知道这个身份让她可以和感兴趣的人黏在一起，她也不太清楚“礼物”有什么意义，但她明了收到的人会感到开心。<br /><br />【“所以，难道有什么礼物，比完美的我更有诚意？”】",
		},
	},
}
