return {
	['绝对执行'] = {
		['甘甜罪念'] = {
			id = 10113108,
			quality = 4,
			desc = "陪伴幽居公主的神奇武器， 饱含怨念的罪恶之果，化作公主手中安静的提灯，这到底是传说不可信，还是公主拥有改变命运的魔力？<br /><br />【“她咬下了饱含怨念与恨意的一口，所以留下的只有幸福的愿景。”】",
		},
	},
	['审判官'] = {
		['纯净铅心'] = {
			id = 10304113,
			quality = 4,
			desc = "守护城市的士兵手中所持的武器，心怀恶念之人常常控诉士兵的无情，但唯有站在士兵身后哪些饱受欺凌的弱小，才会看见枪身上跳动着士兵炽热的心。<br /><br />【“为了这片城邦，请将我的心脏，铸作枪膛。”】",
		},
	},
	['焚焰者'] = {
		['诱焰靡影'] = {
			id = 12307106,
			quality = 8,
			desc = "小魔女的童话中出现的神秘之物，魔女的力量拥有点亮寒夜的权能，为善良贫苦之人带来温热的希望，也为贪婪的权贵们准备了炽烈的裁决。<br /><br />【“童话就是这样，有趣的好人就要围着篝火跳舞。”】",
		},
	},
	['鸣火'] = {
		['窃厄谜火'] = {
			id = 10603206,
			quality = 5,
			desc = "吟游诗里小魔女艾卡的随身伙伴，是武器还是魔杖无人能够分清，但传说中有贪恶之人抢走了艾卡送出的火柴，却在半夜收获了魂飞魄散的惊吓和烧光房子的惩罚，但人们相信，会这么做的一定不是善良的小艾卡。<br /><br />【“你问我？我怎么知道，我只是一根大号火柴。”】",
		},
	},
}
