return {
	['警探'] = {
		Bilibili = {
			id = 10101014,
			quality = 3,
			desc = "“警探”的个性化定制涂装，这款涂装诉说着米雪儿相信的一个真理。<br />“皮肤越粉，打人越狠。”",
		},
		['斗鱼'] = {
			id = 10101018,
			quality = 3,
			desc = "“警探”的个性化定制涂装，米雪儿的Q版形象也跃动了起来。<br />“斗鱼莫夫，打到你哭。”",
		},
		['虎牙'] = {
			id = 10101019,
			quality = 3,
			desc = " “警探”的个性化定制涂装，这份涂装纪念着米雪儿第一次完成任务时的笑脸。<br /> “小小先锋，准备突击！”",
		},
	},
	['绽放'] = {
		['雾尘凝织'] = {
			id = 10111110,
			quality = 4,
			desc = "“绽放”的全新涂装。珐格兰丝仿照古法，将植物的精华织入锦缎。弦能流转间，比子弹更早出膛的，是独属于她的芳馨气息。<br /><br />【“芬芳之间，杀机流转。”】",
		},
	},
	['逆焰'] = {
		['最强拳手'] = {
			id = 10102118,
			quality = 4,
			desc = "“逆焰”的个人定制版涂装，是赢得枕头大战的胜利后，为了庆祝所做的新装饰。橙白配色给人可爱讨喜之感，但带着红色手套的拳王还是暴露了其主人一往无前战至尽头的作风。<br /><br />【“哈？把我当软柿子？待会儿出局了可别哭！”】",
		},
	},
	['幻霜'] = {
		['眠竹悠暖'] = {
			id = 10501117,
			quality = 4,
			desc = "“幻霜”的派对限定版，顺应伙伴们的提议，少女也对自己的武器进行了对应元素的涂装改造。伴随着笑声和棉絮落下的，还有她融入大家的柔软愿望。<br /><br />【“这样的温暖，想要一直……”】",
		},
	},
	['独舞'] = {
		['幽焚蚀影'] = {
			id = 10502206,
			quality = 5,
			desc = "“独舞”于蛇灵的玄鳞之畔展现的全新形态。来自玄冥的磷火在蛇骨的间隙中灼烧，被那火焰击中之人，其神志与魂灵终将向灵蛇俯首，成为她的仆从。<br /><br />【“在灼身的痛苦中臣服于灵蛇……臣服于我吧。”】",
		},
	},
	['重焰'] = {
		['潮流酷鲨'] = {
			id = 12201103,
			quality = 4,
			desc = "肥肥鲨为了援助新朋友绯莎特意从家乡带来的涂装，酷酷的鲨鱼张嘴笑哈哈，向所有人传递友情的讯号，但如果不是伙伴的话，可就要小心他凶猛的尖牙。<br /><br />【“嗷呜——我这只大鲨鱼，要吃掉我的猎物——嘿嘿，只是闹着玩啦！”】",
		},
		['欢海萌主'] = {
			id = 12201104,
			quality = 4,
			desc = "粉粉鲨为了守护新朋友绯莎，和肥肥鲨一样准备了涂装，可爱的鲨鱼女孩虽然不喜欢跟人吵架，但是为了伙伴，她也有自己要坚持的原则，和守护伙伴的魔法。<br /><br />【“我也是大鲨鱼，而且我是更凶更凶的大鲨鱼——嘻嘻，一起玩吧！”】",
		},
	},
	['忍锋'] = {
		['裁魂'] = {
			id = 15201105,
			quality = 8,
			desc = "召唤蛇灵圣女的重要仪式道具。冥火于刀锋之上阴燃，裁断魂魄，隔绝明光。这并非邪恶之物，只是提醒世人：若非求取到她的喜爱与宽赦，凡探求隐秘者，皆须付出应有的代价。<br /><br />【“玄鳞覆骨，沉于冷月不照之处。”】",
		},
	},
	['风场雷'] = {
		['蓬松蹦床'] = {
			id = 18401052,
			quality = 3,
			desc = "给你的对手梦幻般的飞行。",
		},
	},
	['拦截者'] = {
		['轻柔截网'] = {
			id = 18801053,
			quality = 3,
			desc = "不要小看我的泡泡力场！",
		},
	},
	['齿锋'] = {
		['萌萌织偶'] = {
			id = 10108120,
			quality = 4,
			desc = "“齿峰”套上萌萌的针织涂装，在玩偶的海洋中，凌乱的针脚成为了最好的迷彩！<br /><br />【“我可是在玩偶店做过兼职的。”】",
		},
		['酷酷手作'] = {
			id = 10108121,
			quality = 4,
			desc = "“齿峰”套上手作的软萌涂装，即便已经成为掉进玩偶堆里就找不到的样子，但绯莎坚称这依然很酷！<br /><br />【“这是我的手工作品，雇佣兵当然要会点缝纫。”】",
		},
	},
	['隼'] = {
		['亘夜幽鸣'] = {
			id = 10105118,
			quality = 4,
			desc = "“隼”将自身化为古老部族的礼器，悠远的鸣响穿过亘古的长夜，将先民的呼吸传音至遥远的位面，于新世代唤醒人们对真理的追寻。<br /><br />【“以我之声，驱离长夜的幽寒。”】",
		},
	},
	['北极星'] = {
		['夜阑金辉'] = {
			id = 10106117,
			quality = 4,
			desc = "“北极星”的“梦想成为幻兽大师”主题活动定制涂装，星辉孕育的幻兽施展出神奇的魔法，像它的主人一样，想要将这个世界的每一个角落都照亮。<br /><br />【“我们有梦想也有伙伴，所以寒冷的黑夜不会漫长。”】",
		},
	},
	['空境'] = {
		['海兔追潮'] = {
			id = 10202117,
			quality = 4,
			desc = "“空境”的“梦想成为幻兽大师”主题活动定制涂装，幻兽大师的海兔搭档凝聚了浪花的力量，这一路上，他们必定会乘风破浪，直至旅途被传唱。<br /><br />【“出击！向着大海的另一边，我们一定会找到梦想之星！”】",
		},
	},
	['破晓'] = {
		['度夏凉伞'] = {
			id = 10303112,
			quality = 4,
			desc = "”破晓“的加热工坊特制涂装，使用了生活化的物件，搭配轻松凉爽的色调，无论是夏天还是其他炎热的空间，它都能带来安定人心的清凉和火力上的良好表现。<br /><br />【“睡着的话，就算是夏夜也会变得凉爽。”】",
		},
	},
}
